blog.org
* Blog
  
m-9 vimp返回最后一个tab
  
https://stackoverflow.com/questions/9387816/how-to-call-interactive-emacs-lisp-function-with-a-prefix-argument-from-another
匿名函数
#+BEGIN_SRC  
(call-interactively '(lambda ()
                       (interactive)
                       (flyspell-mode '(4))))
#+END_SRC
  
https://www.google.com/search?q=grub2+boot+fedora


如何解决sed不支持非贪婪*？
- https://www.google.com/search?q=sed+posix+match+replacement
- https://stackoverflow.com/questions/1103149/non-greedy-regex-matching-in-sed
perl -pe 's|(http://.*?/).*|\1|'

printf 孙 | iconv -f utf-8 -t gbk | od -h --endian=big
http://tool.haooyou.com/code?group=convert&type=strToHex&charset=GB2312
