blog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>blog</title>
<!-- 2017-07-15 Sat 11:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ken Young" />
</head>
<body>
<div id="content">
<h1 class="title">blog</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Blog</a>
<ul>
<li><a href="#sec-1-1">1.1. 如何emacs转换ansi编码为utf-8编码？</a></li>
<li><a href="#sec-1-2">1.2. 如何emacs查看文件编码？</a></li>
<li><a href="#sec-1-3">1.3. <span class="done DONE">DONE</span> 如何emacs指定编码查看文件（decoding）？</a></li>
<li><a href="#sec-1-4">1.4. 什么是字符集（charset）和编码(encoding)的区别？</a></li>
<li><a href="#sec-1-5">1.5. <span class="done DONE">DONE</span> 什么是ansi编码和gbk编码的区别？</a></li>
<li><a href="#sec-1-6">1.6. 如何firefox解析github的html文件？</a></li>
<li><a href="#sec-1-7">1.7. 如何保证单元测试代码正确？</a></li>
<li><a href="#sec-1-8">1.8. <span class="done DONE">DONE</span> 如何emacs org快速检索shunit2下的bash -x的追踪信息？</a></li>
<li><a href="#sec-1-9">1.9. 如何emacs org加粗符号*需要空格才有效？</a></li>
<li><a href="#sec-1-10">1.10. 为什么工程（项目）需要根目录的概念？</a></li>
<li><a href="#sec-1-11">1.11. <span class="done DONE">DONE</span> 如何解决bash tar报错tar: Removing leading `/' from member names？</a></li>
<li><a href="#sec-1-12">1.12. 如何快速检索emacs org文档？</a></li>
<li><a href="#sec-1-13">1.13. 如何emacs org使用markdown的反引号？</a></li>
<li><a href="#sec-1-14">1.14. 如何阅读bash -x的追踪信息？</a></li>
<li><a href="#sec-1-15">1.15. 如何emacs显示空白字符（空格、制表符、换行符等）？</a></li>
<li><a href="#sec-1-16">1.16. <span class="done DONE">DONE</span> 如何bash -x只是替换而不执行？</a></li>
<li><a href="#sec-1-17">1.17. <span class="todo TODO">TODO</span> 如何bash debug？</a></li>
<li><a href="#sec-1-18">1.18. 如何bash解决cmd变量配合bash -x调试，开关eval麻烦问题？</a></li>
<li><a href="#sec-1-19">1.19. 如何bash单步调试？</a></li>
<li><a href="#sec-1-20">1.20. 为什么代码最终目的是阅读，不仅是运行？</a></li>
<li><a href="#sec-1-21">1.21. 如何bash判断文件1是文件2（目录）的子文件？</a></li>
<li><a href="#sec-1-22">1.22. 如何bash查看脚本执行的历史命令？</a></li>
<li><a href="#sec-1-23">1.23. 如何linux tar解压指定文件名或目录？</a></li>
<li><a href="#sec-1-24">1.24. 如何bash shunit2断言文件存在？</a></li>
<li><a href="#sec-1-25">1.25. <span class="done DONE">DONE</span> 什么tar打包压缩格式的区别（gz、bz2、xz）？</a></li>
<li><a href="#sec-1-26">1.26. <span class="done DONE">DONE</span> 什么是日期、时间格式规范？</a></li>
<li><a href="#sec-1-27">1.27. <span class="done DONE">DONE</span> 什么是rfc、iso区别？</a></li>
<li><a href="#sec-1-28">1.28. 如何vim删除当前光标到结尾的字符串？</a></li>
<li><a href="#sec-1-29">1.29. <span class="done DONE">DONE</span> 如何linux模拟windows的回收站（trash标准或规范）？</a></li>
<li><a href="#sec-1-30">1.30. 为什么不使用/tmp作为回收站？</a></li>
<li><a href="#sec-1-31">1.31. 为什么使用测试驱动开发？</a></li>
<li><a href="#sec-1-32">1.32. 什么是bash执行顺序？</a></li>
<li><a href="#sec-1-33">1.33. 如何选择bash eval执行命令字符串时，字符串内部是单引号还是双引号？</a></li>
<li><a href="#sec-1-34">1.34. <span class="done DONE">DONE</span> 如何命名单元测试的测试目录？</a></li>
<li><a href="#sec-1-35">1.35. <span class="done DONE">DONE</span> 如何选择单元测试目录？</a></li>
<li><a href="#sec-1-36">1.36. 什么是集成测试和系统测试的区别？</a></li>
<li><a href="#sec-1-37">1.37. 什么是单元测试和集成测试的区别？</a></li>
<li><a href="#sec-1-38">1.38. <span class="done DONE">DONE</span> 如何解决linux rm删除文件时，可能误删除的问题？</a></li>
<li><a href="#sec-1-39">1.39. <span class="done DONE">DONE</span> 如何shunit2命名测试文件？</a></li>
<li><a href="#sec-1-40">1.40. 为什么需要单元测试？</a></li>
<li><a href="#sec-1-41">1.41. 如何bash使用;结尾，";"或" ;"？</a></li>
<li><a href="#sec-1-42">1.42. 如何bash cd快速切换目录？</a></li>
<li><a href="#sec-1-43">1.43. 如何解决emacs dired使用mvt脚本，报错"sudo: no tty present and no askpass program specified"（sudo需要输入密码导致）？</a></li>
<li><a href="#sec-1-44">1.44. 如何解决bash ${*}参数中双引号失效问题（空格导致）？</a></li>
<li><a href="#sec-1-45">1.45. 如何测试bash的BASH<sub>SOURCE变量，不写脚本？</sub></a></li>
<li><a href="#sec-1-46">1.46. 什么是bash ${!var}含义？</a></li>
<li><a href="#sec-1-47">1.47. <span class="done DONE">DONE</span> 如何bash获取执行脚本的文件路径？</a></li>
<li><a href="#sec-1-48">1.48. 如何emacs dired检索并标记文件？</a></li>
<li><a href="#sec-1-49">1.49. 为什么使用bash脚本mvt作为emacs dired删除命令，而不是直接写elisp脚本？</a></li>
<li><a href="#sec-1-50">1.50. 如何命名软件程序的配置目录名？</a></li>
<li><a href="#sec-1-51">1.51. 如何emacs shell输入密码时使用*代替？</a></li>
<li><a href="#sec-1-52">1.52. 如何emacs dired切换为shell时，shell当前目录为dired的当前目录？</a></li>
<li><a href="#sec-1-53">1.53. 如何emacs dired使用git push？</a></li>
<li><a href="#sec-1-54">1.54. 如何emacs dired使用backspace返回上一级？</a></li>
<li><a href="#sec-1-55">1.55. 如何emacs org快速排序item项？</a></li>
<li><a href="#sec-1-56">1.56. 如何emacs dired光标快速定位目标文件（或目录）？</a></li>
<li><a href="#sec-1-57">1.57. 什么是括号是否换行的最佳实践？</a></li>
<li><a href="#sec-1-58">1.58. 为什么bash if语句中常量放谓语前面，变量谓语后面？</a></li>
<li><a href="#sec-1-59">1.59. 什么是bash脚本开发时选项规范？</a></li>
<li><a href="#sec-1-60">1.60. 为什么开发bash脚本时，命令的选项尽量使用完整名，而不是缩写？</a></li>
<li><a href="#sec-1-61">1.61. 什么是sed -En 's|x|y|g'和sed -E 's|x|y|gp'的区别？</a></li>
<li><a href="#sec-1-62">1.62. <span class="done DONE">DONE</span> 什么是realpath -m含义？</a></li>
<li><a href="#sec-1-63">1.63. <span class="done DONE">DONE</span> 如何linux bash转换相对路径.为绝对路径？</a></li>
<li><a href="#sec-1-64">1.64. 如何emacs org删除文件到回收站目录，而不是直接删除文件？</a></li>
<li><a href="#sec-1-65">1.65. 如何emacs org检索文档时，仅仅检索item项标题？</a></li>
<li><a href="#sec-1-66">1.66. 如何linux nohup不输出nohup.out？</a></li>
<li><a href="#sec-1-67">1.67. <span class="done DONE">DONE</span> 什么是linux网站dir.com和man7.org的区别？</a></li>
<li><a href="#sec-1-68">1.68. 什么是总结和读书笔记的区别？</a></li>
<li><a href="#sec-1-69">1.69. 如何linux快速打开历史文件？</a></li>
<li><a href="#sec-1-70">1.70. 如何linux bash判断目录是否是git工程？</a></li>
<li><a href="#sec-1-71">1.71. 如何linux bash清屏？</a></li>
<li><a href="#sec-1-72">1.72. 是否linux管道是子进程？</a></li>
<li><a href="#sec-1-73">1.73. <span class="done DONE">DONE</span> 什么是linux man数字区别？</a></li>
<li><a href="#sec-1-74">1.74. <span class="done DONE">DONE</span> 如何linux bash延迟或挂起脚本？</a></li>
<li><a href="#sec-1-75">1.75. <span class="done DONE">DONE</span> 如何bash使用while循环？</a></li>
<li><a href="#sec-1-76">1.76. <span class="done DONE">DONE</span> 如何linux bash排序文本行？</a></li>
<li><a href="#sec-1-77">1.77. <span class="done DONE">DONE</span> 如何awk使用数组？</a></li>
<li><a href="#sec-1-78">1.78. <span class="done DONE">DONE</span> 什么是bash &lt;&lt;&lt;含义？</a></li>
<li><a href="#sec-1-79">1.79. <span class="done DONE">DONE</span> 如何vim返回历史光标位置？</a></li>
<li><a href="#sec-1-80">1.80. <span class="done DONE">DONE</span> 如何vim m标记光标位置？</a></li>
<li><a href="#sec-1-81">1.81. 如何linux bash编辑pdf的页码？</a></li>
<li><a href="#sec-1-82">1.82. <span class="done DONE">DONE</span> 如何sed输出正则匹配的字符串组？</a></li>
<li><a href="#sec-1-83">1.83. <span class="done DONE">DONE</span> 如何使用bash grep sed awk？</a></li>
<li><a href="#sec-1-84">1.84. <span class="done DONE">DONE</span> 如何linux ping输出显示域名而不是ip？</a></li>
<li><a href="#sec-1-85">1.85. <span class="done DONE">DONE</span> 如何awk设置分隔符？</a></li>
<li><a href="#sec-1-86">1.86. 如何linux查看后台进程？</a></li>
<li><a href="#sec-1-87">1.87. 如何bash for变量标准输入stdin的内容？</a></li>
<li><a href="#sec-1-88">1.88. <span class="done DONE">DONE</span> 如何判断bash的变量是数组或非数组？</a></li>
<li><a href="#sec-1-89">1.89. <span class="done DONE">DONE</span> 什么是bash中数组变量和非数组变量的区别？</a></li>
<li><a href="#sec-1-90">1.90. <span class="done DONE">DONE</span> 如何解决emacs执行linux命令不输出结果，"Shell command succeeded with no output"？</a></li>
<li><a href="#sec-1-91">1.91. 如何bash -c使用pipe管道？</a></li>
<li><a href="#sec-1-92">1.92. <span class="done DONE">DONE</span> 什么是mapfile(readarray)和mapfile -t的区别？</a></li>
<li><a href="#sec-1-93">1.93. <span class="done DONE">DONE</span> 什么是bash中数组${name[*]}和"${name[@]}"的区别？</a></li>
<li><a href="#sec-1-94">1.94. 如何bash cat here doc使用pipe传递结果？</a></li>
<li><a href="#sec-1-95">1.95. 如何emacs dired快速跳转指定行？</a></li>
<li><a href="#sec-1-96">1.96. <span class="done DONE">DONE</span> 如何使用shunit2？</a></li>
<li><a href="#sec-1-97">1.97. <span class="done DONE">DONE</span> 什么是bash的单元测试框架？</a></li>
<li><a href="#sec-1-98">1.98. <span class="done DONE">DONE</span> 如何vimp处理编写映射脚本时的冒号:？</a></li>
<li><a href="#sec-1-99">1.99. <span class="done DONE">DONE</span> 如何vimp映射leader key快捷键？</a></li>
<li><a href="#sec-1-100">1.100. <span class="done DONE">DONE</span> 如何vimp设置firefox的option选项？</a></li>
<li><a href="#sec-1-101">1.101. <span class="done DONE">DONE</span> 如何vimp映射按键？</a></li>
<li><a href="#sec-1-102">1.102. <span class="done DONE">DONE</span> 如何vimp设置firefox的缩放比例为150%？</a></li>
<li><a href="#sec-1-103">1.103. <span class="done DONE">DONE</span> 如何使用emacs org的字段引用？</a></li>
<li><a href="#sec-1-104">1.104. <span class="done DONE">DONE</span> 如何markdown使用url超链接引用？</a></li>
<li><a href="#sec-1-105">1.105. <span class="done DONE">DONE</span> 如何emacs org导出html，取消显示作者？</a></li>
<li><a href="#sec-1-106">1.106. 如何使用marmalade或melpa安装emacs插件？</a></li>
<li><a href="#sec-1-107">1.107. 什么是marmalade和melpa的区别？</a></li>
<li><a href="#sec-1-108">1.108. <span class="done DONE">DONE</span> 如何emacs org使用firefox预览org文件？</a></li>
<li><a href="#sec-1-109">1.109. <span class="done DONE">DONE</span> 如何bash转换url后缀为文件名？</a></li>
<li><a href="#sec-1-110">1.110. <span class="done DONE">DONE</span> 如何linux tar指定解压目录？</a></li>
<li><a href="#sec-1-111">1.111. <span class="done DONE">DONE</span> 什么是emacs命令load和require的区别？</a></li>
<li><a href="#sec-1-112">1.112. 如何判断英语which修饰的词语？</a></li>
<li><a href="#sec-1-113">1.113. 什么是emacs的默认插件目录？</a></li>
<li><a href="#sec-1-114">1.114. 如何安装proxychains-ng？</a></li>
<li><a href="#sec-1-115">1.115. <span class="done DONE">DONE</span> 如何git添加github远程仓库链接地址到本地仓库？</a></li>
<li><a href="#sec-1-116">1.116. <span class="done DONE">DONE</span> 如何emacs org查看代码块支持的语言种类？</a></li>
<li><a href="#sec-1-117">1.117. <span class="done DONE">DONE</span> 什么是emacs org org-sparse-tree函数源代码中#含义？</a></li>
<li><a href="#sec-1-118">1.118. <span class="done DONE">DONE</span> 如何emacs lisp导入el文件？</a></li>
<li><a href="#sec-1-119">1.119. <span class="done DONE">DONE</span> 如何定义emacs函数？</a></li>
<li><a href="#sec-1-120">1.120. <span class="done DONE">DONE</span> 如何定义emacs interactive交互函数？</a></li>
<li><a href="#sec-1-121">1.121. <span class="done DONE">DONE</span> 如何emacs调用interactive交互函数？</a></li>
<li><a href="#sec-1-122">1.122. 如何emacs c-h k查看emacs org s-tab 2次的快捷键？</a></li>
<li><a href="#sec-1-123">1.123. <span class="done DONE">DONE</span> 如何emacs org检索指定时间段的日程？</a></li>
<li><a href="#sec-1-124">1.124. 什么是fdisk type和mkfs type的区别？</a></li>
<li><a href="#sec-1-125">1.125. <span class="done DONE">DONE</span> 如何解决python报错"You are trying to run the Python 2 version of Beautiful Soup under Python 3."</a></li>
<li><a href="#sec-1-126">1.126. <span class="done DONE">DONE</span> 如何解决运行bs4脚本警告"No parser was explicitly specified"？</a></li>
<li><a href="#sec-1-127">1.127. 什么是pip？</a></li>
<li><a href="#sec-1-128">1.128. 什么是pip和python version的关系？</a></li>
<li><a href="#sec-1-129">1.129. 如何检索pip使用的默认python version？</a></li>
<li><a href="#sec-1-130">1.130. 如何在virtualenv下使用pip install？</a></li>
<li><a href="#sec-1-131">1.131. 如何使用virtualenv？</a></li>
<li><a href="#sec-1-132">1.132. <span class="done DONE">DONE</span> 如何检索virtualenv目录的python版本？</a></li>
<li><a href="#sec-1-133">1.133. <span class="done DONE">DONE</span> 如何安装python beautifulsoup？</a></li>
<li><a href="#sec-1-134">1.134. <span class="done DONE">DONE</span> 如何使用linux dd制作fedora安装优盘？</a></li>
<li><a href="#sec-1-135">1.135. 如何检索fdisk中l选项的详细信息？</a></li>
<li><a href="#sec-1-136">1.136. 如何检索笔记本电脑主板是uefi或efi或bios类型？</a></li>
<li><a href="#sec-1-137">1.137. 什么是grub2优盘dos gpt分区表区别？</a></li>
<li><a href="#sec-1-138">1.138. 如何解决linux umount报错"target is busy"？</a></li>
<li><a href="#sec-1-139">1.139. <span class="done DONE">DONE</span> 如何设置软件工程目录（测试）的各目录？</a></li>
<li><a href="#sec-1-140">1.140. 如何设置emacs shell当前目录为emacs dired当前目录？</a></li>
<li><a href="#sec-1-141">1.141. 如何解决emacs shell调用bash脚本输入密码为明文？</a></li>
<li><a href="#sec-1-142">1.142. <span class="done DONE">DONE</span> 什么是yasnippet目录？</a></li>
<li><a href="#sec-1-143">1.143. <span class="done DONE">DONE</span> 如何编写软件文档？</a></li>
<li><a href="#sec-1-144">1.144. <span class="done DONE">DONE</span> 如何解决linux date +%X不是24小时制？</a></li>
<li><a href="#sec-1-145">1.145. <span class="done DONE">DONE</span> 哪个好，环境变量PATH放在bashrc或bash<sub>profile？</sub></a></li>
<li><a href="#sec-1-146">1.146. 如何git commit不输入信息message？</a></li>
<li><a href="#sec-1-147">1.147. 如何解决xargs并行执行时输出顺序混乱？</a></li>
<li><a href="#sec-1-148">1.148. <span class="done DONE">DONE</span> 什么是xargs -i -I的区别？</a></li>
<li><a href="#sec-1-149">1.149. <span class="done DONE">DONE</span> 如何xargs指定参数位置？</a></li>
<li><a href="#sec-1-150">1.150. <span class="done DONE">DONE</span> 如何bash读取cat here doc内联输入重定向&lt;&lt;的内容？（如何bash从标准输入stdin读取多行内容？）</a></li>
<li><a href="#sec-1-151">1.151. 如何使用grub2引导winpe？</a></li>
<li><a href="#sec-1-152">1.152. 如何解决grub2 shell加载模块报错"file not found memdisk"</a></li>
<li><a href="#sec-1-153">1.153. 如何grub2 shell切换分区？</a></li>
<li><a href="#sec-1-154">1.154. 如何linux增加分区空间？</a></li>
<li><a href="#sec-1-155">1.155. <span class="done DONE">DONE</span> 如何查看linux分区的文件系统类型？</a></li>
<li><a href="#sec-1-156">1.156. 如何解决grub2 shell切换分区报错"error unknown filesystem"？</a></li>
<li><a href="#sec-1-157">1.157. 如何进入grub2 shell？</a></li>
<li><a href="#sec-1-158">1.158. <span class="done DONE">DONE</span> 如何解决virtualbox fedora linux安装addition增强包报错"failed to set up service vboxadd"</a></li>
<li><a href="#sec-1-159">1.159. <span class="todo TODO">TODO</span> 如何解决virtualbox fedora linux挂载共享文件报错"unknown filesystem type vboxsf"？</a></li>
<li><a href="#sec-1-160">1.160. <span class="done DONE">DONE</span> 如何宿主共享文件夹给virtualbox fedora linux？</a></li>
<li><a href="#sec-1-161">1.161. <span class="todo TODO">TODO</span> 如何解决插入优盘被virtualbox windows虚拟机优先识别？</a></li>
<li><a href="#sec-1-162">1.162. <span class="done DONE">DONE</span> 如何修改grub2启动界面内容？</a></li>
<li><a href="#sec-1-163">1.163. 如何使用grub2安装fedora？</a></li>
<li><a href="#sec-1-164">1.164. <span class="todo TODO">TODO</span> 如何制作grub2 bios mbr安装优盘？</a></li>
<li><a href="#sec-1-165">1.165. 如何避免误删除或误格式化？</a></li>
<li><a href="#sec-1-166">1.166. <span class="done DONE">DONE</span> 什么是bios和uefi的区别？</a></li>
<li><a href="#sec-1-167">1.167. <span class="done DONE">DONE</span> 什么是优盘分区表和grub2的关系？</a></li>
<li><a href="#sec-1-168">1.168. <span class="done DONE">DONE</span> 什么是grub2-install和grub-install区别？</a></li>
<li><a href="#sec-1-169">1.169. 如何解决umount: /mnt/gr: target is busy？</a></li>
<li><a href="#sec-1-170">1.170. 如何解决grub2没有/boot/grub/menu.lst文件？</a></li>
<li><a href="#sec-1-171">1.171. <span class="done DONE">DONE</span> 什么是磁盘分区表的区别？</a></li>
<li><a href="#sec-1-172">1.172. 如何使用windows制作fedora usb优盘安装盘？</a></li>
<li><a href="#sec-1-173">1.173. <span class="done DONE">DONE</span> 如何linux cli shell格式化优盘为ntfs？</a></li>
<li><a href="#sec-1-174">1.174. 如何解决linux格式化优盘时报错"Re-reading the partition table failed.: Device or resource busy"？</a></li>
<li><a href="#sec-1-175">1.175. <span class="done DONE">DONE</span> 如何linux快速格式化优盘？</a></li>
<li><a href="#sec-1-176">1.176. <span class="done DONE">DONE</span> 如何选择usb优盘的文件系统格式？</a></li>
<li><a href="#sec-1-177">1.177. 如何使用loopback loop命令？</a></li>
<li><a href="#sec-1-178">1.178. <span class="done DONE">DONE</span> 如何下载指定版本的fedora iso镜像？</a></li>
<li><a href="#sec-1-179">1.179. 如何安装fedora linux？</a></li>
<li><a href="#sec-1-180">1.180. 如何使用linux制作fedora usb安装盘？</a></li>
<li><a href="#sec-1-181">1.181. 如何git到github？</a></li>
<li><a href="#sec-1-182">1.182. <span class="done DONE">DONE</span> 如何解决git clone时报错目录不为空"fatal: destination path '.' already exists and is not an empty directory."？</a></li>
<li><a href="#sec-1-183">1.183. 170620</a></li>
<li><a href="#sec-1-184">1.184. 如何fedora安装sougou搜狗输入法？</a></li>
<li><a href="#sec-1-185">1.185. <span class="done DONE">DONE</span> 如何wget指定下载文件名？</a></li>
<li><a href="#sec-1-186">1.186. <span class="done DONE">DONE</span> 如何检索tar包内容？</a></li>
<li><a href="#sec-1-187">1.187. 如何linux安装fcitx输入法？</a></li>
<li><a href="#sec-1-188">1.188. <span class="done DONE">DONE</span> 如何切换fedora cli shell为gui shell？</a></li>
<li><a href="#sec-1-189">1.189. <span class="done DONE">DONE</span> 如何virtualbox gui克隆镜像？</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Blog</h2>
<div class="outline-text-2" id="text-1">
<p>
m-9 vimp返回最后一个tab
</p>

<p>
<a href="https://stackoverflow.com/questions/9387816/how-to-call-interactive-emacs-lisp-function-with-a-prefix-argument-from-another">https://stackoverflow.com/questions/9387816/how-to-call-interactive-emacs-lisp-function-with-a-prefix-argument-from-another</a>
匿名函数
</p>
<pre class="example">
(call-interactively '(lambda ()
                       (interactive)
                       (flyspell-mode '(4))))
</pre>

<p>
<a href="https://www.google.com/search?q=grub2+boot+fedora">https://www.google.com/search?q=grub2+boot+fedora</a>
</p>


<p>
如何解决sed不支持非贪婪*？
</p>
<ul class="org-ul">
<li><a href="https://www.google.com/search?q=sed+posix+match+replacement">https://www.google.com/search?q=sed+posix+match+replacement</a>
</li>
<li><a href="https://stackoverflow.com/questions/1103149/non-greedy-regex-matching-in-sed">https://stackoverflow.com/questions/1103149/non-greedy-regex-matching-in-sed</a>
</li>
</ul>
<p>
perl -pe 's|(<a href="http://.*?/">http://.*?/</a>).*|\1|'
</p>
</div>
