blog.org
** DONE 如何emacs dired切换shell时，shell目录为dired的当前目录？
   CLOSED: [2017-07-17 Mon 20:03]
？开发ken_script项目，git push时切换（dired不支持git输入帐号密码）

#+BEGIN_SRC  
https://www.google.com/search?q=emacs+shell+dired+current+dir
https://emacs.stackexchange.com/questions/5676/how-can-i-keep-dired-in-sync-with-a-shell-buffer

(add-hook 'dired-after-readin-hook (lambda()
                     (unless (get-buffer "*shell*") (shell "*shell*"))
                     (process-send-string (get-buffer "*shell*") (format "cd %s\n" default-directory))
                     (message "Switched to new directory")))
#+END_SRC

** 为什么emacs的manual pdf和html的目录不一致？
？emacs --batch和--script需要引用。
** 如何emacs使用elisp脚本转换org文档为html？
？--batch不如--script通用，使用移动设备阅读org文档。

可移植性shebang（windows中使用emacs --script可用）
#+BEGIN_SRC  
https://www.google.com/search?q=emacs+命令行+elisp+脚本
https://github.com/xuchunyang/blog/blob/master/posts/2016/06/Emacs-Lisp-as-script-language.org
#+END_SRC

直接使用(org-html-export-to-html)，报错
#+BEGIN_SRC  
Symbol’s function definition is void: org-html-export-to-html
#+END_SRC
** DONE 如何emacs使用elisp函数转换org文档为html？
   CLOSED: [2017-07-17 Mon 17:51]
？使用移动设备阅读org文档。

#+BEGIN_SRC  
https://www.google.com/search?q=emacs+lisp+bash++org+html
https://stackoverflow.com/questions/22072773/batch-export-of-org-mode-files-from-the-command-line

emacs myorgfile.org --batch -f org-html-export-to-html --kill

emacs t.org -f org-html-export-to-html
#+END_SRC

参考
#+BEGIN_SRC  
https://www.google.com/search?q=emacs+manual+funcall&ie=utf-8&oe=utf-8
https://www.gnu.org/software/emacs/manual/html_mono/emacs.html
C.1 Action Arguments
https://www.gnu.org/software/emacs/manual/pdf/emacs.pdf
C.1    Action Arguments
#+END_SRC
** DONE 如何linux bash运行emacs lisp脚本？
   CLOSED: [2017-07-17 Mon 16:03]
？转换org文档为html。

#+BEGIN_SRC  
https://www.google.com/search?q=emacs+lisp+script+cli&ie=utf-8&oe=utf-8
http://ergoemacs.org/emacs/elisp_running_script_in_batch_mode.html

emacs --script process_log.el

https://www.google.com/search?q=emacs+--script+manual&ie=utf-8&oe=utf-8
https://www.gnu.org/software/emacs/manual/html_node/emacs/Initial-Options.html
#+END_SRC

t.el
#+BEGIN_SRC  
(message "hi")
#+END_SRC

#+BEGIN_SRC  
emacs --script t.el # windows也能用
#+END_SRC
** 如何gnome terminal解决emacs c-m-s快捷键无法使用正则检索功能（m被占用）？
** 如何bash使用bool变量？
？判断目录是否被挂载，用于挂载安卓设备。

** 如何linux mount安卓设备？
？复制gtd目录。

#+BEGIN_SRC  
https://www.google.com/search?q=android+linux+mount
simple-mtpfs -l

https://github.com/phatina/simple-mtpfs

mount1
simple-mtpfs mountpoint [options]
simple-mtpfs --device <number> mountpoint

unmount
fusermount -u <mountpoint>
#+END_SRC

simple-mtpfs不稳定。

** DONE 如何linux fusermount -u解决Device or resource busy？
   CLOSED: [2017-07-17 Mon 13:46]
？卸载已挂载安卓的目录。

#+BEGIN_SRC  
https://www.google.com/search?q=Device+or+resource+busy
https://unix.stackexchange.com/questions/11238/how-to-get-over-device-or-resource-busy

lsof +D /path
kill -9
#+END_SRC


** 如何linux切换shell？
？切换zsh为bash。

** 如何emacs org检索标题？
？解决内容检索慢问题。

^\*.*key.*
** 什么是linux发布规则？
？发布ahk_foxit，需要标注foxit版本号。

ahk_foxit
AHK script for pdf reader FoxitReader-8.1
#+BEGIN_SRC  
Unix编程艺术 p444

foo-1.2.3.tar.gz
#+END_SRC
** 如何emacs dired切换为shell时，shell当前目录为dired的当前目录？
？用于git push，发布ken_script。
** 如何emacs快速部署到windows？
？开发ahk foxit。
** 如何emacs定义宏？
？开发ahk foxit，需要批量转换send,为send % "


** 什么bash和python的区别？
？使用python代替bash作为脚本（emacs调用）。
** DONE 如何linux gnome更换terminal的颜色主题？
   CLOSED: [2017-07-16 Sun 10:22]
？解决gnome-terminal默认主题刺眼（黑白，参考emacs的dark系列）

#+BEGIN_SRC  
https://www.google.com/search?q=gnome+terminal+theme&ie=utf-8&oe=utf-8
https://help.gnome.org/users/gnome-terminal/stable/app-colors.html.en

Select Edit ▸ Profile Preferences ▸ Colors.

solarized dark
#+END_SRC
** 如何emacs将选中区域作为bash shell命令的参数？
？使用firefox打开选中的链接。

** DONE 如何emacs转换编码（ansi模式的gbk编码为utf-8编码）？
   CLOSED: [2017-07-15 Sat 19:51]
？解决windows下开发富甲天下3V5的ahk宏，注释乱码。

#+BEGIN_SRC  
emacs编码操作参考集合
https://www.google.com/search?q=emacs+convert+encoding
http://ergoemacs.org/emacs/emacs_encoding_decoding_faq.html

How to open a file with specific coding system?
Open it normally, then Alt+x revert-buffer-with-coding-system, then type a coding system. Press Tab to list possible ones.

How to set a encoding system for saving file?
Alt+x set-buffer-file-coding-system, then type the encoding system you want. Press Tab to see a list of possible values.
After you set a encoding system, you can save the file and it'll be saved in the new encoding system.
#+END_SRC

综上，正确流程是，emacs使用revert-buffer-with-coding-system设置正确的编码（和文件一致的编码），解码文件（已打开），然后使用set-buffer-file-coding-system去转换当前显示的内容的编码，保存到文件（此时文件编码就是转换后的编码了）。

** DONE 为什么emacs转换编码时，首先需要使用正确的编码（和文件一致的编码）打开（解码）文件？
   CLOSED: [2017-07-15 Sat 19:46]
？解决windows下开发富甲天下3V5的ahk宏，注释乱码。

#+BEGIN_SRC  
如果emacs使用错误的编码（和文件不一致的编码）打开（解码）文件，会得到错误的内容显示（逻辑上错误，物理上正确），此时再把错误的内容转换编码，依然是错误的。
#+END_SRC

案例：
#+BEGIN_SRC  
# LANG=en_US.UTF-8 # locale

# 生成gbk编码的"你好"文件t
echo 你好 | iconv --from-code=utf-8 --to-code=gbk > t

# emacs使用utf-8（错误的编码），解码打开文件t（文件编码是gbk）
emacs -nw t
revert-buffer-with-coding-system utf-8
显示：ÄãºÃ

# emacs将utf-8解码的文本"ÄãºÃ"（文件编码是gbk）转换编码为utf-8，使用gbk去解码打开文件t（文件编码是utf-8）
set-buffer-file-coding-system utf-8
revert-buffer-with-coding-system gbk # 错误的编码
显示：脛茫潞脙

已经不是"你好"了。
#+END_SRC

** DONE 如何linux转换文件编码（utf-8转换为gbk）？
   CLOSED: [2017-07-15 Sat 19:46]
？论证emacs转换编码的正确流程（为什么emacs转换编码时，首先需要使用正确的编码（和文件一致的编码）打开（解码）文件？）

#+BEGIN_SRC  
# LANG=en_US.UTF-8 # locale

# 生成gbk编码的"你好"文件t
echo 你好 | iconv --from-code=utf-8 --to-code=gbk > t
#+END_SRC

** DONE 如何linux检索当前环境的编码（shell）？
   CLOSED: [2017-07-15 Sat 19:19]
？论证emacs转换编码的正确流程（为什么emacs转换编码时，首先需要使用正确的编码（和文件一致的编码）打开（解码）文件？）

#+BEGIN_SRC  
locale
https://www.google.com/search?q=linux+check+current+encoding&ie=utf-8&oe=utf-8
https://stackoverflow.com/questions/5306153/how-to-get-terminals-character-encoding
locale

LC_ALL=$encoding $cmd
https://www.google.com/search?q=LC_ALL&ie=utf-8&oe=utf-8
https://unix.stackexchange.com/questions/87745/what-does-lc-all-c-do
$ LC_ALL=es_ES man
¿Qué página de manual desea?
$ LC_ALL=C man
What manual page do you want?

LC_ALL=C含义
https://www.google.com/search?q=LC_ALL+c+mean
https://askubuntu.com/questions/801933/what-does-c-in-lc-all-c-mean
'C' is the old UNIX default, which is 127-bit ASCII with a charmap setting of ANSI_X3.4-1968.

LC_ALL=C含义（来源）
http://pubs.opengroup.org/onlinepubs/009695399/basedefs/xbd_chap07.html#tag_07_02
The POSIX locale can be specified by assigning to the appropriate environment variables the values "C" or "POSIX".

LC_ALL=C含义
https://www.google.com/search?q=POSIX+charset
https://en.wikipedia.org/wiki/Portable_character_set

LC_ALL和LANG优先级的关系
https://www.google.com/search?q=LC_ALL
https://my.oschina.net/luan/blog/79875
LC_ALL和LANG优先级的关系： LC_ALL > LC_* >LANG   

LC_ALL和LANG优先级的关系（来源）
https://www.gnu.org/software/bash/manual/bash.html#Bash-Variables
LC_ALL
    This variable overrides the value of LANG and any other LC_ variable specifying a locale category.
#+END_SRC

locale
** DONE 如何emacs查看文件的编码（不是emacs解码（查看）用的编码）？
   CLOSED: [2017-07-15 Sat 13:27]
？解决windows下开发富甲天下3V5的ahk宏，注释乱码。

#+BEGIN_SRC  
https://www.google.com/search?q=emacs+check+file+encoding&ie=utf-8&oe=utf-8
http://ergoemacs.org/emacs/emacs_encoding_decoding_faq.html

How to find out what's the current coding system used for opening and saving files?

Alt+x describe-coding-system then press Enter ↵.
#+END_SRC

#+BEGIN_SRC  
https://www.google.com/search?q=emacs+detect+file+encoding&ie=utf-8&oe=utf-8
https://www.gnu.org/software/emacs/manual/html_node/emacs/Recognize-Coding.html

Whenever Emacs reads a given piece of text, it tries to recognize which coding system to use. This applies to files being read, output from subprocesses, text from X selections, etc. Emacs can select the right coding system automatically most of the time—once you have specified your preferences. 
#+END_SRC

综上，emacs是自动检测。

** DONE 如何linux检测查看文件的编码？
   CLOSED: [2017-07-15 Sat 20:00]
？解决windows下开发富甲天下3V5的ahk宏，注释乱码。

#+BEGIN_SRC  
https://www.google.com/search?q=linux+detect+encoding
https://stackoverflow.com/questions/805418/how-to-find-encoding-of-a-file-in-unix-via-scripts
https://unix.stackexchange.com/questions/11602/how-can-i-test-the-encoding-of-a-text-file-is-it-valid-and-what-is-it

file -i $file
#+END_SRC

综上，使用file命令，但不一定准确（问题显示charset表示的是编码而不是字符集。）
** DONE 如何emacs指定编码（encoding）来解码查看（decoding）文件？
   CLOSED: [2017-07-15 Sat 10:36]
？解决windows下开发富甲天下3V5的ahk宏，注释乱码。

#+BEGIN_SRC  
https://www.google.com/search?q=how+emacs+check+file+encoding&ie=utf-8&oe=utf-8
http://ergoemacs.org/emacs/emacs_encoding_decoding_faq.html

Open it normally, then Alt+x revert-buffer-with-coding-system, then type a coding system. Press Tab to list possible ones.
#+END_SRC

使用函数revert-buffer-with-coding-system，快捷键C-x RET r。
** DONE 什么是ansi编码和gbk编码的区别？
   CLOSED: [2017-07-15 Sat 11:51]
？解决windows下开发富甲天下3V5的ahk宏，注释乱码。windows7中文默认ansi编码（notepad++）

#+BEGIN_SRC  
https://www.google.com/search?q=ansi+wiki
https://en.wikipedia.org/wiki/ANSI_character_set

The phrase ANSI character set has no official meaning and has been used to refer to the following, among other things:

https://en.wikipedia.org/wiki/Windows_code_page

Windows code pages are sets of characters or code pages (known as character encodings in other operating systems) used in Microsoft Windows from the 1980s and 1990s. Windows code pages were gradually superseded when Unicode was implemented in Windows, although they are still supported both within Windows and other platforms.
#+END_SRC

#+BEGIN_SRC  
https://www.google.com/search?q=ansi+gbk&ie=utf-8&oe=utf-8
https://www.zhihu.com/question/20650946

所以，跨平台兼容性最好的其实就是不用记事本。
建议用 Notepad++ 等正常的专业文本编辑器保存为不带 BOM 的 UTF-8。

比如 ASCII 这部标准本身就直接规定了字符和字符编码的方式，所以既是字符集又是编码方案；而 GB 2312 只是一个区位码形式的字符集标准，不过实际上基本都用 EUC-CN 来编码，所以提及「GB 2312」时也说的是一个字符集和编码连锁的方案；GBK 和 GB 18030 等向后兼容于 GB 2312 的方案也类似。

Windows 里说的「ANSI」其实是 Windows code pages，这个模式根据当前 locale 选定具体的编码，比如简中 locale 下是 GBK。把自己这些 code page 称作「ANSI」是 Windows 的臭毛病。在 ASCII 范围内它们应该是和 ASCII 一致的。
https://en.wikipedia.org/wiki/Windows_code_page
#+END_SRC

#+BEGIN_SRC  
https://www.google.com/search?q=EUC-CN&ie=utf-8&oe=utf-8
https://en.wikipedia.org/wiki/Extended_Unix_Code

Extended Unix Code (EUC) is a multibyte character encoding system used primarily for Japanese, Korean, and simplified Chinese.
#+END_SRC

综上
- ansi是一种系统，不是字符集，也不是编码算法，是根据locale来确定字符集和编码算法。
- gbk是一种字符集，使用euc编码算法。
** DONE 什么是字符集（character set）和编码(encoding)的区别？
   CLOSED: [2017-07-15 Sat 11:20]
？解决windows下开发富甲天下3V5的ahk宏，注释乱码（什么是ansi编码和gbk编码的区别？）。

#+BEGIN_SRC  
https://www.google.com/search?q=Character+set
https://en.wikipedia.org/wiki/Character_encoding

In computing, a character encoding is used to represent a repertoire of characters by some kind of encoding system.

A character set is a collection of characters that might be used by multiple languages.
#+END_SRC

#+BEGIN_SRC  
https://www.google.com/search?q=character+set+encoding+difference&ie=utf-8&oe=utf-8
http://www.grauw.nl/blog/entry/254

In these two terms, ‘set’ refers to the set of characters and their numbers (code points), and ‘encoding’ refers to the representation of these code points. For example, Unicode is a character set, and UTF-8 and UTF-16 are different character encodings of Unicode.
#+END_SRC

#+BEGIN_SRC  
https://www.google.com/search?q=ansi+gbk&ie=utf-8&oe=utf-8
https://www.zhihu.com/question/20650946

关于字符集（character set）和编码（encoding），某几篇答案中似乎有些混淆。

对于 ASCII、GB 2312、Big5、GBK、GB 18030 之类的遗留方案来说，基本上一个字符集方案只使用一种编码方案。

对于 Unicode，字符集和编码是明确区分的。Unicode/UCS 标准首先是个统一的字符集标准。而 Unicode/UCS 标准同时也定义了几种可选的编码方案，在标准文档中称作「encoding form」，主要包括 UTF-8、UTF-16 和 UTF-32。
#+END_SRC

#+BEGIN_SRC  
https://www.google.com/search?q=utf-8字符集
http://cenalulu.github.io/linux/character-encoding/
#+END_SRC

综上，字符集类似数据，编码类似算法。
** 如何firefox解析github的html文件？
？浏览ken_script的README文件（html版本有目录）。

** 如何保证单元测试代码正确？
？开发tart脚本，调试单元测试。
