blog.html
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 如何emacs转换ansi编码为utf-8编码？</h3>
<div class="outline-text-3" id="text-1-1">
<p>
？解决windows下开发富甲天下3V5的ahk宏，注释乱码。
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 如何emacs查看文件编码？</h3>
<div class="outline-text-3" id="text-1-2">
<p>
？解决windows下开发富甲天下3V5的ahk宏，注释乱码。
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="done DONE">DONE</span> 如何emacs指定编码查看文件（decoding）？</h3>
<div class="outline-text-3" id="text-1-3">
<p>
？解决windows下开发富甲天下3V5的ahk宏，注释乱码。
</p>

<pre class="example">
https://www.google.com/search?q=how+emacs+check+file+encoding&amp;ie=utf-8&amp;oe=utf-8

Open it normally, then Alt+x revert-buffer-with-coding-system, then type a coding system. Press Tab to list possible ones.
</pre>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 什么是字符集（charset）和编码(encoding)的区别？</h3>
<div class="outline-text-3" id="text-1-4">
<p>
？解决windows下开发富甲天下3V5的ahk宏，注释乱码。
</p>

<p class="verse">
<a href="https://www.google.com/search?q=character+set+encoding+difference&ie=utf-8&oe=utf-8">https://www.google.com/search?q=character+set+encoding+difference&ie=utf-8&oe=utf-8</a><br  />
<br  />
<a href="http://www.grauw.nl/blog/entry/254">http://www.grauw.nl/blog/entry/254</a><br  />
In these two terms, ‘set’ refers to the set of characters and their numbers (code points), and ‘encoding’ refers to the representation of these code points. For example, Unicode is a character set, and UTF-8 and UTF-16 are different character encodings of Unicode.<br  />
<br  />
<a href="http://www.cftea.com/c/2008/01/LG3YPDRZSTHTJ2IH.asp">http://www.cftea.com/c/2008/01/LG3YPDRZSTHTJ2IH.asp</a><br  />
Charset 是字符集，Encoding 是编码。<br  />
</p>

<hr  />

<p class="verse">
<a href="https://www.google.com/search?q=ansi+gbk&ie=utf-8&oe=utf-8">https://www.google.com/search?q=ansi+gbk&ie=utf-8&oe=utf-8</a><br  />
<a href="https://www.zhihu.com/question/20650946">https://www.zhihu.com/question/20650946</a><br  />
<br  />
关于字符集（character set）和编码（encoding），某几篇答案中似乎有些混淆。<br  />
<br  />
对于 ASCII、GB 2312、Big5、GBK、GB 18030 之类的遗留方案来说，基本上一个字符集方案只使用一种编码方案。<br  />
<br  />
对于 Unicode，字符集和编码是明确区分的。Unicode/UCS 标准首先是个统一的字符集标准。而 Unicode/UCS 标准同时也定义了几种可选的编码方案，在标准文档中称作「encoding form」，主要包括 UTF-8、UTF-16 和 UTF-32。<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> <span class="done DONE">DONE</span> 什么是ansi编码和gbk编码的区别？</h3>
<div class="outline-text-3" id="text-1-5">
<p>
？解决windows下开发富甲天下3V5的ahk宏，注释乱码。windows7中文默认ansi编码（notepad++）
</p>

<p class="verse">
<a href="https://www.google.com/search?q=ansi+gbk&ie=utf-8&oe=utf-8">https://www.google.com/search?q=ansi+gbk&ie=utf-8&oe=utf-8</a><br  />
<a href="https://www.zhihu.com/question/20650946">https://www.zhihu.com/question/20650946</a><br  />
<br  />
所以，跨平台兼容性最好的其实就是不用记事本。<br  />
建议用 Notepad++ 等正常的专业文本编辑器保存为不带 BOM 的 UTF-8。<br  />
<br  />
Windows 里说的「ANSI」其实是 Windows code pages，这个模式根据当前 locale 选定具体的编码，比如简中 locale 下是 GBK。把自己这些 code page 称作「ANSI」是 Windows 的臭毛病。在 ASCII 范围内它们应该是和 ASCII 一致的。<br  />
<a href="https://en.wikipedia.org/wiki/Windows_code_page">https://en.wikipedia.org/wiki/Windows_code_page</a><br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 如何firefox解析github的html文件？</h3>
<div class="outline-text-3" id="text-1-6">
<p>
？浏览ken<sub>script的README文件（html版本有目录）。</sub>
</p>
</div>
</div>
