blog.org
** DONE 如何emacs org快速检索shunit2下的bash -x的追踪信息？
   CLOSED: [2017-07-14 Fri 17:55]
？开发tart脚本，调试单元测试。

#+BEGIN_SRC  
/eval test_tart
#+END_SRC

** 如何emacs org加粗符号*需要空格才有效？
？解决编写文档时增加可读性（为什么工程（项目）需要根目录的概念？）

** 为什么工程（项目）需要根目录的概念？
？开发tart脚本，开发单元测试。

减少干扰，增加 *阅读性* ，例如：
#+BEGIN_SRC  
test_file="${test_dir}/test"
test_file_compressed="${test_dir}/test.tar.gz"
test_file_extracted="${test_dir}/test_extracted"

cd "${test_dir}"
test_file="test"
test_file_compressed="test.tar.gz"
test_file_extracted="test_extracted"
#+END_SRC

缺少引用。
** DONE 如何解决bash tar报错tar: Removing leading `/' from member names？
   CLOSED: [2017-07-14 Fri 17:14]
？开发tart脚本，开发单元测试，创建测试数据。

#+BEGIN_SRC  
tar --create --gzip --file "${test_file_compressed}" "${test_file}" --verbose # bug
#+END_SRC

#+BEGIN_VERSE
https://www.google.com/search?q=tar:+Removing+leading+`/'+from+member+names

https://unix.stackexchange.com/questions/59243/tar-removing-leading-from-member-names
Use the --absolute-names or -P option to disable this feature.

This is the correct answer, but be aware, that in most cases, this is not what you want, cause it results in an archive that extracts in complete paths! – rubo77 Nov 21 '13 at 10:04 
#+END_VERSE

总结，原因是${test_file_compressed}使用了绝对路径，tar打包压缩时，将完整路径都打包压缩了，解压时就会出现完整路径的目录。

综上，使用tar打包压缩，不要使用绝对路径。

** 如何快速检索emacs org文档？
？编写"如何bash -x只是替换而不执行？"文档时，需要查看着重标记。
** 如何emacs org使用markdown的反引号？
？编写"如何bash -x只是替换而不执行？"文档，需要引用。
   
** 如何阅读bash -x的追踪信息？
？开发tart脚本，debug单元测试脚本，追踪shunit2的信息过多。

** 如何emacs显示空白字符（空格、制表符、换行符等）？
？学习bash debug，复制调试选项时会有空格和制表符混用。

#+BEGIN_VERSE
https://www.google.com/search?q=how+bash+debug
http://xiaowang.net/bgb-cn/ch02s03.html
短符号 	长符号 	结果
set -f 	set -o noglob 	禁止特殊字符用于文件名扩展。
set -v 	set -o verbose 	打印读入shell的输入行。
set -x 	set -o xtrace 	执行命令之前打印命令。
#+END_VERSE

** DONE 如何bash -x只是替换而不执行？
   CLOSED: [2017-07-14 Fri 15:34]
？开发tart脚本，代替cmd变量和eval调试（重复调试cmd、echo、eval低效率）。

无法，不执行如何替换？例如：
#+BEGIN_SRC  
v="hi"
echo "${v}"
#+END_SRC
不执行`v="hi"`，无法替换`echo "${v}"`。
** TODO 如何bash debug？
？开发tart脚本，代替cmd、echo、eval调试（重复调试cmd、echo、eval低效率）。

#+BEGIN_VERSE
https://www.google.com/search?q=how+bash+debug
https://stackoverflow.com/questions/951336/how-to-debug-a-bash-script
http://tldp.org/LDP/Bash-Beginners-Guide/html/sect_02_03.html

http://xiaowang.net/bgb-cn/ch02s03.html
短符号 	长符号 	结果
set -f 	set -o noglob 	禁止特殊字符用于文件名扩展。
set -v 	set -o verbose 	打印读入shell的输入行。
set -x 	set -o xtrace 	执行命令之前打印命令。
#+END_VERSE

-v
#+BEGIN_VERSE
鸟哥的Linux私房菜 基础学习篇 3ed p397
https://www.gnu.org/software/bash/manual/bash.html#The-Set-Builtin
    Print shell input lines as they are read.
#+END_VERSE
显示读入代码（未替换变量），效果不如-x。

-x
#+BEGIN_VERSE
鸟哥的Linux私房菜 基础学习篇 3ed p397
https://www.gnu.org/software/bash/manual/bash.html#The-Set-Builtin
    Print a trace of simple commands, for commands, case commands, select commands, and arithmetic for commands and their arguments or associated word lists after they are expanded and before they are executed. The value of the PS4 variable is expanded and the resultant value is printed before the command and its expanded arguments.
#+END_VERSE
执行时，追踪实际执行的代码（即替换后的）。

综上使用cmd变量配合bash -x可以解决问题，只是开关eval比较麻烦。
** 如何bash解决cmd变量配合bash -x调试，开关eval麻烦问题？
？开发tart脚本，代替cmd、echo、eval调试（重复调试cmd、echo、eval低效率）。


** 如何bash单步调试？
？开发tart脚本，调试单元测试脚本，cmd、echo、eval太麻烦，bash -x是直接执行，避免出现rm的误操作。

#+BEGIN_VERSE
https://www.google.com/search?q=bash+单步调试&ie=utf-8&oe=utf-8
http://coolshell.cn/articles/1379.html
bashdb， 一个Bash的专用调试器。
#+END_VERSE


** 为什么代码最终目的是阅读，不仅是运行？
？开发tart脚本，选项使用完整名，不使用缩写。

** 如何bash判断文件1是文件2（目录）的子文件？
？开发tart脚本，单元测试删除测试目录。

#+BEGIN_VERSE
https://www.google.com/search?q=how+bash+file+is+sub+file+&ie=utf-8&oe=utf-8
https://stackoverflow.com/questions/12989615/check-if-file-is-in-a-given-directory-or-sub-directory-in-bash
man find
#+END_VERSE

#+BEGIN_SRC  
find $directory_path -name $file_name | wc --lines # 针对文件名

find $directory_path -path $path | wc --lines # 针对路径
#+END_SRC

** 如何bash查看脚本执行的历史命令？
？开发tart脚本，避免使用cmd变量和eval来执行。

** 如何linux tar解压指定文件名或目录？
？开发tart脚本，单元测试断言使用。

无法指定文件名，可以指定目录
#+BEGIN_SRC  
-C
--directory=DIR
#+END_SRC

** 如何bash shunit2断言文件存在？
？开发tart脚本，单元测试。

https://github.com/kward/shunit2#asserts
#+BEGIN_SRC  
assertTrue [message] condition
#+END_SRC

** DONE 什么tar打包压缩格式的区别（gz、bz2、xz）？
   CLOSED: [2017-07-14 Fri 11:28]
？开发tart脚本，单元测试需要创建测试数据（压缩包）。

#+BEGIN_VERSE
https://www.google.com/search?q=gz+bz+vs+xz

https://www.rootusers.com/gzip-vs-bzip2-vs-xz-performance-comparison/

https://blog.gtwang.org/linux/linux-why-are-tar-archive-formats-switching-to-xz-compression-to-replace-bzip2-and-what-about-gzip/
在 UNIX/Linux 社群中，傳統上如果要壓縮檔案通常都是使用 tar 加上 gzip 的壓縮方式，而後來 gzip 漸漸被 bzip2 所取代，而現在有越來越多人改用以 LZMA2 為基礎的 xz 來壓縮 tar 檔，連 kernel.org 也從 2013 年的年底開始，同時採用 tar.gz 與 tar.xz 兩種壓縮格式釋出 Linux 核心原始碼，而位於首頁的超連結則是直接使用 tar.xz 這個格式，以往的 tar.bz2 則是直接被捨棄。
剩下的就是壓縮率以及相容性的問題，傳統上的 gzip 無庸置疑是相容性最好的壓縮格式，現在應該每一種 UNIX/Linux 系統都可以解壓縮這種格式，所以如果若要確保每一位使用者都可以解壓縮，gzip 是首選。
#+END_VERSE


