blog.html

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 如何保证单元测试代码正确？</h3>
<div class="outline-text-3" id="text-1-7">
<p>
？开发tart脚本，调试单元测试。
</p>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> <span class="done DONE">DONE</span> 如何emacs org快速检索shunit2下的bash -x的追踪信息？</h3>
<div class="outline-text-3" id="text-1-8">
<p>
？开发tart脚本，调试单元测试。
</p>

<pre class="example">
/eval test_tart
</pre>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> 如何emacs org加粗符号*需要空格才有效？</h3>
<div class="outline-text-3" id="text-1-9">
<p>
？解决编写文档时增加可读性（为什么工程（项目）需要根目录的概念？）
</p>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> 为什么工程（项目）需要根目录的概念？</h3>
<div class="outline-text-3" id="text-1-10">
<p>
？开发tart脚本，开发单元测试。
</p>

<p>
减少干扰，增加 <b>阅读性</b> ，例如：
</p>
<pre class="example">
test_file="${test_dir}/test"
test_file_compressed="${test_dir}/test.tar.gz"
test_file_extracted="${test_dir}/test_extracted"

cd "${test_dir}"
test_file="test"
test_file_compressed="test.tar.gz"
test_file_extracted="test_extracted"
</pre>

<p>
缺少引用。
</p>
</div>
</div>
<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> <span class="done DONE">DONE</span> 如何解决bash tar报错tar: Removing leading `/' from member names？</h3>
<div class="outline-text-3" id="text-1-11">
<p>
？开发tart脚本，开发单元测试，创建测试数据。
</p>

<pre class="example">
tar --create --gzip --file "${test_file_compressed}" "${test_file}" --verbose # bug
</pre>

<p class="verse">
<a href="https://www.google.com/search?q=tar:+Removing+leading+`/'+from+member+names">https://www.google.com/search?q=tar:+Removing+leading+`/'+from+member+names</a><br  />
<br  />
<a href="https://unix.stackexchange.com/questions/59243/tar-removing-leading-from-member-names">https://unix.stackexchange.com/questions/59243/tar-removing-leading-from-member-names</a><br  />
Use the &#x2013;absolute-names or -P option to disable this feature.<br  />
<br  />
This is the correct answer, but be aware, that in most cases, this is not what you want, cause it results in an archive that extracts in complete paths! – rubo77 Nov 21 '13 at 10:04<br  />
</p>

<p>
总结，原因是${test<sub>file</sub><sub>compressed</sub>}使用了绝对路径，tar打包压缩时，将完整路径都打包压缩了，解压时就会出现完整路径的目录。
</p>

<p>
综上，使用tar打包压缩，不要使用绝对路径。
</p>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> 如何快速检索emacs org文档？</h3>
<div class="outline-text-3" id="text-1-12">
<p>
？编写"如何bash -x只是替换而不执行？"文档时，需要查看着重标记。
</p>
</div>
</div>
<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> 如何emacs org使用markdown的反引号？</h3>
<div class="outline-text-3" id="text-1-13">
<p>
？编写"如何bash -x只是替换而不执行？"文档，需要引用。
</p>
</div>
</div>

<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> 如何阅读bash -x的追踪信息？</h3>
<div class="outline-text-3" id="text-1-14">
<p>
？开发tart脚本，debug单元测试脚本，追踪shunit2的信息过多。
</p>
</div>
</div>

<div id="outline-container-sec-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> 如何emacs显示空白字符（空格、制表符、换行符等）？</h3>
<div class="outline-text-3" id="text-1-15">
<p>
？学习bash debug，复制调试选项时会有空格和制表符混用。
</p>

<p class="verse">
<a href="https://www.google.com/search?q=how+bash+debug">https://www.google.com/search?q=how+bash+debug</a><br  />
<a href="http://xiaowang.net/bgb-cn/ch02s03.html">http://xiaowang.net/bgb-cn/ch02s03.html</a><br  />
短符号     长符号     结果<br  />
set -f     set -o noglob     禁止特殊字符用于文件名扩展。<br  />
set -v     set -o verbose     打印读入shell的输入行。<br  />
set -x     set -o xtrace     执行命令之前打印命令。<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="section-number-3">1.16</span> <span class="done DONE">DONE</span> 如何bash -x只是替换而不执行？</h3>
<div class="outline-text-3" id="text-1-16">
<p>
？开发tart脚本，代替cmd变量和eval调试（重复调试cmd、echo、eval低效率）。
</p>

<p>
无法，不执行如何替换？例如：
</p>
<pre class="example">
v="hi"
echo "${v}"
</pre>
<p>
不执行`v="hi"`，无法替换`echo "${v}"`。
</p>
</div>
</div>
<div id="outline-container-sec-1-17" class="outline-3">
<h3 id="sec-1-17"><span class="section-number-3">1.17</span> <span class="todo TODO">TODO</span> 如何bash debug？</h3>
<div class="outline-text-3" id="text-1-17">
<p>
？开发tart脚本，代替cmd、echo、eval调试（重复调试cmd、echo、eval低效率）。
</p>

<p class="verse">
<a href="https://www.google.com/search?q=how+bash+debug">https://www.google.com/search?q=how+bash+debug</a><br  />
<a href="https://stackoverflow.com/questions/951336/how-to-debug-a-bash-script">https://stackoverflow.com/questions/951336/how-to-debug-a-bash-script</a><br  />
<a href="http://tldp.org/LDP/Bash-Beginners-Guide/html/sect_02_03.html">http://tldp.org/LDP/Bash-Beginners-Guide/html/sect_02_03.html</a><br  />
<br  />
<a href="http://xiaowang.net/bgb-cn/ch02s03.html">http://xiaowang.net/bgb-cn/ch02s03.html</a><br  />
短符号     长符号     结果<br  />
set -f     set -o noglob     禁止特殊字符用于文件名扩展。<br  />
set -v     set -o verbose     打印读入shell的输入行。<br  />
set -x     set -o xtrace     执行命令之前打印命令。<br  />
</p>

<p>
-v
</p>
<p class="verse">
鸟哥的Linux私房菜 基础学习篇 3ed p397<br  />
<a href="https://www.gnu.org/software/bash/manual/bash.html#The-Set-Builtin">https://www.gnu.org/software/bash/manual/bash.html#The-Set-Builtin</a><br  />
&#xa0;&#xa0;&#xa0;&#xa0;Print shell input lines as they are read.<br  />
</p>
<p>
显示读入代码（未替换变量），效果不如-x。
</p>

<p>
-x
</p>
<p class="verse">
鸟哥的Linux私房菜 基础学习篇 3ed p397<br  />
<a href="https://www.gnu.org/software/bash/manual/bash.html#The-Set-Builtin">https://www.gnu.org/software/bash/manual/bash.html#The-Set-Builtin</a><br  />
&#xa0;&#xa0;&#xa0;&#xa0;Print a trace of simple commands, for commands, case commands, select commands, and arithmetic for commands and their arguments or associated word lists after they are expanded and before they are executed. The value of the PS4 variable is expanded and the resultant value is printed before the command and its expanded arguments.<br  />
</p>
<p>
执行时，追踪实际执行的代码（即替换后的）。
</p>

<p>
综上使用cmd变量配合bash -x可以解决问题，只是开关eval比较麻烦。
</p>
</div>
</div>
<div id="outline-container-sec-1-18" class="outline-3">
<h3 id="sec-1-18"><span class="section-number-3">1.18</span> 如何bash解决cmd变量配合bash -x调试，开关eval麻烦问题？</h3>
<div class="outline-text-3" id="text-1-18">
<p>
？开发tart脚本，代替cmd、echo、eval调试（重复调试cmd、echo、eval低效率）。
</p>
</div>
</div>


<div id="outline-container-sec-1-19" class="outline-3">
<h3 id="sec-1-19"><span class="section-number-3">1.19</span> 如何bash单步调试？</h3>
<div class="outline-text-3" id="text-1-19">
<p>
？开发tart脚本，调试单元测试脚本，cmd、echo、eval太麻烦，bash -x是直接执行，避免出现rm的误操作。
</p>

<p class="verse">
<a href="https://www.google.com/search?q=bash+%E5%8D%95%E6%AD%A5%E8%B0%83%E8%AF%95&ie=utf-8&oe=utf-8">https://www.google.com/search?q=bash+%E5%8D%95%E6%AD%A5%E8%B0%83%E8%AF%95&ie=utf-8&oe=utf-8</a><br  />
<a href="http://coolshell.cn/articles/1379.html">http://coolshell.cn/articles/1379.html</a><br  />
bashdb， 一个Bash的专用调试器。<br  />
</p>
</div>
</div>


<div id="outline-container-sec-1-20" class="outline-3">
<h3 id="sec-1-20"><span class="section-number-3">1.20</span> 为什么代码最终目的是阅读，不仅是运行？</h3>
<div class="outline-text-3" id="text-1-20">
<p>
？开发tart脚本，选项使用完整名，不使用缩写。
</p>
</div>
</div>

<div id="outline-container-sec-1-21" class="outline-3">
<h3 id="sec-1-21"><span class="section-number-3">1.21</span> 如何bash判断文件1是文件2（目录）的子文件？</h3>
<div class="outline-text-3" id="text-1-21">
<p>
？开发tart脚本，单元测试删除测试目录。
</p>

<p class="verse">
<a href="https://www.google.com/search?q=how+bash+file+is+sub+file+&ie=utf-8&oe=utf-8">https://www.google.com/search?q=how+bash+file+is+sub+file+&ie=utf-8&oe=utf-8</a><br  />
<a href="https://stackoverflow.com/questions/12989615/check-if-file-is-in-a-given-directory-or-sub-directory-in-bash">https://stackoverflow.com/questions/12989615/check-if-file-is-in-a-given-directory-or-sub-directory-in-bash</a><br  />
man find<br  />
</p>

<pre class="example">
find $directory_path -name $file_name | wc --lines # 针对文件名

find $directory_path -path $path | wc --lines # 针对路径
</pre>
</div>
</div>

<div id="outline-container-sec-1-22" class="outline-3">
<h3 id="sec-1-22"><span class="section-number-3">1.22</span> 如何bash查看脚本执行的历史命令？</h3>
<div class="outline-text-3" id="text-1-22">
<p>
？开发tart脚本，避免使用cmd变量和eval来执行。
</p>
</div>
</div>

<div id="outline-container-sec-1-23" class="outline-3">
<h3 id="sec-1-23"><span class="section-number-3">1.23</span> 如何linux tar解压指定文件名或目录？</h3>
<div class="outline-text-3" id="text-1-23">
<p>
？开发tart脚本，单元测试断言使用。
</p>

<p>
无法指定文件名，可以指定目录
</p>
<pre class="example">
-C
--directory=DIR
</pre>
</div>
</div>

<div id="outline-container-sec-1-24" class="outline-3">
<h3 id="sec-1-24"><span class="section-number-3">1.24</span> 如何bash shunit2断言文件存在？</h3>
<div class="outline-text-3" id="text-1-24">
<p>
？开发tart脚本，单元测试。
</p>

<p>
<a href="https://github.com/kward/shunit2#asserts">https://github.com/kward/shunit2#asserts</a>
</p>
<pre class="example">
assertTrue [message] condition
</pre>
</div>
</div>

<div id="outline-container-sec-1-25" class="outline-3">
<h3 id="sec-1-25"><span class="section-number-3">1.25</span> <span class="done DONE">DONE</span> 什么tar打包压缩格式的区别（gz、bz2、xz）？</h3>
<div class="outline-text-3" id="text-1-25">
<p>
？开发tart脚本，单元测试需要创建测试数据（压缩包）。
</p>

<p class="verse">
<a href="https://www.google.com/search?q=gz+bz+vs+xz">https://www.google.com/search?q=gz+bz+vs+xz</a><br  />
<br  />
<a href="https://www.rootusers.com/gzip-vs-bzip2-vs-xz-performance-comparison/">https://www.rootusers.com/gzip-vs-bzip2-vs-xz-performance-comparison/</a><br  />
<br  />
<a href="https://blog.gtwang.org/linux/linux-why-are-tar-archive-formats-switching-to-xz-compression-to-replace-bzip2-and-what-about-gzip/">https://blog.gtwang.org/linux/linux-why-are-tar-archive-formats-switching-to-xz-compression-to-replace-bzip2-and-what-about-gzip/</a><br  />
在 UNIX/Linux 社群中，傳統上如果要壓縮檔案通常都是使用 tar 加上 gzip 的壓縮方式，而後來 gzip 漸漸被 bzip2 所取代，而現在有越來越多人改用以 LZMA2 為基礎的 xz 來壓縮 tar 檔，連 kernel.org 也從 2013 年的年底開始，同時採用 tar.gz 與 tar.xz 兩種壓縮格式釋出 Linux 核心原始碼，而位於首頁的超連結則是直接使用 tar.xz 這個格式，以往的 tar.bz2 則是直接被捨棄。<br  />
剩下的就是壓縮率以及相容性的問題，傳統上的 gzip 無庸置疑是相容性最好的壓縮格式，現在應該每一種 UNIX/Linux 系統都可以解壓縮這種格式，所以如果若要確保每一位使用者都可以解壓縮，gzip 是首選。<br  />
</p>
</div>
</div>
