blog.org
** DONE 什么是日期、时间格式规范？
   CLOSED: [2017-07-14 Fri 10:49]
？开发tart脚本，创建时间目录存放删除文件。

- https://www.google.com/search?q=date+specification&ie=utf-8&oe=utf-8
- https://en.wikipedia.org/wiki/ISO_8601
  
#+BEGIN_VERSE
man date
rfc3339
#+END_VERSE

** DONE 什么是rfc、iso区别？
   CLOSED: [2017-07-14 Fri 10:49]
？开发tart脚本，选择时间标准，创建删除目录。

#+BEGIN_VERSE
https://www.zhihu.com/search?type=content&q=rfc%20iso
为什么大多ISO标准都收费才能阅读？
#+END_VERSE

RFC免费、ISO收费。
** 如何vim删除当前光标到结尾的字符串？
？编写文档，编辑google引用链接，删除多余非信息部分。

#+BEGIN_SRC  
D
#+END_SRC

缺乏引用。
** DONE 如何linux模拟windows的回收站（trash标准或规范）？
   CLOSED: [2017-07-14 Fri 10:09]
？开发tart脚本，解决误删除。

- https://www.google.com/search?q=linux+trash+fedora
- https://ask.fedoraproject.org/en/question/75130/how-to-access-trash-folder-on-terminal/
#+BEGIN_SRC  
cd ~/.local/share/Trash/files
#+END_SRC

- https://www.google.com/search?q=linux+回收站
- https://www.zhihu.com/question/32294243
#+BEGIN_VERSE
有关 Linux 回收站的具体技术标准可以参见 http://freedesktop.org 的相关定义 
#+END_VERSE

- https://www.google.com/search?q=linux+trash+standard&ie=utf-8&oe=utf-8
- https://www.freedesktop.org/wiki/Specifications/trash-spec/
- https://specifications.freedesktop.org/trash-spec/trashspec-latest.html
#+BEGIN_SRC  
Its name and location are $XDG_DATA_HOME/Trash 3; $XDG_DATA_HOME is the base directory for user-specific data, as defined in the Desktop Base Directory Specification . 

ref https://specifications.freedesktop.org/basedir-spec/latest/ar01s03.html
$XDG_DATA_HOME defines the base directory relative to which user specific data files should be stored. If $XDG_DATA_HOME is either not set or empty, a default equal to $HOME/.local/share should be used. 

The $trash/files directory contains the files and directories that were trashed.
#+END_SRC

综上，使用"$HOME/.local/share/Trash/files"

** 为什么不使用/tmp作为回收站？
？开发tart脚本。

隐私问题，/tmp是公共的。

** 为什么使用测试驱动开发？
？开发tart脚本。

测试驱动开发鼓励变更（缺乏引用）。
** 什么是bash执行顺序？
？开发tart脚本，使用eval执行，选择使用单引号还是双引号。
** 如何选择bash eval执行命令字符串时，字符串内部是单引号还是双引号？
？开发tart脚本，开发单元测试脚本，使用eval。

- https://www.google.com/search?q=eval+quote+bash
- https://stackoverflow.com/questions/11065077/eval-command-in-bash-and-its-typical-uses
#+BEGIN_VERSE
Always put double quotes around variable and command substitutions, unless you know you need to leave them off. 
#+END_VERSE
#+BEGIN_SRC  
$ ls
file1 file2 otherfile
$ set -- 'f* *'
$ echo "$1"
f* *
$ echo $1
file1 file2 file1 file2 otherfile
$ n=1
$ eval echo \${$n}
file1 file2 file1 file2 otherfile
$eval echo \"\${$n}\"
f* *
$ echo "${!n}"
f* *
#+END_SRC

综上，使用双引号，因为会出现替换的替换（shell替换一次，eval新建子进程再替换一次（缺乏引用））。

** DONE 如何命名单元测试的测试目录？
   CLOSED: [2017-07-13 Thu 22:19]
？开发tart脚本，测试压缩和解压缩。

#+BEGIN_VERSE
"${program}_test" # 会破坏后缀，例如func.sh_test
"${program}.test" # 相对好
#+END_VERSE
** DONE 如何选择单元测试目录？
   CLOSED: [2017-07-13 Thu 22:11]
？开发tart脚本，测试压缩和解压缩。

可选目录
#+BEGIN_VERSE
"$HOME/.$project" # 不好，如果有同名目录，可能会删除掉真实数据。
"$HOME/.$program" # 不好，如果有同名目录，可能会删除掉真实数据。
"./${program}_test_dir" # 可以，避免目录重名。
"$project/test_dir" # 相对当前目录而言，麻烦，但是规范（如果需要保留数据，一般不需要，因为可以重复）。

#+END_VERSE
** 什么是集成测试和系统测试的区别？
？开发tart脚本。

** 什么是单元测试和集成测试的区别？
？开发tart脚本。

** DONE 如何解决linux rm删除文件时，可能误删除的问题？
   CLOSED: [2017-07-14 Fri 09:36]
？开发tart脚本，开发单元测试脚本。

- https://www.google.com/search?q=linux+safe+rm&ie=utf-8&oe=utf-8
- https://serverfault.com/questions/337082/how-do-i-prevent-accidental-rm-rf
#+BEGIN_VERSE

Don't do that! As a matter of practice, don't use ./

My friend told me he never uses rm -rf *. He always changes the directory first, and uses a specific target.

The best solutions involve changing your habits not to use rm directly.

Yes: Don't work as root and always think twice before acting. 

When I delete a directory recursively, I put the -r, and -f if applicable, at the end of the command, e.g. 
#+END_VERSE

- https://stackoverflow.com/search?q=safe+rm
- https://stackoverflow.com/questions/373156/what-is-the-safest-way-to-empty-a-directory-in-nix
手动操作
#+BEGIN_SRC  
alias del="pwd;read;rm"
#+END_SRC

- https://stackoverflow.com/search?q=safe+rm
- https://stackoverflow.com/questions/992737/safe-rm-rf-function-in-shell-script
自动操作（程序）
#+BEGIN_SRC  
cd $SOMEPATH && rm -rf *
#+END_SRC

综上
- 使用mv代替rm。
- 如果使用rm，不要使用./，切换目录，指定删除文件，不要使用*。
** DONE 如何shunit2命名测试文件？
   CLOSED: [2017-07-13 Thu 18:43]
？开发tart脚本。

- https://github.com/kward/shunit2
#+BEGIN_VERSE
equality_test.sh
#+END_VERSE

- https://www.google.com/search?q=junit&ie=utf-8&oe=utf-8
- https://github.com/junit-team/junit4/wiki/Getting-started
#+BEGIN_VERSE
CalculatorTest.java
#+END_VERSE

综上，一般格式为"file_test.sh"
** 为什么需要单元测试？
？开发tart脚本。

** 如何bash使用;结尾，";"或" ;"？
？

** 如何bash cd快速切换目录？
？使用emacs快速编辑stf.org

