blog.html


<div id="outline-container-sec-1-26" class="outline-3">
<h3 id="sec-1-26"><span class="section-number-3">1.26</span> <span class="done DONE">DONE</span> 什么是日期、时间格式规范？</h3>
<div class="outline-text-3" id="text-1-26">
<p>
？开发tart脚本，创建时间目录存放删除文件。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=date+specification&ie=utf-8&oe=utf-8">https://www.google.com/search?q=date+specification&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://en.wikipedia.org/wiki/ISO_8601">https://en.wikipedia.org/wiki/ISO_8601</a>
</li>
</ul>

<p class="verse">
man date<br  />
rfc3339<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-27" class="outline-3">
<h3 id="sec-1-27"><span class="section-number-3">1.27</span> <span class="done DONE">DONE</span> 什么是rfc、iso区别？</h3>
<div class="outline-text-3" id="text-1-27">
<p>
？开发tart脚本，选择时间标准，创建删除目录。
</p>

<p class="verse">
<a href="https://www.zhihu.com/search?type=content&q=rfc%20iso">https://www.zhihu.com/search?type=content&q=rfc%20iso</a><br  />
为什么大多ISO标准都收费才能阅读？<br  />
</p>

<p>
RFC免费、ISO收费。
</p>
</div>
</div>
<div id="outline-container-sec-1-28" class="outline-3">
<h3 id="sec-1-28"><span class="section-number-3">1.28</span> 如何vim删除当前光标到结尾的字符串？</h3>
<div class="outline-text-3" id="text-1-28">
<p>
？编写文档，编辑google引用链接，删除多余非信息部分。
</p>

<pre class="example">
D
</pre>

<p>
缺乏引用。
</p>
</div>
</div>
<div id="outline-container-sec-1-29" class="outline-3">
<h3 id="sec-1-29"><span class="section-number-3">1.29</span> <span class="done DONE">DONE</span> 如何linux模拟windows的回收站（trash标准或规范）？</h3>
<div class="outline-text-3" id="text-1-29">
<p>
？开发tart脚本，解决误删除。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=linux+trash+fedora">https://www.google.com/search?q=linux+trash+fedora</a>
</li>
<li><a href="https://ask.fedoraproject.org/en/question/75130/how-to-access-trash-folder-on-terminal/">https://ask.fedoraproject.org/en/question/75130/how-to-access-trash-folder-on-terminal/</a>
</li>
</ul>
<pre class="example">
cd ~/.local/share/Trash/files
</pre>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=linux+%E5%9B%9E%E6%94%B6%E7%AB%99">https://www.google.com/search?q=linux+%E5%9B%9E%E6%94%B6%E7%AB%99</a>
</li>
<li><a href="https://www.zhihu.com/question/32294243">https://www.zhihu.com/question/32294243</a>
</li>
</ul>
<p class="verse">
有关 Linux 回收站的具体技术标准可以参见 <a href="http://freedesktop.org">http://freedesktop.org</a> 的相关定义<br  />
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=linux+trash+standard&ie=utf-8&oe=utf-8">https://www.google.com/search?q=linux+trash+standard&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://www.freedesktop.org/wiki/Specifications/trash-spec/">https://www.freedesktop.org/wiki/Specifications/trash-spec/</a>
</li>
<li><a href="https://specifications.freedesktop.org/trash-spec/trashspec-latest.html">https://specifications.freedesktop.org/trash-spec/trashspec-latest.html</a>
</li>
</ul>
<pre class="example">
Its name and location are $XDG_DATA_HOME/Trash 3; $XDG_DATA_HOME is the base directory for user-specific data, as defined in the Desktop Base Directory Specification . 

ref https://specifications.freedesktop.org/basedir-spec/latest/ar01s03.html
$XDG_DATA_HOME defines the base directory relative to which user specific data files should be stored. If $XDG_DATA_HOME is either not set or empty, a default equal to $HOME/.local/share should be used. 

The $trash/files directory contains the files and directories that were trashed.
</pre>

<p>
综上，使用"$HOME/.local/share/Trash/files"
</p>
</div>
</div>

<div id="outline-container-sec-1-30" class="outline-3">
<h3 id="sec-1-30"><span class="section-number-3">1.30</span> 为什么不使用/tmp作为回收站？</h3>
<div class="outline-text-3" id="text-1-30">
<p>
？开发tart脚本。
</p>

<p>
隐私问题，/tmp是公共的。
</p>
</div>
</div>

<div id="outline-container-sec-1-31" class="outline-3">
<h3 id="sec-1-31"><span class="section-number-3">1.31</span> 为什么使用测试驱动开发？</h3>
<div class="outline-text-3" id="text-1-31">
<p>
？开发tart脚本。
</p>

<p>
测试驱动开发鼓励变更（缺乏引用）。
</p>
</div>
</div>
<div id="outline-container-sec-1-32" class="outline-3">
<h3 id="sec-1-32"><span class="section-number-3">1.32</span> 什么是bash执行顺序？</h3>
<div class="outline-text-3" id="text-1-32">
<p>
？开发tart脚本，使用eval执行，选择使用单引号还是双引号。
</p>
</div>
</div>
<div id="outline-container-sec-1-33" class="outline-3">
<h3 id="sec-1-33"><span class="section-number-3">1.33</span> 如何选择bash eval执行命令字符串时，字符串内部是单引号还是双引号？</h3>
<div class="outline-text-3" id="text-1-33">
<p>
？开发tart脚本，开发单元测试脚本，使用eval。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=eval+quote+bash">https://www.google.com/search?q=eval+quote+bash</a>
</li>
<li><a href="https://stackoverflow.com/questions/11065077/eval-command-in-bash-and-its-typical-uses">https://stackoverflow.com/questions/11065077/eval-command-in-bash-and-its-typical-uses</a>
</li>
</ul>
<p class="verse">
Always put double quotes around variable and command substitutions, unless you know you need to leave them off.<br  />
</p>
<pre class="example">
$ ls
file1 file2 otherfile
$ set -- 'f* *'
$ echo "$1"
f* *
$ echo $1
file1 file2 file1 file2 otherfile
$ n=1
$ eval echo \${$n}
file1 file2 file1 file2 otherfile
$eval echo \"\${$n}\"
f* *
$ echo "${!n}"
f* *
</pre>

<p>
综上，使用双引号，因为会出现替换的替换（shell替换一次，eval新建子进程再替换一次（缺乏引用））。
</p>
</div>
</div>

<div id="outline-container-sec-1-34" class="outline-3">
<h3 id="sec-1-34"><span class="section-number-3">1.34</span> <span class="done DONE">DONE</span> 如何命名单元测试的测试目录？</h3>
<div class="outline-text-3" id="text-1-34">
<p>
？开发tart脚本，测试压缩和解压缩。
</p>

<p class="verse">
"${program}<sub>test</sub>" # 会破坏后缀，例如func.sh<sub>test</sub><br  />
"${program}.test" # 相对好<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-35" class="outline-3">
<h3 id="sec-1-35"><span class="section-number-3">1.35</span> <span class="done DONE">DONE</span> 如何选择单元测试目录？</h3>
<div class="outline-text-3" id="text-1-35">
<p>
？开发tart脚本，测试压缩和解压缩。
</p>

<p>
可选目录
</p>
<p class="verse">
"$HOME/.$project" # 不好，如果有同名目录，可能会删除掉真实数据。<br  />
"$HOME/.$program" # 不好，如果有同名目录，可能会删除掉真实数据。<br  />
"./${program}<sub>test</sub><sub>dir</sub>" # 可以，避免目录重名。<br  />
"$project/test<sub>dir</sub>" # 相对当前目录而言，麻烦，但是规范（如果需要保留数据，一般不需要，因为可以重复）。<br  />
<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-36" class="outline-3">
<h3 id="sec-1-36"><span class="section-number-3">1.36</span> 什么是集成测试和系统测试的区别？</h3>
<div class="outline-text-3" id="text-1-36">
<p>
？开发tart脚本。
</p>
</div>
</div>

<div id="outline-container-sec-1-37" class="outline-3">
<h3 id="sec-1-37"><span class="section-number-3">1.37</span> 什么是单元测试和集成测试的区别？</h3>
<div class="outline-text-3" id="text-1-37">
<p>
？开发tart脚本。
</p>
</div>
</div>

<div id="outline-container-sec-1-38" class="outline-3">
<h3 id="sec-1-38"><span class="section-number-3">1.38</span> <span class="done DONE">DONE</span> 如何解决linux rm删除文件时，可能误删除的问题？</h3>
<div class="outline-text-3" id="text-1-38">
<p>
？开发tart脚本，开发单元测试脚本。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=linux+safe+rm&ie=utf-8&oe=utf-8">https://www.google.com/search?q=linux+safe+rm&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://serverfault.com/questions/337082/how-do-i-prevent-accidental-rm-rf">https://serverfault.com/questions/337082/how-do-i-prevent-accidental-rm-rf</a>
</li>
</ul>
<p class="verse">
<br  />
Don't do that! As a matter of practice, don't use ./<br  />
<br  />
My friend told me he never uses rm -rf *. He always changes the directory first, and uses a specific target.<br  />
<br  />
The best solutions involve changing your habits not to use rm directly.<br  />
<br  />
Yes: Don't work as root and always think twice before acting.<br  />
<br  />
When I delete a directory recursively, I put the -r, and -f if applicable, at the end of the command, e.g.<br  />
</p>

<ul class="org-ul">
<li><a href="https://stackoverflow.com/search?q=safe+rm">https://stackoverflow.com/search?q=safe+rm</a>
</li>
<li><a href="https://stackoverflow.com/questions/373156/what-is-the-safest-way-to-empty-a-directory-in-nix">https://stackoverflow.com/questions/373156/what-is-the-safest-way-to-empty-a-directory-in-nix</a>
</li>
</ul>
<p>
手动操作
</p>
<pre class="example">
alias del="pwd;read;rm"
</pre>

<ul class="org-ul">
<li><a href="https://stackoverflow.com/search?q=safe+rm">https://stackoverflow.com/search?q=safe+rm</a>
</li>
<li><a href="https://stackoverflow.com/questions/992737/safe-rm-rf-function-in-shell-script">https://stackoverflow.com/questions/992737/safe-rm-rf-function-in-shell-script</a>
</li>
</ul>
<p>
自动操作（程序）
</p>
<pre class="example">
cd $SOMEPATH &amp;&amp; rm -rf *
</pre>

<p>
综上
</p>
<ul class="org-ul">
<li>使用mv代替rm。
</li>
<li>如果使用rm，不要使用./，切换目录，指定删除文件，不要使用*。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-39" class="outline-3">
<h3 id="sec-1-39"><span class="section-number-3">1.39</span> <span class="done DONE">DONE</span> 如何shunit2命名测试文件？</h3>
<div class="outline-text-3" id="text-1-39">
<p>
？开发tart脚本。
</p>

<ul class="org-ul">
<li><a href="https://github.com/kward/shunit2">https://github.com/kward/shunit2</a>
</li>
</ul>
<p class="verse">
equality<sub>test</sub>.sh<br  />
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=junit&ie=utf-8&oe=utf-8">https://www.google.com/search?q=junit&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://github.com/junit-team/junit4/wiki/Getting-started">https://github.com/junit-team/junit4/wiki/Getting-started</a>
</li>
</ul>
<p class="verse">
CalculatorTest.java<br  />
</p>

<p>
综上，一般格式为"file<sub>test</sub>.sh"
</p>
</div>
</div>
<div id="outline-container-sec-1-40" class="outline-3">
<h3 id="sec-1-40"><span class="section-number-3">1.40</span> 为什么需要单元测试？</h3>
<div class="outline-text-3" id="text-1-40">
<p>
？开发tart脚本。
</p>
</div>
</div>

<div id="outline-container-sec-1-41" class="outline-3">
<h3 id="sec-1-41"><span class="section-number-3">1.41</span> 如何bash使用;结尾，";"或" ;"？</h3>
<div class="outline-text-3" id="text-1-41">
<p>
？
</p>
</div>
</div>

<div id="outline-container-sec-1-42" class="outline-3">
<h3 id="sec-1-42"><span class="section-number-3">1.42</span> 如何bash cd快速切换目录？</h3>
<div class="outline-text-3" id="text-1-42">
<p>
？使用emacs快速编辑stf.org
</p>
</div>
</div>
