blog.org
** 如何解决emacs dired使用mvt脚本，报错"sudo: no tty present and no askpass program specified"（sudo需要输入密码导致）？
？emacs dired使用mvt脚本，批量删除art、gtd、phi目录。

- https://www.google.com/search?q=sudo:+no+tty+present+and+no+askpass+program+specified&ie=utf-8&oe=utf-8
- https://stackoverflow.com/questions/21659637/how-to-fix-sudo-no-tty-present-and-no-askpass-program-specified-error
sudo visudo
#+BEGIN_SRC  
$username ALL = NOPASSWD: /fullpath/to/command, /fullpath/to/othercommand
#+END_SRC

最优办法，去掉脚本中的sudo命令，如果要使用sudo，在脚本外使用（使整个脚本生效，而不是局部使用）。
  
** 如何解决bash ${*}参数中双引号失效问题（空格导致）？
？开发mvt脚本，批量mv时，双引号失效。

t.sh
#+BEGIN_SRC  
echo ${*}
#+END_SRC

#+BEGIN_SRC  
bash t.sh
#+END_SRC

使用"${@}"，使用${@}无效
#+BEGIN_SRC  
for i in "${@}"; do
	cmd="sudo mv -f -t \"${date_dir}\" \"${i}\""
	echo "${cmd}"
	eval "${cmd}"
done

#+END_SRC
？引用？
** 如何测试bash的BASH_SOURCE变量，不写脚本？
？开发mvt脚本，自动生成配置目录路径。

https://stackoverflow.com/questions/11065077/eval-command-in-bash-and-its-typical-uses
#+BEGIN_VERSE
bash$ set -- one two three  # sets $1 $2 $3
bash$ echo $1
#+END_VERSE
** 什么是bash ${!var}含义？
？开发mvt脚本，自动生成配置目录路径。

** DONE 如何bash获取执行脚本的文件路径？
   CLOSED: [2017-07-13 Thu 15:44]
？开发mvt脚本，自动生成配置目录路径。

- https://www.google.com/search?q=bash+current+script+path&ie=utf-8&oe=utf-8
- https://stackoverflow.com/questions/59895/getting-the-source-directory-of-a-bash-script-from-within
#+BEGIN_SRC  
"$(readlink --canonicalize-missing "${BASH_SOURCE[0]}")"
#+END_SRC
** 如何emacs dired检索并标记文件？
？删除ken_script多余的org文档。
** 为什么使用bash脚本mvt作为emacs dired删除命令，而不是直接写elisp脚本？
？使用emacs dired删除文件到回收站。

shell和emacs都可以通用，移植性好。（需要解决windows不通用）。
** 如何命名软件程序的配置目录名？
？命名mvt的配置目录。

#+BEGIN_SRC 
.$program 
#+END_SRC
** DONE 如何emacs shell输入密码时使用*代替？
   CLOSED: [2017-07-17 Mon 19:41]
？用于git push，发布ken_script。

#+BEGIN_SRC  
https://www.google.com/search?q=emacs+shell+password+asterisk
https://emacs.stackexchange.com/questions/21116/how-to-prevent-emacs-from-showing-passphrase-in-m-x-shell

(setq comint-password-prompt-regexp
      (concat comint-password-prompt-regexp
              "\\|^.*Password.*\\'"))
#+END_SRC
** 如何emacs dired使用git push？
？使用gitt，发布ken_script
** 如何emacs dired使用backspace返回上一级？
？模拟windows的资源管理器。
** 如何emacs org快速排序item项？
？编写ken_script文档时，排序软件名。
** 如何emacs dired光标快速定位目标文件（或目录）？
？编写ken_script文档时，需要阅读源代码，需要定位、切换目录。
** 什么是括号是否换行的最佳实践？
？开发gnomet脚本，if语句的then不换行。

if和then形状不如{}那么对称，因此不换行
** 为什么bash if语句中常量放谓语前面，变量谓语后面？
？开发gnomet。
** 什么是bash脚本开发时选项规范？
？开发grepr，使用posix规范和缩写规范。
** 为什么开发bash脚本时，命令的选项尽量使用完整名，而不是缩写？
？阅读grepr时，更快理解grep命令中的选项含义。
** 什么是sed -En 's|x|y|g'和sed -E 's|x|y|gp'的区别？
？findr中，使用-En代替p。
** DONE 什么是realpath -m含义？
	 CLOSED: [2017-07-13 Thu 11:40]
？使得findr输出绝对路径，快速使用emacs编辑文件。

- https://www.google.com/search?q=--canonicalize-missing+mean&ie=utf-8&oe=utf-8
- https://unix.stackexchange.com/questions/202855/explain-the-options-of-readlink-command
#+BEGIN_VERSE
-m option is the opposite of -e. No test will be made to check if the components of path exist
#+END_VERSE
#+BEGIN_SRC  
$ readlink -m ./subdir/link/fakedir/fakefile
/tmp/realdir/fakedir/fakefile

$ ln -s /nonexistent /tmp/subdir/brokenlink

$ readlink -m ./subdir/brokenlink/foobar
/nonexistent/foobar
#+END_SRC
** DONE 如何linux bash转换相对路径.为绝对路径？
	 CLOSED: [2017-07-13 Thu 11:35]
？使得findr输出绝对路径，快速使用emacs编辑文件。

- https://www.google.com/search?q=convert+relative+path+to+absolute+bash&ie=utf-8&oe=utf-8
- https://stackoverflow.com/questions/6643853/how-to-convert-in-path-names-to-absolute-name-in-a-bash-script
#+BEGIN_VERSE
readlink -m $relative_path
#+END_VERSE


** 如何emacs org删除文件到回收站目录，而不是直接删除文件？
？用于备份文件，类似windows的回收站目录。
** 如何emacs org检索文档时，仅仅检索item项标题？
？快速检索目标内容，例如检索nohup。

** 如何linux nohup不输出nohup.out？
？避免污染git repo。


- https://www.google.com/search?q=nohup&ie=utf-8&oe=utf-8
- http://www.cnblogs.com/allenblogs/archive/2011/05/19/2051136.html
#+BEGIN_SRC  
nohup $command > $out_file &

# 测试
nohup ls > /dev/null &
#+END_SRC
** DONE 什么是linux网站dir.com和man7.org的区别？
   CLOSED: [2017-07-05 Wed 12:03]
？用于引用。

- https://www.die.net/
- http://man7.org
  
使用google搜索，dir.net的结果多些。

** 什么是总结和读书笔记的区别？
？分类文档，需要区分概念。

参考"阮一峰的网络日志 - 阮一峰的个人网站"

- 总结是实践日志，例如linux应用总结。（智慧、act）
- 读书笔记是读书日志，例如鸟哥的linux私房菜读书笔记。（知识、nonact）
** 如何linux快速打开历史文件？
？关闭文档，删除刺激。
** 如何linux bash判断目录是否是git工程？
** 如何linux bash清屏？
？开发pingt脚本，需要循环输出。

- https://www.google.com/search?q=bash+clear+screen
- https://stackoverflow.com/questions/6367046/cls-equivalent-in-bash
clear
- http://man7.org/linux/man-pages/man1/clear.1.html
