blog.html

<div id="outline-container-sec-1-43" class="outline-3">
<h3 id="sec-1-43"><span class="section-number-3">1.43</span> 如何解决emacs dired使用mvt脚本，报错"sudo: no tty present and no askpass program specified"（sudo需要输入密码导致）？</h3>
<div class="outline-text-3" id="text-1-43">
<p>
？emacs dired使用mvt脚本，批量删除art、gtd、phi目录。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=sudo:+no+tty+present+and+no+askpass+program+specified&ie=utf-8&oe=utf-8">https://www.google.com/search?q=sudo:+no+tty+present+and+no+askpass+program+specified&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://stackoverflow.com/questions/21659637/how-to-fix-sudo-no-tty-present-and-no-askpass-program-specified-error">https://stackoverflow.com/questions/21659637/how-to-fix-sudo-no-tty-present-and-no-askpass-program-specified-error</a>
</li>
</ul>
<p>
sudo visudo
</p>
<pre class="example">
$username ALL = NOPASSWD: /fullpath/to/command, /fullpath/to/othercommand
</pre>

<p>
最优办法，去掉脚本中的sudo命令，如果要使用sudo，在脚本外使用（使整个脚本生效，而不是局部使用）。
</p>
</div>
</div>

<div id="outline-container-sec-1-44" class="outline-3">
<h3 id="sec-1-44"><span class="section-number-3">1.44</span> 如何解决bash ${*}参数中双引号失效问题（空格导致）？</h3>
<div class="outline-text-3" id="text-1-44">
<p>
？开发mvt脚本，批量mv时，双引号失效。
</p>

<p>
t.sh
</p>
<pre class="example">
echo ${*}
</pre>

<pre class="example">
bash t.sh
</pre>

<p>
使用"${@}"，使用${@}无效
</p>
<pre class="example">
for i in "${@}"; do
	cmd="sudo mv -f -t \"${date_dir}\" \"${i}\""
	echo "${cmd}"
	eval "${cmd}"
done
</pre>
<p>
？引用？
</p>
</div>
</div>
<div id="outline-container-sec-1-45" class="outline-3">
<h3 id="sec-1-45"><span class="section-number-3">1.45</span> 如何测试bash的BASH<sub>SOURCE变量，不写脚本？</sub></h3>
<div class="outline-text-3" id="text-1-45">
<p>
？开发mvt脚本，自动生成配置目录路径。
</p>

<p>
<a href="https://stackoverflow.com/questions/11065077/eval-command-in-bash-and-its-typical-uses">https://stackoverflow.com/questions/11065077/eval-command-in-bash-and-its-typical-uses</a>
</p>
<p class="verse">
bash$ set &#x2013; one two three  # sets $1 $2 \(3<br  />
bash\) echo $1<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-46" class="outline-3">
<h3 id="sec-1-46"><span class="section-number-3">1.46</span> 什么是bash ${!var}含义？</h3>
<div class="outline-text-3" id="text-1-46">
<p>
？开发mvt脚本，自动生成配置目录路径。
</p>
</div>
</div>

<div id="outline-container-sec-1-47" class="outline-3">
<h3 id="sec-1-47"><span class="section-number-3">1.47</span> <span class="done DONE">DONE</span> 如何bash获取执行脚本的文件路径？</h3>
<div class="outline-text-3" id="text-1-47">
<p>
？开发mvt脚本，自动生成配置目录路径。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=bash+current+script+path&ie=utf-8&oe=utf-8">https://www.google.com/search?q=bash+current+script+path&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://stackoverflow.com/questions/59895/getting-the-source-directory-of-a-bash-script-from-within">https://stackoverflow.com/questions/59895/getting-the-source-directory-of-a-bash-script-from-within</a>
</li>
</ul>
<pre class="example">
"$(readlink --canonicalize-missing "${BASH_SOURCE[0]}")"
</pre>
</div>
</div>
<div id="outline-container-sec-1-48" class="outline-3">
<h3 id="sec-1-48"><span class="section-number-3">1.48</span> 如何emacs dired检索并标记文件？</h3>
<div class="outline-text-3" id="text-1-48">
<p>
？删除ken<sub>script多余的org文档。</sub>
</p>
</div>
</div>
<div id="outline-container-sec-1-49" class="outline-3">
<h3 id="sec-1-49"><span class="section-number-3">1.49</span> 为什么使用bash脚本mvt作为emacs dired删除命令，而不是直接写elisp脚本？</h3>
<div class="outline-text-3" id="text-1-49">
<p>
？使用emacs dired删除文件到回收站。
</p>

<p>
shell和emacs都可以通用，移植性好。（需要解决windows不通用）。
</p>
</div>
</div>
<div id="outline-container-sec-1-50" class="outline-3">
<h3 id="sec-1-50"><span class="section-number-3">1.50</span> 如何命名软件程序的配置目录名？</h3>
<div class="outline-text-3" id="text-1-50">
<p>
？命名mvt的配置目录。
</p>

<pre class="example">
.$program
</pre>
</div>
</div>
<div id="outline-container-sec-1-51" class="outline-3">
<h3 id="sec-1-51"><span class="section-number-3">1.51</span> 如何emacs shell输入密码时使用*代替？</h3>
<div class="outline-text-3" id="text-1-51">
<p>
？用于git push，发布ken<sub>script。</sub>
</p>
</div>
</div>
<div id="outline-container-sec-1-52" class="outline-3">
<h3 id="sec-1-52"><span class="section-number-3">1.52</span> 如何emacs dired切换为shell时，shell当前目录为dired的当前目录？</h3>
<div class="outline-text-3" id="text-1-52">
<p>
？用于git push，发布ken<sub>script。</sub>
</p>
</div>
</div>
<div id="outline-container-sec-1-53" class="outline-3">
<h3 id="sec-1-53"><span class="section-number-3">1.53</span> 如何emacs dired使用git push？</h3>
<div class="outline-text-3" id="text-1-53">
<p>
？使用gitt，发布ken<sub>script</sub>
</p>
</div>
</div>
<div id="outline-container-sec-1-54" class="outline-3">
<h3 id="sec-1-54"><span class="section-number-3">1.54</span> 如何emacs dired使用backspace返回上一级？</h3>
<div class="outline-text-3" id="text-1-54">
<p>
？模拟windows的资源管理器。
</p>
</div>
</div>
<div id="outline-container-sec-1-55" class="outline-3">
<h3 id="sec-1-55"><span class="section-number-3">1.55</span> 如何emacs org快速排序item项？</h3>
<div class="outline-text-3" id="text-1-55">
<p>
？编写ken<sub>script文档时，排序软件名。</sub>
</p>
</div>
</div>
<div id="outline-container-sec-1-56" class="outline-3">
<h3 id="sec-1-56"><span class="section-number-3">1.56</span> 如何emacs dired光标快速定位目标文件（或目录）？</h3>
<div class="outline-text-3" id="text-1-56">
<p>
？编写ken<sub>script文档时，需要阅读源代码，需要定位、切换目录。</sub>
</p>
</div>
</div>
<div id="outline-container-sec-1-57" class="outline-3">
<h3 id="sec-1-57"><span class="section-number-3">1.57</span> 什么是括号是否换行的最佳实践？</h3>
<div class="outline-text-3" id="text-1-57">
<p>
？开发gnomet脚本，if语句的then不换行。
</p>

<p>
if和then形状不如{}那么对称，因此不换行
</p>
</div>
</div>
<div id="outline-container-sec-1-58" class="outline-3">
<h3 id="sec-1-58"><span class="section-number-3">1.58</span> 为什么bash if语句中常量放谓语前面，变量谓语后面？</h3>
<div class="outline-text-3" id="text-1-58">
<p>
？开发gnomet。
</p>
</div>
</div>
<div id="outline-container-sec-1-59" class="outline-3">
<h3 id="sec-1-59"><span class="section-number-3">1.59</span> 什么是bash脚本开发时选项规范？</h3>
<div class="outline-text-3" id="text-1-59">
<p>
？开发grepr，使用posix规范和缩写规范。
</p>
</div>
</div>
<div id="outline-container-sec-1-60" class="outline-3">
<h3 id="sec-1-60"><span class="section-number-3">1.60</span> 为什么开发bash脚本时，命令的选项尽量使用完整名，而不是缩写？</h3>
<div class="outline-text-3" id="text-1-60">
<p>
？阅读grepr时，更快理解grep命令中的选项含义。
</p>
</div>
</div>
<div id="outline-container-sec-1-61" class="outline-3">
<h3 id="sec-1-61"><span class="section-number-3">1.61</span> 什么是sed -En 's|x|y|g'和sed -E 's|x|y|gp'的区别？</h3>
<div class="outline-text-3" id="text-1-61">
<p>
？findr中，使用-En代替p。
</p>
</div>
</div>
<div id="outline-container-sec-1-62" class="outline-3">
<h3 id="sec-1-62"><span class="section-number-3">1.62</span> <span class="done DONE">DONE</span> 什么是realpath -m含义？</h3>
<div class="outline-text-3" id="text-1-62">
<p>
？使得findr输出绝对路径，快速使用emacs编辑文件。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=--canonicalize-missing+mean&ie=utf-8&oe=utf-8">https://www.google.com/search?q=--canonicalize-missing+mean&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://unix.stackexchange.com/questions/202855/explain-the-options-of-readlink-command">https://unix.stackexchange.com/questions/202855/explain-the-options-of-readlink-command</a>
</li>
</ul>
<p class="verse">
-m option is the opposite of -e. No test will be made to check if the components of path exist<br  />
</p>
<pre class="example">
$ readlink -m ./subdir/link/fakedir/fakefile
/tmp/realdir/fakedir/fakefile

$ ln -s /nonexistent /tmp/subdir/brokenlink

$ readlink -m ./subdir/brokenlink/foobar
/nonexistent/foobar
</pre>
</div>
</div>
<div id="outline-container-sec-1-63" class="outline-3">
<h3 id="sec-1-63"><span class="section-number-3">1.63</span> <span class="done DONE">DONE</span> 如何linux bash转换相对路径.为绝对路径？</h3>
<div class="outline-text-3" id="text-1-63">
<p>
？使得findr输出绝对路径，快速使用emacs编辑文件。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=convert+relative+path+to+absolute+bash&ie=utf-8&oe=utf-8">https://www.google.com/search?q=convert+relative+path+to+absolute+bash&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://stackoverflow.com/questions/6643853/how-to-convert-in-path-names-to-absolute-name-in-a-bash-script">https://stackoverflow.com/questions/6643853/how-to-convert-in-path-names-to-absolute-name-in-a-bash-script</a>
</li>
</ul>
<p class="verse">
readlink -m $relative<sub>path</sub><br  />
</p>
</div>
</div>


<div id="outline-container-sec-1-64" class="outline-3">
<h3 id="sec-1-64"><span class="section-number-3">1.64</span> 如何emacs org删除文件到回收站目录，而不是直接删除文件？</h3>
<div class="outline-text-3" id="text-1-64">
<p>
？用于备份文件，类似windows的回收站目录。
</p>
</div>
</div>
<div id="outline-container-sec-1-65" class="outline-3">
<h3 id="sec-1-65"><span class="section-number-3">1.65</span> 如何emacs org检索文档时，仅仅检索item项标题？</h3>
<div class="outline-text-3" id="text-1-65">
<p>
？快速检索目标内容，例如检索nohup。
</p>
</div>
</div>

<div id="outline-container-sec-1-66" class="outline-3">
<h3 id="sec-1-66"><span class="section-number-3">1.66</span> 如何linux nohup不输出nohup.out？</h3>
<div class="outline-text-3" id="text-1-66">
<p>
？避免污染git repo。
</p>


<ul class="org-ul">
<li><a href="https://www.google.com/search?q=nohup&ie=utf-8&oe=utf-8">https://www.google.com/search?q=nohup&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="http://www.cnblogs.com/allenblogs/archive/2011/05/19/2051136.html">http://www.cnblogs.com/allenblogs/archive/2011/05/19/2051136.html</a>
</li>
</ul>
<pre class="example">
nohup $command &gt; $out_file &amp;

# 测试
nohup ls &gt; /dev/null &amp;
</pre>
</div>
</div>
<div id="outline-container-sec-1-67" class="outline-3">
<h3 id="sec-1-67"><span class="section-number-3">1.67</span> <span class="done DONE">DONE</span> 什么是linux网站dir.com和man7.org的区别？</h3>
<div class="outline-text-3" id="text-1-67">
<p>
？用于引用。
</p>

<ul class="org-ul">
<li><a href="https://www.die.net/">https://www.die.net/</a>
</li>
<li><a href="http://man7.org">http://man7.org</a>
</li>
</ul>

<p>
使用google搜索，dir.net的结果多些。
</p>
</div>
</div>

<div id="outline-container-sec-1-68" class="outline-3">
<h3 id="sec-1-68"><span class="section-number-3">1.68</span> 什么是总结和读书笔记的区别？</h3>
<div class="outline-text-3" id="text-1-68">
<p>
？分类文档，需要区分概念。
</p>

<p>
参考"阮一峰的网络日志 - 阮一峰的个人网站"
</p>

<ul class="org-ul">
<li>总结是实践日志，例如linux应用总结。（智慧、act）
</li>
<li>读书笔记是读书日志，例如鸟哥的linux私房菜读书笔记。（知识、nonact）
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-69" class="outline-3">
<h3 id="sec-1-69"><span class="section-number-3">1.69</span> 如何linux快速打开历史文件？</h3>
<div class="outline-text-3" id="text-1-69">
<p>
？关闭文档，删除刺激。
</p>
</div>
</div>
<div id="outline-container-sec-1-70" class="outline-3">
<h3 id="sec-1-70"><span class="section-number-3">1.70</span> 如何linux bash判断目录是否是git工程？</h3>
</div>
<div id="outline-container-sec-1-71" class="outline-3">
<h3 id="sec-1-71"><span class="section-number-3">1.71</span> 如何linux bash清屏？</h3>
<div class="outline-text-3" id="text-1-71">
<p>
？开发pingt脚本，需要循环输出。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=bash+clear+screen">https://www.google.com/search?q=bash+clear+screen</a>
</li>
<li><a href="https://stackoverflow.com/questions/6367046/cls-equivalent-in-bash">https://stackoverflow.com/questions/6367046/cls-equivalent-in-bash</a>
</li>
</ul>
<p>
clear
</p>
<ul class="org-ul">
<li><a href="http://man7.org/linux/man-pages/man1/clear.1.html">http://man7.org/linux/man-pages/man1/clear.1.html</a>
</li>
</ul>
</div>
</div>
