blog.org
** 是否linux管道是子进程？
？开发pingt脚本，需要后台挂起进程。
** DONE 什么是linux man数字区别？
   CLOSED: [2017-07-01 Sat 00:26]

- 鸟哥的Linux私房菜 基础学习篇 3ed-鸟哥 p123
  
- http://man7.org/linux/man-pages/man1/man.1.html
#+BEGIN_VERSE
1   Executable programs or shell commands
2   System calls (functions provided by the kernel)
3   Library calls (functions within program libraries)
4   Special files (usually found in /dev)
5   File formats and conventions eg /etc/passwd
6   Games
7   Miscellaneous (including macro packages and conventions), e.g.
man(7), groff(7)
8   System administration commands (usually only for root)
9   Kernel routines [Non standard]
#+END_VERSE
** DONE 如何linux bash延迟或挂起脚本？
   CLOSED: [2017-07-01 Sat 00:22]
？开发pingt脚本，需要循环创建脚本，避免过多进程。

- https://www.google.com/search?q=bash+delay&ie=utf-8&oe=utf-8
- https://stackoverflow.com/questions/32359374/how-could-i-run-a-shell-script-with-delay
sleep

- http://man7.org/linux/man-pages/man3/sleep.3.html
- http://man7.org/linux/man-pages/man1/sleep.1.html
#+BEGIN_SRC  
sleep $sec
#+END_SRC

** DONE 如何bash使用while循环？
   CLOSED: [2017-07-01 Sat 00:11]
？开发pingt脚本，循环显示域名平均延时。

- https://www.gnu.org/software/bash/manual/bash.html
- 3.2.4.1 Looping Constructs
#+BEGIN_SRC  
while test-commands; do consequent-commands; done

while true
do
	printf "1"
done
#+END_SRC
** DONE 如何linux bash排序文本行？
   CLOSED: [2017-07-01 Sat 00:00]
？开发pingt脚本，排序延时最低域名。

- 鸟哥的Linux私房菜 基础学习篇 3ed-鸟哥 p336
- http://man7.org/linux/man-pages/man1/sort.1.html

#+BEGIN_SRC  
sort --key=2 --numeric-sort --reverse<<end
a 2
b 3
c 1
end
#+END_SRC

** DONE 如何awk使用数组？
   CLOSED: [2017-06-30 Fri 22:52]
？开发pingt脚本，分组计算时需要使用。

- https://www.google.com/search?q=awk+分组&ie=utf-8&oe=utf-8
- http://6226001001.blog.51cto.com/9243584/1659824
#+BEGIN_SRC  
awk '{s[$1] += $2}END{ for(i in s){  print i, s[i] } }'
#+END_SRC

- https://www.gnu.org/software/gawk/manual/gawk.html#Arrays
8.1.4 Basic Array Example
#+BEGIN_SRC  
awk 'BEGIN{ a["b"]=1; print a["b"] }'
#+END_SRC

- https://www.gnu.org/software/gawk/manual/gawk.html
4.2 Examining Fields
#+BEGIN_VERSE
You use a dollar sign (‘$’) to refer to a field in an awk program, followed by the number of the field you want.
#+END_VERSE
#+BEGIN_SRC  
awk '/li/ { print $1, $NF }' <<<'li 1 2 3'
#+END_SRC

- https://www.gnu.org/software/gawk/manual/gawk.html#Regexp
3.1 How to Use Regular Expressions
#+BEGIN_SRC  
awk '/li/ { print $2 }' <<<'li 2'
awk '$1 ~ /J/' <<<'J1'
awk '{ if ($1 ~ /J/) print }'<<<'J1'
#+END_SRC

** DONE 什么是bash <<<含义？
   CLOSED: [2017-06-30 Fri 23:29]
？开发pingt脚本，测试awk命令。
？开发pingt脚本，测试awk时用到。

- https://www.google.com/search?q=treble+left+arrow+bash
- https://stackoverflow.com/questions/16045139/redirector-in-ubuntu
  
- https://www.gnu.org/software/bash/manual/bashref.html#Here-Strings
3.6.6 Here Documents

- https://www.gnu.org/software/bash/manual/bashref.html#Here-Strings
3.6.7 Here Strings

** DONE 如何vim返回历史光标位置？
   CLOSED: [2017-06-30 Fri 20:25]
？emacs evil编写awk日志时，被中断，需要返回。

- Vim实用技巧-Neil p125
C-i C-o

- liberator://help/all
- History
	
- http://vimdoc.sourceforge.net/htmldoc/help.html
- http://vimdoc.sourceforge.net/htmldoc/motion.html#CTRL-O
8. Jumps			|jump-motions|
#+BEGIN_SRC  

#+END_SRC

** DONE 如何vim m标记光标位置？
   CLOSED: [2017-06-30 Fri 20:59]
？emacs evil编写awk日志时，被中断，需要返回。

- VI和VIM编辑器 p59
mx

- http://vimdoc.sourceforge.net/htmldoc/usr_03.html
- |03.10|	Using marks
#+BEGIN_SRC  
ma
`a
#+END_SRC

** 如何linux bash编辑pdf的页码？
？使用开源软件代替acrobat pro。
** DONE 如何sed输出正则匹配的字符串组？
   CLOSED: [2017-06-30 Fri 18:26]
？获取ping结果中的ip和time。

- 鸟哥的Linux私房菜 基础学习篇 3ed-鸟哥 p357
-r

#+BEGIN_SRC  
ping baidu.com | sed -E "s/.*\((.+)\).*time=([^ ]+).*/\1\t\2/g"
#+END_SRC

- https://www.gnu.org/software/sed/manual/sed.html
-E
#+BEGIN_VERSE
    Historically this was a GNU extension, but the -E extension has since been added to the POSIX standard (http://austingroupbugs.net/view.php?id=528), so use -E for portability. GNU sed has accepted -E as an undocumented option for years, and *BSD seds have accepted -E for years as well, but scripts that use -E might not port to other older systems. See Extended regular expressions.
#+END_VERSE

- https://www.gnu.org/software/sed/manual/sed.html#The-_0022s_0022-Command
3.3 s/regexp/replacement/flags

- https://www.gnu.org/software/sed/manual/sed.html#The-_0022s_0022-Command
3.3 flags

- https://www.gnu.org/software/sed/manual/sed.html#The-_0022s_0022-Command
3.3 \1 \n 
#+BEGIN_VERSE
The replacement can contain \n (n being a number from 1 to 9, inclusive) references, which refer to the portion of the match which is contained between the nth \( and its matching \). Also, the replacement can contain unescaped & characters which reference the whole matched portion of the pattern space. 
#+END_VERSE

- https://www.gnu.org/software/sed/manual/sed.html#BRE-syntax
5.3 regexp syntax

- https://www.gnu.org/software/sed/manual/sed.html#BRE-syntax
5.3 group \(\)

- https://www.gnu.org/software/sed/manual/sed.html#ERE-syntax
5.4 group -E或-r ()

- https://www.gnu.org/software/sed/manual/sed.html#BRE-vs-ERE
5.2 BRE vs ERE

