blog.html
<div id="outline-container-sec-1-72" class="outline-3">
<h3 id="sec-1-72"><span class="section-number-3">1.72</span> 是否linux管道是子进程？</h3>
<div class="outline-text-3" id="text-1-72">
<p>
？开发pingt脚本，需要后台挂起进程。
</p>
</div>
</div>
<div id="outline-container-sec-1-73" class="outline-3">
<h3 id="sec-1-73"><span class="section-number-3">1.73</span> <span class="done DONE">DONE</span> 什么是linux man数字区别？</h3>
<div class="outline-text-3" id="text-1-73">
<ul class="org-ul">
<li>鸟哥的Linux私房菜 基础学习篇 3ed-鸟哥 p123
</li>

<li><a href="http://man7.org/linux/man-pages/man1/man.1.html">http://man7.org/linux/man-pages/man1/man.1.html</a>
</li>
</ul>
<p class="verse">
1   Executable programs or shell commands<br  />
2   System calls (functions provided by the kernel)<br  />
3   Library calls (functions within program libraries)<br  />
4   Special files (usually found in /dev)<br  />
5   File formats and conventions eg /etc/passwd<br  />
6   Games<br  />
7   Miscellaneous (including macro packages and conventions), e.g.<br  />
man(7), groff(7)<br  />
8   System administration commands (usually only for root)<br  />
9   Kernel routines [Non standard]<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-74" class="outline-3">
<h3 id="sec-1-74"><span class="section-number-3">1.74</span> <span class="done DONE">DONE</span> 如何linux bash延迟或挂起脚本？</h3>
<div class="outline-text-3" id="text-1-74">
<p>
？开发pingt脚本，需要循环创建脚本，避免过多进程。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=bash+delay&ie=utf-8&oe=utf-8">https://www.google.com/search?q=bash+delay&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://stackoverflow.com/questions/32359374/how-could-i-run-a-shell-script-with-delay">https://stackoverflow.com/questions/32359374/how-could-i-run-a-shell-script-with-delay</a>
</li>
</ul>
<p>
sleep
</p>

<ul class="org-ul">
<li><a href="http://man7.org/linux/man-pages/man3/sleep.3.html">http://man7.org/linux/man-pages/man3/sleep.3.html</a>
</li>
<li><a href="http://man7.org/linux/man-pages/man1/sleep.1.html">http://man7.org/linux/man-pages/man1/sleep.1.html</a>
</li>
</ul>
<pre class="example">
sleep $sec
</pre>
</div>
</div>

<div id="outline-container-sec-1-75" class="outline-3">
<h3 id="sec-1-75"><span class="section-number-3">1.75</span> <span class="done DONE">DONE</span> 如何bash使用while循环？</h3>
<div class="outline-text-3" id="text-1-75">
<p>
？开发pingt脚本，循环显示域名平均延时。
</p>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/bash/manual/bash.html">https://www.gnu.org/software/bash/manual/bash.html</a>
</li>
<li>3.2.4.1 Looping Constructs
</li>
</ul>
<pre class="example">
while test-commands; do consequent-commands; done

while true
do
	printf "1"
done
</pre>
</div>
</div>
<div id="outline-container-sec-1-76" class="outline-3">
<h3 id="sec-1-76"><span class="section-number-3">1.76</span> <span class="done DONE">DONE</span> 如何linux bash排序文本行？</h3>
<div class="outline-text-3" id="text-1-76">
<p>
？开发pingt脚本，排序延时最低域名。
</p>

<ul class="org-ul">
<li>鸟哥的Linux私房菜 基础学习篇 3ed-鸟哥 p336
</li>
<li><a href="http://man7.org/linux/man-pages/man1/sort.1.html">http://man7.org/linux/man-pages/man1/sort.1.html</a>
</li>
</ul>

<pre class="example">
sort --key=2 --numeric-sort --reverse&lt;&lt;end
a 2
b 3
c 1
end
</pre>
</div>
</div>

<div id="outline-container-sec-1-77" class="outline-3">
<h3 id="sec-1-77"><span class="section-number-3">1.77</span> <span class="done DONE">DONE</span> 如何awk使用数组？</h3>
<div class="outline-text-3" id="text-1-77">
<p>
？开发pingt脚本，分组计算时需要使用。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=awk+%E5%88%86%E7%BB%84&ie=utf-8&oe=utf-8">https://www.google.com/search?q=awk+%E5%88%86%E7%BB%84&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="http://6226001001.blog.51cto.com/9243584/1659824">http://6226001001.blog.51cto.com/9243584/1659824</a>
</li>
</ul>
<pre class="example">
awk '{s[$1] += $2}END{ for(i in s){  print i, s[i] } }'
</pre>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/gawk/manual/gawk.html#Arrays">https://www.gnu.org/software/gawk/manual/gawk.html#Arrays</a>
</li>
</ul>
<p>
8.1.4 Basic Array Example
</p>
<pre class="example">
awk 'BEGIN{ a["b"]=1; print a["b"] }'
</pre>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/gawk/manual/gawk.html">https://www.gnu.org/software/gawk/manual/gawk.html</a>
</li>
</ul>
<p>
4.2 Examining Fields
</p>
<p class="verse">
You use a dollar sign (‘$’) to refer to a field in an awk program, followed by the number of the field you want.<br  />
</p>
<pre class="example">
awk '/li/ { print $1, $NF }' &lt;&lt;&lt;'li 1 2 3'
</pre>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/gawk/manual/gawk.html#Regexp">https://www.gnu.org/software/gawk/manual/gawk.html#Regexp</a>
</li>
</ul>
<p>
3.1 How to Use Regular Expressions
</p>
<pre class="example">
awk '/li/ { print $2 }' &lt;&lt;&lt;'li 2'
awk '$1 ~ /J/' &lt;&lt;&lt;'J1'
awk '{ if ($1 ~ /J/) print }'&lt;&lt;&lt;'J1'
</pre>
</div>
</div>

<div id="outline-container-sec-1-78" class="outline-3">
<h3 id="sec-1-78"><span class="section-number-3">1.78</span> <span class="done DONE">DONE</span> 什么是bash &lt;&lt;&lt;含义？</h3>
<div class="outline-text-3" id="text-1-78">
<p>
？开发pingt脚本，测试awk命令。
？开发pingt脚本，测试awk时用到。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=treble+left+arrow+bash">https://www.google.com/search?q=treble+left+arrow+bash</a>
</li>
<li><a href="https://stackoverflow.com/questions/16045139/redirector-in-ubuntu">https://stackoverflow.com/questions/16045139/redirector-in-ubuntu</a>
</li>

<li><a href="https://www.gnu.org/software/bash/manual/bashref.html#Here-Strings">https://www.gnu.org/software/bash/manual/bashref.html#Here-Strings</a>
</li>
</ul>
<p>
3.6.6 Here Documents
</p>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/bash/manual/bashref.html#Here-Strings">https://www.gnu.org/software/bash/manual/bashref.html#Here-Strings</a>
</li>
</ul>
<p>
3.6.7 Here Strings
</p>
</div>
</div>

<div id="outline-container-sec-1-79" class="outline-3">
<h3 id="sec-1-79"><span class="section-number-3">1.79</span> <span class="done DONE">DONE</span> 如何vim返回历史光标位置？</h3>
<div class="outline-text-3" id="text-1-79">
<p>
？emacs evil编写awk日志时，被中断，需要返回。
</p>

<ul class="org-ul">
<li>Vim实用技巧-Neil p125
</li>
</ul>
<p>
C-i C-o
</p>

<ul class="org-ul">
<li>liberator://help/all
</li>
<li>History
</li>

<li><a href="http://vimdoc.sourceforge.net/htmldoc/help.html">http://vimdoc.sourceforge.net/htmldoc/help.html</a>
</li>
<li><a href="http://vimdoc.sourceforge.net/htmldoc/motion.html#CTRL-O">http://vimdoc.sourceforge.net/htmldoc/motion.html#CTRL-O</a>
</li>
<li>Jumps            |jump-motions|
</li>
</ul>
<pre class="example">
</pre>
</div>
</div>

<div id="outline-container-sec-1-80" class="outline-3">
<h3 id="sec-1-80"><span class="section-number-3">1.80</span> <span class="done DONE">DONE</span> 如何vim m标记光标位置？</h3>
<div class="outline-text-3" id="text-1-80">
<p>
？emacs evil编写awk日志时，被中断，需要返回。
</p>

<ul class="org-ul">
<li>VI和VIM编辑器 p59
</li>
</ul>
<p>
mx
</p>

<ul class="org-ul">
<li><a href="http://vimdoc.sourceforge.net/htmldoc/usr_03.html">http://vimdoc.sourceforge.net/htmldoc/usr_03.html</a>
</li>
<li>|03.10|    Using marks
</li>
</ul>
<pre class="example">
ma
`a
</pre>
</div>
</div>

<div id="outline-container-sec-1-81" class="outline-3">
<h3 id="sec-1-81"><span class="section-number-3">1.81</span> 如何linux bash编辑pdf的页码？</h3>
<div class="outline-text-3" id="text-1-81">
<p>
？使用开源软件代替acrobat pro。
</p>
</div>
</div>
<div id="outline-container-sec-1-82" class="outline-3">
<h3 id="sec-1-82"><span class="section-number-3">1.82</span> <span class="done DONE">DONE</span> 如何sed输出正则匹配的字符串组？</h3>
<div class="outline-text-3" id="text-1-82">
<p>
？获取ping结果中的ip和time。
</p>

<ul class="org-ul">
<li>鸟哥的Linux私房菜 基础学习篇 3ed-鸟哥 p357
</li>
</ul>
<p>
-r
</p>

<pre class="example">
ping baidu.com | sed -E "s/.*\((.+)\).*time=([^ ]+).*/\1\t\2/g"
</pre>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/sed/manual/sed.html">https://www.gnu.org/software/sed/manual/sed.html</a>
</li>
</ul>
<p>
-E
</p>
<p class="verse">
Historically this was a GNU extension, but the -E extension has since been added to the POSIX standard (<a href="http://austingroupbugs.net/view.php?id=528">http://austingroupbugs.net/view.php?id=528</a>), so use -E for portability. GNU sed has accepted -E as an undocumented option for years, and *BSD seds have accepted -E for years as well, but scripts that use -E might not port to other older systems. See Extended regular expressions.<br  />
</p>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/sed/manual/sed.html#The-_0022s_0022-Command">https://www.gnu.org/software/sed/manual/sed.html#The-_0022s_0022-Command</a>
</li>
</ul>
<p>
3.3 s/regexp/replacement/flags
</p>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/sed/manual/sed.html#The-_0022s_0022-Command">https://www.gnu.org/software/sed/manual/sed.html#The-_0022s_0022-Command</a>
</li>
</ul>
<p>
3.3 flags
</p>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/sed/manual/sed.html#The-_0022s_0022-Command">https://www.gnu.org/software/sed/manual/sed.html#The-_0022s_0022-Command</a>
</li>
</ul>
<p>
3.3 \1 \n 
</p>
<p class="verse">
The replacement can contain \n (n being a number from 1 to 9, inclusive) references, which refer to the portion of the match which is contained between the nth \( and its matching \). Also, the replacement can contain unescaped &amp; characters which reference the whole matched portion of the pattern space.<br  />
</p>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/sed/manual/sed.html#BRE-syntax">https://www.gnu.org/software/sed/manual/sed.html#BRE-syntax</a>
</li>
</ul>
<p>
5.3 regexp syntax
</p>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/sed/manual/sed.html#BRE-syntax">https://www.gnu.org/software/sed/manual/sed.html#BRE-syntax</a>
</li>
</ul>
<p>
5.3 group \(\)
</p>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/sed/manual/sed.html#ERE-syntax">https://www.gnu.org/software/sed/manual/sed.html#ERE-syntax</a>
</li>
</ul>
<p>
5.4 group -E或-r ()
</p>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/sed/manual/sed.html#BRE-vs-ERE">https://www.gnu.org/software/sed/manual/sed.html#BRE-vs-ERE</a>
</li>
</ul>
<p>
5.2 BRE vs ERE
</p>
</div>
</div>
