blog.org
** DONE 如何使用bash grep sed awk？
   CLOSED: [2017-06-30 Fri 17:10]
？开发pingt脚本。

- https://www.google.com/search?q=代替+awk&ie=utf-8&oe=utf-8
- https://www.zhihu.com/question/19911992
#+BEGIN_SRC  
比如在处理文本时有可能你会先用sed进行初步处理，然后再使用awk就会降低逻辑复杂度。
#+END_SRC

- https://www.google.com/search?q=代替+awk&ie=utf-8&oe=utf-8
- https://www.v2ex.com/t/160899
q（python的sql工具）

总结：
- grep筛选数据。
- sed格式化数据为表。
- awk计算数据，类似sql。
- bash控制。
** DONE 如何linux ping输出显示域名而不是ip？
   CLOSED: [2017-06-30 Fri 16:09]
？开发pingt脚本，查看域名知道ss服务器国家。

#+BEGIN_SRC  
domain=jp01-22.ssv7.net; ping $domain  | sed -E "s/(.*\()(.*)(\).*)/\1${domain}\3/g"
#+END_SRC
注意：这个案例后面接上重定向，会阻塞。
** DONE 如何awk设置分隔符？
   CLOSED: [2017-06-30 Fri 16:57]
？开发pingt脚本，sed处理后的数据分隔符为\t。

- 鸟哥的Linux私房菜 基础学习篇 3ed-鸟哥 p365
  
#+BEGIN_SRC  
printf "1 2"| awk 'BEGIN {FS=" "}{printf "%s\n", $1}'
#+END_SRC

- https://www.gnu.org/software/gawk/manual/gawk.html
- https://www.gnu.org/software/gawk/manual/gawk.html#BEGIN_002fEND
7.1.4 The BEGIN and END Special Patterns 
#+BEGIN_VERSE
A BEGIN rule is executed once only, before the first input record is read. Likewise, an END rule is executed once only, after all the input is read. 
#+END_VERSE
#+BEGIN_SRC  
awk '  
BEGIN { print "Analysis of \"li\"" }
/li/  { ++n }
END   { print "\"li\" appears in", n, "records." }' <<end
1
li
3
end

#+END_SRC

- https://www.gnu.org/software/gawk/manual/gawk.html#Command-Line-Field-Separator
4.5 Specifying How Fields Are Separated
#+BEGIN_SRC  
awk 'BEGIN { FS = "," } ; { print $2 }' <<<'John Q. Smith, 29 Oak St., Walamazoo, MI 42139'
#+END_SRC
4.5.4 Setting FS from the Command Line
#+BEGIN_SRC  
awk -F, 'program' input-files #
#+END_SRC

- https://www.gnu.org/software/gawk/manual/gawk.html#Basic-Printf
5.5.1 printf

** 如何linux查看后台进程？
？中止ping进程。
** 如何bash for变量标准输入stdin的内容？
？开发pingt脚本，遍历ip。
** DONE 如何判断bash的变量是数组或非数组？
   CLOSED: [2017-06-30 Fri 13:19]
？开发pingt，从pipe读取数据，用于for循环读取。

- https://www.google.com/search?q=bash+how+to+know+array+var
- https://stackoverflow.com/questions/14525296/bash-check-if-variable-is-array
#+BEGIN_SRC  
declare -p variable-name 2> /dev/null | grep -q '^declare \-a'
#+END_SRC
实际上判断bash变量属性是否是数组没有意义，因为for循环遍历变量，不检查变量是数组还是非数组。参考 https://stackoverflow.com/questions/44838045/what-is-the-difference-between-a-non-array-var-and-an-array-var-in-bash

以下经验信息可以参考，但是对题目意义不大。
  

- https://www.google.com/search?q=bash+array+length&ie=utf-8&oe=utf-8
- https://unix.stackexchange.com/questions/193039/how-to-count-the-length-of-an-array-defined-in-bash
${#array[@]} ${!array[@]}
#+BEGIN_SRC  
#!/bin/bash

array=( item1 item2 item3 )
for index in ${!array[@]}; do
    echo $index/${#array[@]}
done
#+END_SRC

- https://www.gnu.org/software/bash/manual/bash.html#Arrays
#+BEGIN_VERSE
${#name[subscript]} expands to the length of ${name[subscript]}.
数组长度len

${!name[@]} and ${!name[*]} expand to the indices assigned in array variable name.
替换为0 1 2...
#+END_VERSE

NOTE：变量也能当数组使用
#+BEGIN_SRC  
a=aa
printf "a len: ${#a[*]}\n"
for i in ${a[*]}
do
	echo $i
done

a=(aaa)
printf "a len: ${#a[*]}\n"
for i in ${a[*]}
do
	echo $i
done
#+END_SRC

** DONE 什么是bash中数组变量和非数组变量的区别？
   CLOSED: [2017-06-30 Fri 12:44]
？判断bash变量是否是数组。

- https://stackoverflow.com/questions/44838045/what-is-the-difference-between-a-non-array-var-and-an-array-var-in-bash
数组变量拥有attribute（属性）

- https://www.google.com/search?q=bash+how+to+use+declare&ie=utf-8&oe=utf-8
- https://unix.stackexchange.com/questions/254367/in-bash-script-whats-the-different-between-declare-and-a-normal-variable
declare赋予变量属性，例如declare -r。  

** DONE 如何解决emacs执行linux命令不输出结果，"Shell command succeeded with no output"？
   CLOSED: [2017-06-30 Fri 12:21]
？测试declare -p的脚本（判断数组）。

自己的错误，-p后没有加变量名v
#+BEGIN_SRC  
#!/usr/bin/env bash

v=()
declare -p # 需要变量名，所以这里是错误的。
#+END_SRC
** 如何bash -c使用pipe管道？
？测试mapfile脚本（没有权限）。

** DONE 什么是mapfile(readarray)和mapfile -t的区别？
   CLOSED: [2017-06-30 Fri 11:42]
？开发pingt脚本。
   
- https://www.gnu.org/software/bash/manual/html_node/Bash-Builtins.html  

#+BEGIN_SRC  
readarray -t v </dev/stdin

for i in "${v[@]}"
do
	printf "$i\n"
done
#+END_SRC

printf "1\n2 3\n" | t.sh | od -c
#+BEGIN_SRC  
0000000   1  \n   2       3  \n 
0000006    
#+END_SRC

#+BEGIN_SRC  
readarray v </dev/stdin

for i in "${v[@]}"
do
	printf "$i\n"
done
#+END_SRC

printf "1\n2 3\n" | t.sh | od -c
#+BEGIN_SRC  
0000000   1  \n  \n   2       3  \n  \n     
0000010
# 8进制，是8个字符
#+END_SRC
** DONE 什么是bash中数组${name[*]}和"${name[@]}"的区别？
   CLOSED: [2017-06-30 Fri 11:17]
？开发pingt脚本，使用从stdin读取的数组。

- https://www.google.com/search?q=bash+array+at+asterisk&ie=utf-8&oe=utf-8
- https://stackoverflow.com/questions/3348443/a-confusion-about-array-versus-array-in-the-context-of-a-bash-comple

#+BEGIN_SRC  
echo "with quotes around myarray[*]"
for x in "${myarray[*]}"; do
        echo "ARG[*]: '$x'"
done

echo "with quotes around myarray[@]"
for x in "${myarray[@]}"; do
        echo "ARG[@]: '$x'"
done

echo "without quotes around myarray[*]"
for x in ${myarray[*]}; do
        echo "ARG[*]: '$x'"
done

echo "without quotes around myarray[@]"
for x in ${myarray[@]}; do
        echo "ARG[@]: '$x'"
done
#+END_SRC

输出
#+BEGIN_SRC  
with quotes around myarray[*]
ARG[*]: 'one two three four'
with quotes around myarray[@]
ARG[@]: 'one'
ARG[@]: 'two'
ARG[@]: 'three four'
without quotes around myarray[*]
ARG[*]: 'one'
ARG[*]: 'two'
ARG[*]: 'three'
ARG[*]: 'four'
without quotes around myarray[@]
ARG[@]: 'one'
ARG[@]: 'two'
ARG[@]: 'three'
ARG[@]: 'four'
#+END_SRC
- https://www.gnu.org/software/bash/manual/bash.html#Arrays
