blog.html

<div id="outline-container-sec-1-83" class="outline-3">
<h3 id="sec-1-83"><span class="section-number-3">1.83</span> <span class="done DONE">DONE</span> 如何使用bash grep sed awk？</h3>
<div class="outline-text-3" id="text-1-83">
<p>
？开发pingt脚本。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=%E4%BB%A3%E6%9B%BF+awk&ie=utf-8&oe=utf-8">https://www.google.com/search?q=%E4%BB%A3%E6%9B%BF+awk&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://www.zhihu.com/question/19911992">https://www.zhihu.com/question/19911992</a>
</li>
</ul>
<pre class="example">
比如在处理文本时有可能你会先用sed进行初步处理，然后再使用awk就会降低逻辑复杂度。
</pre>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=%E4%BB%A3%E6%9B%BF+awk&ie=utf-8&oe=utf-8">https://www.google.com/search?q=%E4%BB%A3%E6%9B%BF+awk&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://www.v2ex.com/t/160899">https://www.v2ex.com/t/160899</a>
</li>
</ul>
<p>
q（python的sql工具）
</p>

<p>
总结：
</p>
<ul class="org-ul">
<li>grep筛选数据。
</li>
<li>sed格式化数据为表。
</li>
<li>awk计算数据，类似sql。
</li>
<li>bash控制。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-84" class="outline-3">
<h3 id="sec-1-84"><span class="section-number-3">1.84</span> <span class="done DONE">DONE</span> 如何linux ping输出显示域名而不是ip？</h3>
<div class="outline-text-3" id="text-1-84">
<p>
？开发pingt脚本，查看域名知道ss服务器国家。
</p>

<pre class="example">
domain=jp01-22.ssv7.net; ping $domain  | sed -E "s/(.*\()(.*)(\).*)/\1${domain}\3/g"
</pre>
<p>
注意：这个案例后面接上重定向，会阻塞。
</p>
</div>
</div>
<div id="outline-container-sec-1-85" class="outline-3">
<h3 id="sec-1-85"><span class="section-number-3">1.85</span> <span class="done DONE">DONE</span> 如何awk设置分隔符？</h3>
<div class="outline-text-3" id="text-1-85">
<p>
？开发pingt脚本，sed处理后的数据分隔符为\t。
</p>

<ul class="org-ul">
<li>鸟哥的Linux私房菜 基础学习篇 3ed-鸟哥 p365
</li>
</ul>

<pre class="example">
printf "1 2"| awk 'BEGIN {FS=" "}{printf "%s\n", $1}'
</pre>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/gawk/manual/gawk.html">https://www.gnu.org/software/gawk/manual/gawk.html</a>
</li>
<li><a href="https://www.gnu.org/software/gawk/manual/gawk.html#BEGIN_002fEND">https://www.gnu.org/software/gawk/manual/gawk.html#BEGIN_002fEND</a>
</li>
</ul>
<p>
7.1.4 The BEGIN and END Special Patterns 
</p>
<p class="verse">
A BEGIN rule is executed once only, before the first input record is read. Likewise, an END rule is executed once only, after all the input is read.<br  />
</p>
<pre class="example">
awk '  
BEGIN { print "Analysis of \"li\"" }
/li/  { ++n }
END   { print "\"li\" appears in", n, "records." }' &lt;&lt;end
1
li
3
end
</pre>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/gawk/manual/gawk.html#Command-Line-Field-Separator">https://www.gnu.org/software/gawk/manual/gawk.html#Command-Line-Field-Separator</a>
</li>
</ul>
<p>
4.5 Specifying How Fields Are Separated
</p>
<pre class="example">
awk 'BEGIN { FS = "," } ; { print $2 }' &lt;&lt;&lt;'John Q. Smith, 29 Oak St., Walamazoo, MI 42139'
</pre>
<p>
4.5.4 Setting FS from the Command Line
</p>
<pre class="example">
awk -F, 'program' input-files #
</pre>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/gawk/manual/gawk.html#Basic-Printf">https://www.gnu.org/software/gawk/manual/gawk.html#Basic-Printf</a>
</li>
</ul>
<p>
5.5.1 printf
</p>
</div>
</div>

<div id="outline-container-sec-1-86" class="outline-3">
<h3 id="sec-1-86"><span class="section-number-3">1.86</span> 如何linux查看后台进程？</h3>
<div class="outline-text-3" id="text-1-86">
<p>
？中止ping进程。
</p>
</div>
</div>
<div id="outline-container-sec-1-87" class="outline-3">
<h3 id="sec-1-87"><span class="section-number-3">1.87</span> 如何bash for变量标准输入stdin的内容？</h3>
<div class="outline-text-3" id="text-1-87">
<p>
？开发pingt脚本，遍历ip。
</p>
</div>
</div>
<div id="outline-container-sec-1-88" class="outline-3">
<h3 id="sec-1-88"><span class="section-number-3">1.88</span> <span class="done DONE">DONE</span> 如何判断bash的变量是数组或非数组？</h3>
<div class="outline-text-3" id="text-1-88">
<p>
？开发pingt，从pipe读取数据，用于for循环读取。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=bash+how+to+know+array+var">https://www.google.com/search?q=bash+how+to+know+array+var</a>
</li>
<li><a href="https://stackoverflow.com/questions/14525296/bash-check-if-variable-is-array">https://stackoverflow.com/questions/14525296/bash-check-if-variable-is-array</a>
</li>
</ul>
<pre class="example">
declare -p variable-name 2&gt; /dev/null | grep -q '^declare \-a'
</pre>
<p>
实际上判断bash变量属性是否是数组没有意义，因为for循环遍历变量，不检查变量是数组还是非数组。参考 <a href="https://stackoverflow.com/questions/44838045/what-is-the-difference-between-a-non-array-var-and-an-array-var-in-bash">https://stackoverflow.com/questions/44838045/what-is-the-difference-between-a-non-array-var-and-an-array-var-in-bash</a>
</p>

<p>
以下经验信息可以参考，但是对题目意义不大。
</p>


<ul class="org-ul">
<li><a href="https://www.google.com/search?q=bash+array+length&ie=utf-8&oe=utf-8">https://www.google.com/search?q=bash+array+length&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://unix.stackexchange.com/questions/193039/how-to-count-the-length-of-an-array-defined-in-bash">https://unix.stackexchange.com/questions/193039/how-to-count-the-length-of-an-array-defined-in-bash</a>
</li>
</ul>
<p>
${#array[@]} ${!array[@]}
</p>
<pre class="example">
#!/bin/bash

array=( item1 item2 item3 )
for index in ${!array[@]}; do
    echo $index/${#array[@]}
done
</pre>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/bash/manual/bash.html#Arrays">https://www.gnu.org/software/bash/manual/bash.html#Arrays</a>
</li>
</ul>
<p class="verse">
${#name[subscript]} expands to the length of ${name[subscript]}.<br  />
数组长度len<br  />
<br  />
${!name[@]} and ${!name[*]} expand to the indices assigned in array variable name.<br  />
替换为0 1 2&#x2026;<br  />
</p>

<p>
NOTE：变量也能当数组使用
</p>
<pre class="example">
a=aa
printf "a len: ${#a[*]}\n"
for i in ${a[*]}
do
	echo $i
done

a=(aaa)
printf "a len: ${#a[*]}\n"
for i in ${a[*]}
do
	echo $i
done
</pre>
</div>
</div>

<div id="outline-container-sec-1-89" class="outline-3">
<h3 id="sec-1-89"><span class="section-number-3">1.89</span> <span class="done DONE">DONE</span> 什么是bash中数组变量和非数组变量的区别？</h3>
<div class="outline-text-3" id="text-1-89">
<p>
？判断bash变量是否是数组。
</p>

<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/44838045/what-is-the-difference-between-a-non-array-var-and-an-array-var-in-bash">https://stackoverflow.com/questions/44838045/what-is-the-difference-between-a-non-array-var-and-an-array-var-in-bash</a>
</li>
</ul>
<p>
数组变量拥有attribute（属性）
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=bash+how+to+use+declare&ie=utf-8&oe=utf-8">https://www.google.com/search?q=bash+how+to+use+declare&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://unix.stackexchange.com/questions/254367/in-bash-script-whats-the-different-between-declare-and-a-normal-variable">https://unix.stackexchange.com/questions/254367/in-bash-script-whats-the-different-between-declare-and-a-normal-variable</a>
</li>
</ul>
<p>
declare赋予变量属性，例如declare -r。  
</p>
</div>
</div>

<div id="outline-container-sec-1-90" class="outline-3">
<h3 id="sec-1-90"><span class="section-number-3">1.90</span> <span class="done DONE">DONE</span> 如何解决emacs执行linux命令不输出结果，"Shell command succeeded with no output"？</h3>
<div class="outline-text-3" id="text-1-90">
<p>
？测试declare -p的脚本（判断数组）。
</p>

<p>
自己的错误，-p后没有加变量名v
</p>
<pre class="example">
#!/usr/bin/env bash

v=()
declare -p # 需要变量名，所以这里是错误的。
</pre>
</div>
</div>
<div id="outline-container-sec-1-91" class="outline-3">
<h3 id="sec-1-91"><span class="section-number-3">1.91</span> 如何bash -c使用pipe管道？</h3>
<div class="outline-text-3" id="text-1-91">
<p>
？测试mapfile脚本（没有权限）。
</p>
</div>
</div>

<div id="outline-container-sec-1-92" class="outline-3">
<h3 id="sec-1-92"><span class="section-number-3">1.92</span> <span class="done DONE">DONE</span> 什么是mapfile(readarray)和mapfile -t的区别？</h3>
<div class="outline-text-3" id="text-1-92">
<p>
？开发pingt脚本。
</p>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/bash/manual/html_node/Bash-Builtins.html">https://www.gnu.org/software/bash/manual/html_node/Bash-Builtins.html</a>  
</li>
</ul>

<pre class="example">
readarray -t v &lt;/dev/stdin

for i in "${v[@]}"
do
	printf "$i\n"
done
</pre>

<p>
printf "1\n2 3\n" | t.sh | od -c
</p>
<pre class="example">
0000000   1  \n   2       3  \n 
0000006
</pre>

<pre class="example">
readarray v &lt;/dev/stdin

for i in "${v[@]}"
do
	printf "$i\n"
done
</pre>

<p>
printf "1\n2 3\n" | t.sh | od -c
</p>
<pre class="example">
0000000   1  \n  \n   2       3  \n  \n     
0000010
# 8进制，是8个字符
</pre>
</div>
</div>
<div id="outline-container-sec-1-93" class="outline-3">
<h3 id="sec-1-93"><span class="section-number-3">1.93</span> <span class="done DONE">DONE</span> 什么是bash中数组${name[*]}和"${name[@]}"的区别？</h3>
<div class="outline-text-3" id="text-1-93">
<p>
？开发pingt脚本，使用从stdin读取的数组。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=bash+array+at+asterisk&ie=utf-8&oe=utf-8">https://www.google.com/search?q=bash+array+at+asterisk&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://stackoverflow.com/questions/3348443/a-confusion-about-array-versus-array-in-the-context-of-a-bash-comple">https://stackoverflow.com/questions/3348443/a-confusion-about-array-versus-array-in-the-context-of-a-bash-comple</a>
</li>
</ul>

<pre class="example">
echo "with quotes around myarray[*]"
for x in "${myarray[*]}"; do
        echo "ARG[*]: '$x'"
done

echo "with quotes around myarray[@]"
for x in "${myarray[@]}"; do
        echo "ARG[@]: '$x'"
done

echo "without quotes around myarray[*]"
for x in ${myarray[*]}; do
        echo "ARG[*]: '$x'"
done

echo "without quotes around myarray[@]"
for x in ${myarray[@]}; do
        echo "ARG[@]: '$x'"
done
</pre>

<p>
输出
</p>
<pre class="example">
with quotes around myarray[*]
ARG[*]: 'one two three four'
with quotes around myarray[@]
ARG[@]: 'one'
ARG[@]: 'two'
ARG[@]: 'three four'
without quotes around myarray[*]
ARG[*]: 'one'
ARG[*]: 'two'
ARG[*]: 'three'
ARG[*]: 'four'
without quotes around myarray[@]
ARG[@]: 'one'
ARG[@]: 'two'
ARG[@]: 'three'
ARG[@]: 'four'
</pre>
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/bash/manual/bash.html#Arrays">https://www.gnu.org/software/bash/manual/bash.html#Arrays</a>
</li>
</ul>
</div>
</div>
