blog.org
** 如何bash cat here doc使用pipe传递结果？
** 如何emacs dired快速跳转指定行？
？开发pingt脚本。

** DONE 如何使用shunit2？
   CLOSED: [2017-06-30 Fri 00:11]
？开发pingt脚本。

- https://github.com/kward/shunit2

#+BEGIN_SRC  
git clone https://github.com/kward/shunit2.git
cd shunit2/source/2.1/examples

# 测试一个
./equality_test.sh
# 测试所有
ls *.sh| xargs -n1 -i bash {}
#+END_SRC

** DONE 什么是bash的单元测试框架？
   CLOSED: [2017-06-30 Fri 00:01]
？开发pingt脚本。

- 驱动测试开发-Beck
xUnit p93

- https://www.google.com/search?q=xunit
- https://en.wikipedia.org/wiki/XUnit
- https://en.wikipedia.org/wiki/List_of_unit_testing_frameworks

- https://www.google.com/search?q=bash+xunit&ie=utf-8&oe=utf-8
- https://stackoverflow.com/questions/971945/unit-testing-for-shell-scripts
shunit2

** DONE 如何vimp处理编写映射脚本时的冒号:？
   CLOSED: [2017-06-29 Thu 20:39]
？设置firefox的图片显示。

- https://www.google.com/search?q=vimperator+script+tutorial&ie=utf-8&oe=utf-8
- https://en.wikipedia.org/wiki/Vimperator
Vimscript

- http://vimdoc.sourceforge.net/htmldoc/help.html
- http://vimdoc.sourceforge.net/htmldoc/usr_41.html
- *41.11*	Writing a plugin
  
- https://www.google.com/search?q=vim+script+without+colon&ie=utf-8&oe=utf-8
- https://stackoverflow.com/questions/14051712/why-some-commands-in-vim-require-a-colon-while-some-dont 
#+BEGIN_SRC  
Best I can find is :help vimrc: "A file that contains initialization commands is called a "vimrc" file. Each line in a vimrc file is executed as an Ex command line." Note the Ex command, that implies that the normal mode : command to enter Ex mode is optional.
#+END_SRC

结论：脚本可以使用也可以不使用。

** DONE 如何vimp映射leader key快捷键？
   CLOSED: [2017-06-29 Thu 20:33]
？设置firefox的图片显示。

liberator://help/all
- 11 Key mappings, abbreviations, and user-defined commands
- 11.1.4 Special characters
  
command line模式
#+BEGIN_SRC  
:map \h :echo "Hello"<CR>
#+END_SRC

脚本模式
#+BEGIN_SRC  
nnoremap <leader>p0 :set! permissions.default.image=2<CR>
nnoremap <leader>pp :set! permissions.default.image=1<CR>
#+END_SRC
** DONE 如何vimp设置firefox的option选项？
   CLOSED: [2017-06-29 Thu 20:39]
？设置firefox的图片显示。

liberator://help/all
- 7.2 Setting Firefox options
  
command line模式
#+BEGIN_SRC  
" 开启图片
:set! permissions.default.image=1
#+END_SRC

- http://vimdoc.sourceforge.net/htmldoc/help.html
- http://vimdoc.sourceforge.net/htmldoc/usr_20.html
Command line

** DONE 如何vimp映射按键？
   CLOSED: [2017-06-29 Thu 19:07]
？设置=为缩放增加
   
liberator://help/all#:map-commands
- 4.4 Zooming
- 11 Key mappings, abbreviations, and user-defined commands
  
#+BEGIN_SRC  
:nnoremap = zi
#+END_SRC
** DONE 如何vimp设置firefox的缩放比例为150%？
   CLOSED: [2017-06-29 Thu 18:36]
？看django、flask的manual。

- liberator://help/all#zooming
keywords: zoom
 
单个tab
#+BEGIN_SRC  
:zoom $percent_num
#+END_SRC

- https://www.google.com/#q=firefox+set+default+zoom+level
- https://support.mozilla.org/en-US/questions/963759
  
所有tab，vimp代码
#+BEGIN_SRC  
:set! layout.css.devPixelsPerPx=1.5
#+END_SRC
** DONE 如何使用emacs org的字段引用？
   CLOSED: [2017-06-29 Thu 00:18]
？引用英语语法解释。

- https://www.google.com/search?q=org+quote&ie=utf-8&oe=utf-8
- http://orgmode.org/manual/Paragraphs.html

** DONE 如何markdown使用url超链接引用？
   CLOSED: [2017-06-28 Wed 22:34]
？回答statckoverflow引用manual。https://stackoverflow.com/questions/13363267/how-to-remove-footer-details-in-org-mode-html-export

- https://www.google.com/search?q=official+markdown+syntax
- https://daringfireball.net/projects/markdown/syntax
- https://daringfireball.net/projects/markdown/syntax#link
#+BEGIN_SRC  
[This link](http://example.net/) has no title attribute.
#+END_SRC

stackoverflow comment的help
- https://stackoverflow.com/editing-help#comment-formatting

** DONE 如何emacs org导出html，取消显示作者？
   CLOSED: [2017-06-28 Wed 22:34]
？取消blog.org导出的html的作者。
- https://www.google.com/search?q=org+mode+export+without+author&ie=utf-8&oe=utf-8
- https://stackoverflow.com/questions/13363267/how-to-remove-footer-details-in-org-mode-html-export
- http://orgmode.org/manual/Publishing-options.html
#+BEGIN_SRC  
(setq org-export-with-author nil)
#+END_SRC


** 如何使用marmalade或melpa安装emacs插件？
？安装smex。

https://github.com/nonsequitur/smex
** 什么是marmalade和melpa的区别？
？安装smex。

- https://www.google.com/search?q=mamarlade+melpa+difference&ie=utf-8&oe=utf-8
- https://emacs.stackexchange.com/questions/268/what-are-the-practical-differences-between-the-various-emacs-package-repositorie


