blog.html
<div id="outline-container-sec-1-94" class="outline-3">
<h3 id="sec-1-94"><span class="section-number-3">1.94</span> 如何bash cat here doc使用pipe传递结果？</h3>
</div>
<div id="outline-container-sec-1-95" class="outline-3">
<h3 id="sec-1-95"><span class="section-number-3">1.95</span> 如何emacs dired快速跳转指定行？</h3>
<div class="outline-text-3" id="text-1-95">
<p>
？开发pingt脚本。
</p>
</div>
</div>

<div id="outline-container-sec-1-96" class="outline-3">
<h3 id="sec-1-96"><span class="section-number-3">1.96</span> <span class="done DONE">DONE</span> 如何使用shunit2？</h3>
<div class="outline-text-3" id="text-1-96">
<p>
？开发pingt脚本。
</p>

<ul class="org-ul">
<li><a href="https://github.com/kward/shunit2">https://github.com/kward/shunit2</a>
</li>
</ul>

<pre class="example">
git clone https://github.com/kward/shunit2.git
cd shunit2/source/2.1/examples

# 测试一个
./equality_test.sh
# 测试所有
ls *.sh| xargs -n1 -i bash {}
</pre>
</div>
</div>

<div id="outline-container-sec-1-97" class="outline-3">
<h3 id="sec-1-97"><span class="section-number-3">1.97</span> <span class="done DONE">DONE</span> 什么是bash的单元测试框架？</h3>
<div class="outline-text-3" id="text-1-97">
<p>
？开发pingt脚本。
</p>

<ul class="org-ul">
<li>驱动测试开发-Beck
</li>
</ul>
<p>
xUnit p93
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=xunit">https://www.google.com/search?q=xunit</a>
</li>
<li><a href="https://en.wikipedia.org/wiki/XUnit">https://en.wikipedia.org/wiki/XUnit</a>
</li>
<li><a href="https://en.wikipedia.org/wiki/List_of_unit_testing_frameworks">https://en.wikipedia.org/wiki/List_of_unit_testing_frameworks</a>
</li>

<li><a href="https://www.google.com/search?q=bash+xunit&ie=utf-8&oe=utf-8">https://www.google.com/search?q=bash+xunit&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://stackoverflow.com/questions/971945/unit-testing-for-shell-scripts">https://stackoverflow.com/questions/971945/unit-testing-for-shell-scripts</a>
</li>
</ul>
<p>
shunit2
</p>
</div>
</div>

<div id="outline-container-sec-1-98" class="outline-3">
<h3 id="sec-1-98"><span class="section-number-3">1.98</span> <span class="done DONE">DONE</span> 如何vimp处理编写映射脚本时的冒号:？</h3>
<div class="outline-text-3" id="text-1-98">
<p>
？设置firefox的图片显示。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=vimperator+script+tutorial&ie=utf-8&oe=utf-8">https://www.google.com/search?q=vimperator+script+tutorial&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://en.wikipedia.org/wiki/Vimperator">https://en.wikipedia.org/wiki/Vimperator</a>
</li>
</ul>
<p>
Vimscript
</p>

<ul class="org-ul">
<li><a href="http://vimdoc.sourceforge.net/htmldoc/help.html">http://vimdoc.sourceforge.net/htmldoc/help.html</a>
</li>
<li><a href="http://vimdoc.sourceforge.net/htmldoc/usr_41.html">http://vimdoc.sourceforge.net/htmldoc/usr_41.html</a>
</li>
<li><b>41.11</b> Writing a plugin
</li>

<li><a href="https://www.google.com/search?q=vim+script+without+colon&ie=utf-8&oe=utf-8">https://www.google.com/search?q=vim+script+without+colon&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://stackoverflow.com/questions/14051712/why-some-commands-in-vim-require-a-colon-while-some-dont">https://stackoverflow.com/questions/14051712/why-some-commands-in-vim-require-a-colon-while-some-dont</a> 
</li>
</ul>
<pre class="example">
Best I can find is :help vimrc: "A file that contains initialization commands is called a "vimrc" file. Each line in a vimrc file is executed as an Ex command line." Note the Ex command, that implies that the normal mode : command to enter Ex mode is optional.
</pre>

<p>
结论：脚本可以使用也可以不使用。
</p>
</div>
</div>

<div id="outline-container-sec-1-99" class="outline-3">
<h3 id="sec-1-99"><span class="section-number-3">1.99</span> <span class="done DONE">DONE</span> 如何vimp映射leader key快捷键？</h3>
<div class="outline-text-3" id="text-1-99">
<p>
？设置firefox的图片显示。
</p>

<p>
liberator://help/all
</p>
<ul class="org-ul">
<li>11 Key mappings, abbreviations, and user-defined commands
</li>
<li>11.1.4 Special characters
</li>
</ul>

<p>
command line模式
</p>
<pre class="example">
:map \h :echo "Hello"&lt;CR&gt;
</pre>

<p>
脚本模式
</p>
<pre class="example">
nnoremap &lt;leader&gt;p0 :set! permissions.default.image=2&lt;CR&gt;
nnoremap &lt;leader&gt;pp :set! permissions.default.image=1&lt;CR&gt;
</pre>
</div>
</div>
<div id="outline-container-sec-1-100" class="outline-3">
<h3 id="sec-1-100"><span class="section-number-3">1.100</span> <span class="done DONE">DONE</span> 如何vimp设置firefox的option选项？</h3>
<div class="outline-text-3" id="text-1-100">
<p>
？设置firefox的图片显示。
</p>

<p>
liberator://help/all
</p>
<ul class="org-ul">
<li>7.2 Setting Firefox options
</li>
</ul>

<p>
command line模式
</p>
<pre class="example">
" 开启图片
:set! permissions.default.image=1
</pre>

<ul class="org-ul">
<li><a href="http://vimdoc.sourceforge.net/htmldoc/help.html">http://vimdoc.sourceforge.net/htmldoc/help.html</a>
</li>
<li><a href="http://vimdoc.sourceforge.net/htmldoc/usr_20.html">http://vimdoc.sourceforge.net/htmldoc/usr_20.html</a>
</li>
</ul>
<p>
Command line
</p>
</div>
</div>

<div id="outline-container-sec-1-101" class="outline-3">
<h3 id="sec-1-101"><span class="section-number-3">1.101</span> <span class="done DONE">DONE</span> 如何vimp映射按键？</h3>
<div class="outline-text-3" id="text-1-101">
<p>
？设置=为缩放增加
</p>

<p>
liberator://help/all#:map-commands
</p>
<ul class="org-ul">
<li>4.4 Zooming
</li>
<li>11 Key mappings, abbreviations, and user-defined commands
</li>
</ul>

<pre class="example">
:nnoremap = zi
</pre>
</div>
</div>
<div id="outline-container-sec-1-102" class="outline-3">
<h3 id="sec-1-102"><span class="section-number-3">1.102</span> <span class="done DONE">DONE</span> 如何vimp设置firefox的缩放比例为150%？</h3>
<div class="outline-text-3" id="text-1-102">
<p>
？看django、flask的manual。
</p>

<ul class="org-ul">
<li>liberator://help/all#zooming
</li>
</ul>
<p>
keywords: zoom
</p>

<p>
单个tab
</p>
<pre class="example">
:zoom $percent_num
</pre>

<ul class="org-ul">
<li><a href="https://www.google.com/#q=firefox+set+default+zoom+level">https://www.google.com/#q=firefox+set+default+zoom+level</a>
</li>
<li><a href="https://support.mozilla.org/en-US/questions/963759">https://support.mozilla.org/en-US/questions/963759</a>
</li>
</ul>

<p>
所有tab，vimp代码
</p>
<pre class="example">
:set! layout.css.devPixelsPerPx=1.5
</pre>
</div>
</div>
<div id="outline-container-sec-1-103" class="outline-3">
<h3 id="sec-1-103"><span class="section-number-3">1.103</span> <span class="done DONE">DONE</span> 如何使用emacs org的字段引用？</h3>
<div class="outline-text-3" id="text-1-103">
<p>
？引用英语语法解释。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=org+quote&ie=utf-8&oe=utf-8">https://www.google.com/search?q=org+quote&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="http://orgmode.org/manual/Paragraphs.html">http://orgmode.org/manual/Paragraphs.html</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-104" class="outline-3">
<h3 id="sec-1-104"><span class="section-number-3">1.104</span> <span class="done DONE">DONE</span> 如何markdown使用url超链接引用？</h3>
<div class="outline-text-3" id="text-1-104">
<p>
？回答statckoverflow引用manual。<a href="https://stackoverflow.com/questions/13363267/how-to-remove-footer-details-in-org-mode-html-export">https://stackoverflow.com/questions/13363267/how-to-remove-footer-details-in-org-mode-html-export</a>
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=official+markdown+syntax">https://www.google.com/search?q=official+markdown+syntax</a>
</li>
<li><a href="https://daringfireball.net/projects/markdown/syntax">https://daringfireball.net/projects/markdown/syntax</a>
</li>
<li><a href="https://daringfireball.net/projects/markdown/syntax#link">https://daringfireball.net/projects/markdown/syntax#link</a>
</li>
</ul>
<pre class="example">
[This link](http://example.net/) has no title attribute.
</pre>

<p>
stackoverflow comment的help
</p>
<ul class="org-ul">
<li><a href="https://stackoverflow.com/editing-help#comment-formatting">https://stackoverflow.com/editing-help#comment-formatting</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-105" class="outline-3">
<h3 id="sec-1-105"><span class="section-number-3">1.105</span> <span class="done DONE">DONE</span> 如何emacs org导出html，取消显示作者？</h3>
<div class="outline-text-3" id="text-1-105">
<p>
？取消blog.org导出的html的作者。
</p>
<ul class="org-ul">
<li><a href="https://www.google.com/search?q=org+mode+export+without+author&ie=utf-8&oe=utf-8">https://www.google.com/search?q=org+mode+export+without+author&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://stackoverflow.com/questions/13363267/how-to-remove-footer-details-in-org-mode-html-export">https://stackoverflow.com/questions/13363267/how-to-remove-footer-details-in-org-mode-html-export</a>
</li>
<li><a href="http://orgmode.org/manual/Publishing-options.html">http://orgmode.org/manual/Publishing-options.html</a>
</li>
</ul>
<pre class="example">
(setq org-export-with-author nil)
</pre>
</div>
</div>


<div id="outline-container-sec-1-106" class="outline-3">
<h3 id="sec-1-106"><span class="section-number-3">1.106</span> 如何使用marmalade或melpa安装emacs插件？</h3>
<div class="outline-text-3" id="text-1-106">
<p>
？安装smex。
</p>

<p>
<a href="https://github.com/nonsequitur/smex">https://github.com/nonsequitur/smex</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-107" class="outline-3">
<h3 id="sec-1-107"><span class="section-number-3">1.107</span> 什么是marmalade和melpa的区别？</h3>
<div class="outline-text-3" id="text-1-107">
<p>
？安装smex。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=mamarlade+melpa+difference&ie=utf-8&oe=utf-8">https://www.google.com/search?q=mamarlade+melpa+difference&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://emacs.stackexchange.com/questions/268/what-are-the-practical-differences-between-the-various-emacs-package-repositorie">https://emacs.stackexchange.com/questions/268/what-are-the-practical-differences-between-the-various-emacs-package-repositorie</a>
</li>
</ul>
</div>
</div>
