blog.org
** DONE 如何emacs org使用firefox预览org文件？
   CLOSED: [2017-06-29 Thu 15:38]
？预览ken_el repo的README.org。

- https://www.google.com/search?q=set+org+mode+preview+default+html+export+open
- https://stackoverflow.com/questions/8834633/how-do-i-make-org-mode-open-pdf-files-in-evince
  org-mode-hook
  
#+BEGIN_SRC  
(add-hook 'org-mode-hook
	'(lambda ()
		(setq org-file-apps
			'((auto-mode . emacs)
			("\\.mm\\'" . default)
			("\\.x?html?\\'" . "/usr/bin/firefox %s")
			("\\.pdf\\'" . "evince %s")))))
#+END_SRC

- https://www.google.com/search?q=org+mode+open+html+firefox&ie=utf-8&oe=utf-8
- https://emacs.stackexchange.com/questions/2387/browser-not-opening-when-exporting-html-from-org-mode
  org-file-apps

#+BEGIN_SRC  
(setq org-file-apps
	(quote
		((auto-mode . emacs)
		("\\.mm\\'" . default)
		("\\.x?html?\\'" . "/usr/bin/firefox %s")
		("\\.pdf\\'" . default))))
#+END_SRC
  

** DONE 如何bash转换url后缀为文件名？
   CLOSED: [2017-06-27 Tue 20:46]
？安装emacs color-theme。

- https://www.google.com/search?q=bash+convert+url+filename
- https://stackoverflow.com/questions/1199613/extract-filename-and-path-from-url-in-bash-script
echo ${FILE##/*/} # ==> prog.c
https://www.gnu.org/software/bash/manual/bash.html#Shell-Parameter-Expansion
#+BEGIN_SRC  
url="http://download.savannah.nongnu.org/releases/color-theme/color-theme-6.6.0.tar.gz"
echo "${url##http*/}"
#+END_SRC

** DONE 如何linux tar指定解压目录？
   CLOSED: [2017-06-27 Tue 19:50]
？安装emacs color-theme。

m-! man tar
#+BEGIN_SRC  
-C
#+END_SRC
** DONE 什么是emacs命令load和require的区别？
   CLOSED: [2017-06-27 Tue 19:29]
？用于配置emacs的插件。

- https://www.google.com/search?q=emacs+load+require&ie=utf-8&oe=utf-8
- https://emacs.stackexchange.com/questions/364/when-should-i-use-autoload-instead-of-require

- https://www.google.com/search?q=emacs+require+load+区别&ie=utf-8&oe=utf-8
- http://forum.ubuntu.org.cn/viewtopic.php?f=68&t=310023
#+BEGIN_SRC  
如果el文件中有，provide XXX,那么可以require XXX就可以加载了，否则，就要直接用load来加载文件。
#+END_SRC

** 如何判断英语which修饰的词语？
？学习emacs load require的区别。

http://ergoemacs.org/emacs/elisp_library_system.html
#+BEGIN_SRC  
For example, the command comment-dwim is defined in newcomment.el, which is a library of functions.
#+END_SRC

** 什么是emacs的默认插件目录？
？安装

https://www.gnu.org/software/emacs/manual/html_node/emacs/index.html

** 如何安装proxychains-ng？
？加速git clone。

** DONE 如何git添加github远程仓库链接地址到本地仓库？
   CLOSED: [2017-06-27 Tue 15:35]
？push本地仓库到github仓库（el脚本）

github新建repo后有提示

- https://git-scm.com/book/en/v2
- https://git-scm.com/book/en/v2/Git-Basics-Working-with-Remotes
#+BEGIN_SRC  
git remote add origin $repo_url
#+END_SRC
** DONE 如何emacs org查看代码块支持的语言种类？
   CLOSED: [2017-06-27 Tue 15:17]
？编写yas日志，使用elisp配置yas。

https://www.google.com/search?q=org+manual&ie=utf-8&oe=utf-8
http://orgmode.org/manual/index.html#Top
http://orgmode.org/manual/Working-With-Source-Code.html
http://orgmode.org/manual/Languages.html#Languages
#+BEGIN_SRC  
Org supports the following languages for the ‘src’ code blocks:

Language 	Identifier 	Language 	Identifier
Asymptote 	asymptote 	Awk 	awk
C 	C 	C++ 	C++
Clojure 	clojure 	CSS 	css
D 	d 	ditaa 	ditaa
Graphviz 	dot 	Emacs Calc 	calc
Emacs Lisp 	emacs-lisp 	Fortran 	fortran
gnuplot 	gnuplot 	Haskell 	haskell
Java 	java 	Javascript 	js
LaTeX 	latex 	Ledger 	ledger
Lisp 	lisp 	Lilypond 	lilypond
Lua 	lua 	MATLAB 	matlab
Mscgen 	mscgen 	Objective Caml 	ocaml
Octave 	octave 	Org mode 	org
Oz 	oz 	Perl 	perl
Plantuml 	plantuml 	Processing.js 	processing
Python 	python 	R 	R
Ruby 	ruby 	Sass 	sass
Scheme 	scheme 	GNU Screen 	screen
Sed 	sed 	shell 	sh
SQL 	sql 	SQLite 	sqlite 

#+END_SRC
** DONE 什么是emacs org org-sparse-tree函数源代码中#含义？
   CLOSED: [2017-06-27 Tue 12:09]

https://www.google.com/search?q=sharp+emacs+lisp+mean&ie=utf-8&oe=utf-8
https://emacs.stackexchange.com/questions/3595/when-to-sharp-quote-a-lambda-expression
Once upon a time, the sharp quote was necessary for lambdas, now that's no longer the case.


** DONE 如何emacs lisp导入el文件？
   CLOSED: [2017-06-27 Tue 11:33]
？研发emacs插件。

https://www.google.com/search?q=emacs+import+el+file&ie=utf-8&oe=utf-8
https://stackoverflow.com/questions/7252793/importing-files-in-emacs-lisp-emacs-configuration-file-in-the-same-directory

https://www.gnu.org/software/emacs/manual/html_node/emacs/index.html#Top
https://www.gnu.org/software/emacs/manual/html_node/emacs/Building.html#Building
https://www.gnu.org/software/emacs/manual/html_node/emacs/Lisp-Libraries.html
#+BEGIN_SRC  
(load-file "/el/path")
#+END_SRC
** DONE 如何定义emacs函数？
   CLOSED: [2017-06-27 Tue 11:19]
？学习调用org函数。

https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html
https://www.gnu.org/software/emacs/manual/html_node/eintr/defun.html#defun
#+BEGIN_SRC  
(defun multiply-by-seven (number)
"Multiply NUMBER by seven."
(* 7 number))

m-: (multiply-by-seven 2) ; 需要输入小括号parentheses。
#+END_SRC
