blog.html


<div id="outline-container-sec-1-108" class="outline-3">
<h3 id="sec-1-108"><span class="section-number-3">1.108</span> <span class="done DONE">DONE</span> 如何emacs org使用firefox预览org文件？</h3>
<div class="outline-text-3" id="text-1-108">
<p>
？预览ken<sub>el</sub> repo的README.org。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=set+org+mode+preview+default+html+export+open">https://www.google.com/search?q=set+org+mode+preview+default+html+export+open</a>
</li>
<li><a href="https://stackoverflow.com/questions/8834633/how-do-i-make-org-mode-open-pdf-files-in-evince">https://stackoverflow.com/questions/8834633/how-do-i-make-org-mode-open-pdf-files-in-evince</a>
  org-mode-hook
</li>
</ul>

<pre class="example">
(add-hook 'org-mode-hook
	'(lambda ()
		(setq org-file-apps
			'((auto-mode . emacs)
			("\\.mm\\'" . default)
			("\\.x?html?\\'" . "/usr/bin/firefox %s")
			("\\.pdf\\'" . "evince %s")))))
</pre>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=org+mode+open+html+firefox&ie=utf-8&oe=utf-8">https://www.google.com/search?q=org+mode+open+html+firefox&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://emacs.stackexchange.com/questions/2387/browser-not-opening-when-exporting-html-from-org-mode">https://emacs.stackexchange.com/questions/2387/browser-not-opening-when-exporting-html-from-org-mode</a>
  org-file-apps
</li>
</ul>

<pre class="example">
(setq org-file-apps
	(quote
		((auto-mode . emacs)
		("\\.mm\\'" . default)
		("\\.x?html?\\'" . "/usr/bin/firefox %s")
		("\\.pdf\\'" . default))))
</pre>
</div>
</div>


<div id="outline-container-sec-1-109" class="outline-3">
<h3 id="sec-1-109"><span class="section-number-3">1.109</span> <span class="done DONE">DONE</span> 如何bash转换url后缀为文件名？</h3>
<div class="outline-text-3" id="text-1-109">
<p>
？安装emacs color-theme。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=bash+convert+url+filename">https://www.google.com/search?q=bash+convert+url+filename</a>
</li>
<li><a href="https://stackoverflow.com/questions/1199613/extract-filename-and-path-from-url-in-bash-script">https://stackoverflow.com/questions/1199613/extract-filename-and-path-from-url-in-bash-script</a>
</li>
</ul>
<p>
echo ${FILE##/*/} # ==&gt; prog.c
<a href="https://www.gnu.org/software/bash/manual/bash.html#Shell-Parameter-Expansion">https://www.gnu.org/software/bash/manual/bash.html#Shell-Parameter-Expansion</a>
</p>
<pre class="example">
url="http://download.savannah.nongnu.org/releases/color-theme/color-theme-6.6.0.tar.gz"
echo "${url##http*/}"
</pre>
</div>
</div>

<div id="outline-container-sec-1-110" class="outline-3">
<h3 id="sec-1-110"><span class="section-number-3">1.110</span> <span class="done DONE">DONE</span> 如何linux tar指定解压目录？</h3>
<div class="outline-text-3" id="text-1-110">
<p>
？安装emacs color-theme。
</p>

<p>
m-! man tar
</p>
<pre class="example">
-C
</pre>
</div>
</div>
<div id="outline-container-sec-1-111" class="outline-3">
<h3 id="sec-1-111"><span class="section-number-3">1.111</span> <span class="done DONE">DONE</span> 什么是emacs命令load和require的区别？</h3>
<div class="outline-text-3" id="text-1-111">
<p>
？用于配置emacs的插件。
</p>

<ul class="org-ul">
<li><a href="https://www.google.com/search?q=emacs+load+require&ie=utf-8&oe=utf-8">https://www.google.com/search?q=emacs+load+require&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="https://emacs.stackexchange.com/questions/364/when-should-i-use-autoload-instead-of-require">https://emacs.stackexchange.com/questions/364/when-should-i-use-autoload-instead-of-require</a>
</li>

<li><a href="https://www.google.com/search?q=emacs+require+load+%E5%8C%BA%E5%88%AB&ie=utf-8&oe=utf-8">https://www.google.com/search?q=emacs+require+load+%E5%8C%BA%E5%88%AB&ie=utf-8&oe=utf-8</a>
</li>
<li><a href="http://forum.ubuntu.org.cn/viewtopic.php?f=68&t=310023">http://forum.ubuntu.org.cn/viewtopic.php?f=68&t=310023</a>
</li>
</ul>
<pre class="example">
如果el文件中有，provide XXX,那么可以require XXX就可以加载了，否则，就要直接用load来加载文件。
</pre>
</div>
</div>

<div id="outline-container-sec-1-112" class="outline-3">
<h3 id="sec-1-112"><span class="section-number-3">1.112</span> 如何判断英语which修饰的词语？</h3>
<div class="outline-text-3" id="text-1-112">
<p>
？学习emacs load require的区别。
</p>

<p>
<a href="http://ergoemacs.org/emacs/elisp_library_system.html">http://ergoemacs.org/emacs/elisp_library_system.html</a>
</p>
<pre class="example">
For example, the command comment-dwim is defined in newcomment.el, which is a library of functions.
</pre>
</div>
</div>

<div id="outline-container-sec-1-113" class="outline-3">
<h3 id="sec-1-113"><span class="section-number-3">1.113</span> 什么是emacs的默认插件目录？</h3>
<div class="outline-text-3" id="text-1-113">
<p>
？安装
</p>

<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/index.html">https://www.gnu.org/software/emacs/manual/html_node/emacs/index.html</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-114" class="outline-3">
<h3 id="sec-1-114"><span class="section-number-3">1.114</span> 如何安装proxychains-ng？</h3>
<div class="outline-text-3" id="text-1-114">
<p>
？加速git clone。
</p>
</div>
</div>

<div id="outline-container-sec-1-115" class="outline-3">
<h3 id="sec-1-115"><span class="section-number-3">1.115</span> <span class="done DONE">DONE</span> 如何git添加github远程仓库链接地址到本地仓库？</h3>
<div class="outline-text-3" id="text-1-115">
<p>
？push本地仓库到github仓库（el脚本）
</p>

<p>
github新建repo后有提示
</p>

<ul class="org-ul">
<li><a href="https://git-scm.com/book/en/v2">https://git-scm.com/book/en/v2</a>
</li>
<li><a href="https://git-scm.com/book/en/v2/Git-Basics-Working-with-Remotes">https://git-scm.com/book/en/v2/Git-Basics-Working-with-Remotes</a>
</li>
</ul>
<pre class="example">
git remote add origin $repo_url
</pre>
</div>
</div>
<div id="outline-container-sec-1-116" class="outline-3">
<h3 id="sec-1-116"><span class="section-number-3">1.116</span> <span class="done DONE">DONE</span> 如何emacs org查看代码块支持的语言种类？</h3>
<div class="outline-text-3" id="text-1-116">
<p>
？编写yas日志，使用elisp配置yas。
</p>

<p>
<a href="https://www.google.com/search?q=org+manual&ie=utf-8&oe=utf-8">https://www.google.com/search?q=org+manual&ie=utf-8&oe=utf-8</a>
<a href="http://orgmode.org/manual/index.html#Top">http://orgmode.org/manual/index.html#Top</a>
<a href="http://orgmode.org/manual/Working-With-Source-Code.html">http://orgmode.org/manual/Working-With-Source-Code.html</a>
<a href="http://orgmode.org/manual/Languages.html#Languages">http://orgmode.org/manual/Languages.html#Languages</a>
</p>
<pre class="example">
Org supports the following languages for the ‘src’ code blocks:

Language 	Identifier 	Language 	Identifier
Asymptote 	asymptote 	Awk 	awk
C 	C 	C++ 	C++
Clojure 	clojure 	CSS 	css
D 	d 	ditaa 	ditaa
Graphviz 	dot 	Emacs Calc 	calc
Emacs Lisp 	emacs-lisp 	Fortran 	fortran
gnuplot 	gnuplot 	Haskell 	haskell
Java 	java 	Javascript 	js
LaTeX 	latex 	Ledger 	ledger
Lisp 	lisp 	Lilypond 	lilypond
Lua 	lua 	MATLAB 	matlab
Mscgen 	mscgen 	Objective Caml 	ocaml
Octave 	octave 	Org mode 	org
Oz 	oz 	Perl 	perl
Plantuml 	plantuml 	Processing.js 	processing
Python 	python 	R 	R
Ruby 	ruby 	Sass 	sass
Scheme 	scheme 	GNU Screen 	screen
Sed 	sed 	shell 	sh
SQL 	sql 	SQLite 	sqlite
</pre>
</div>
</div>
<div id="outline-container-sec-1-117" class="outline-3">
<h3 id="sec-1-117"><span class="section-number-3">1.117</span> <span class="done DONE">DONE</span> 什么是emacs org org-sparse-tree函数源代码中#含义？</h3>
<div class="outline-text-3" id="text-1-117">
<p>
<a href="https://www.google.com/search?q=sharp+emacs+lisp+mean&ie=utf-8&oe=utf-8">https://www.google.com/search?q=sharp+emacs+lisp+mean&ie=utf-8&oe=utf-8</a>
<a href="https://emacs.stackexchange.com/questions/3595/when-to-sharp-quote-a-lambda-expression">https://emacs.stackexchange.com/questions/3595/when-to-sharp-quote-a-lambda-expression</a>
Once upon a time, the sharp quote was necessary for lambdas, now that's no longer the case.
</p>
</div>
</div>


<div id="outline-container-sec-1-118" class="outline-3">
<h3 id="sec-1-118"><span class="section-number-3">1.118</span> <span class="done DONE">DONE</span> 如何emacs lisp导入el文件？</h3>
<div class="outline-text-3" id="text-1-118">
<p>
？研发emacs插件。
</p>

<p>
<a href="https://www.google.com/search?q=emacs+import+el+file&ie=utf-8&oe=utf-8">https://www.google.com/search?q=emacs+import+el+file&ie=utf-8&oe=utf-8</a>
<a href="https://stackoverflow.com/questions/7252793/importing-files-in-emacs-lisp-emacs-configuration-file-in-the-same-directory">https://stackoverflow.com/questions/7252793/importing-files-in-emacs-lisp-emacs-configuration-file-in-the-same-directory</a>
</p>

<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/index.html#Top">https://www.gnu.org/software/emacs/manual/html_node/emacs/index.html#Top</a>
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Building.html#Building">https://www.gnu.org/software/emacs/manual/html_node/emacs/Building.html#Building</a>
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Lisp-Libraries.html">https://www.gnu.org/software/emacs/manual/html_node/emacs/Lisp-Libraries.html</a>
</p>
<pre class="example">
(load-file "/el/path")
</pre>
</div>
</div>
<div id="outline-container-sec-1-119" class="outline-3">
<h3 id="sec-1-119"><span class="section-number-3">1.119</span> <span class="done DONE">DONE</span> 如何定义emacs函数？</h3>
<div class="outline-text-3" id="text-1-119">
<p>
？学习调用org函数。
</p>

<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html">https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html</a>
<a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/defun.html#defun">https://www.gnu.org/software/emacs/manual/html_node/eintr/defun.html#defun</a>
</p>
<pre class="example">
(defun multiply-by-seven (number)
"Multiply NUMBER by seven."
(* 7 number))

m-: (multiply-by-seven 2) ; 需要输入小括号parentheses。
</pre>
</div>
</div>
