blog.org
** DONE 如何定义emacs interactive交互函数？
   CLOSED: [2017-06-27 Tue 11:19]
   

https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html
https://www.gnu.org/software/emacs/manual/html_node/eintr/Interactive-multiply_002dby_002dseven.html#Interactive-multiply_002dby_002dseven

#+BEGIN_SRC  
(defun multiply-by-seven (number)       ; Interactive version.
	"Multiply NUMBER by seven."
	(interactive "p")
	(message "The result is %d" (* 7 number)))

; 无法输入参数number
#+END_SRC

https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html
https://www.gnu.org/software/emacs/manual/html_node/elisp/Command-Loop.html#Command-Loop
https://www.gnu.org/software/emacs/manual/html_node/elisp/Interactive-Codes.html#Interactive-Codes
#+BEGIN_SRC  

(defun multiply-by-seven (number)       ; Interactive version.
	"Multiply NUMBER by seven."
	(interactive "n")
	(message "The result is %d" (* 7 number)))

; 可以输入参数number，修改p为n。
#+END_SRC
** DONE 如何emacs调用interactive交互函数？
   CLOSED: [2017-06-27 Tue 11:06]
？调用org交互函数

https://www.google.com/search?q=emacs+lisp+call+interactive+function
https://emacs.stackexchange.com/questions/5973/how-to-use-interactive-arguments-when-calling-the-command-from-code

https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html
https://www.gnu.org/software/emacs/manual/html_node/elisp/Functions.html#Functions
https://www.gnu.org/software/emacs/manual/html_node/elisp/Defining-Functions.html#Defining-Functions

case: call-interactively
#+BEGIN_SRC  
(defun foo(str)
  (interactive "s")
  (message str))

(call-interactively 'foo)
#+END_SRC

case: directly
#+BEGIN_SRC  
(defun foo(str)
  (interactive "s")
  (message str)
  (message "inter"))

(foo "hi")
#+END_SRC
** 如何emacs c-h k查看emacs org s-tab 2次的快捷键？
？hack org函数。

** DONE 如何emacs org检索指定时间段的日程？
   CLOSED: [2017-06-27 Tue 09:13] SCHEDULED: <2017-06-27 Tue>
？回顾日程

http://orgmode.org/guide/Document-Structure.html#Document-Structure
http://orgmode.org/guide/Sparse-trees.html#Sparse-trees
#+BEGIN_SRC  
C-c / D
17-6-27
17-6-27 8:00 # 8:0 无效
#+END_SRC


** 什么是fdisk type和mkfs type的区别？
？用于制作u盘安装盘。

https://www.google.com/search?q=fdisk+type+id+difference+mkfs
https://superuser.com/questions/317724/difference-between-file-system-created-by-fdisk-and-file-system-created-by-mkfs
So fdisk isn't really creating a filesystem, it's setting up the hard drive so that a filesystem can be created on it.
https://unix.stackexchange.com/questions/18510/why-do-we-need-to-specify-partition-type-in-fdisk-and-later-again-in-mkfs
The partition type code that fdisk puts in the msdos partition table is only a hint and is pretty much ignored by non Microsoft operating systems.
** DONE 如何解决python报错"You are trying to run the Python 2 version of Beautiful Soup under Python 3."
   CLOSED: [2017-06-26 Mon 16:30]
？运行bs脚本报错。

https://www.google.com/search?q=You+are+trying+to+run+the+Python+2+version+of+Beautiful+Soup+under+Python+3
https://stackoverflow.com/questions/35422243/beautiful-soup-python-installation-not-working
You can reinstall the BeautifulSoup package using pip
#+BEGIN_SRC  
sudo python2 -m pip uninstall beautifulsoup4 
sudo python3 -m pip install beautifulsoup4
#+END_SRC

https://www.google.com/search?q=You+are+trying+to+run+the+Python+2+version+of+Beautiful+Soup+under+Python+3&ie=utf-8&oe=utf-8
** DONE 如何解决运行bs4脚本警告"No parser was explicitly specified"？
   CLOSED: [2017-06-26 Mon 17:51]
？运行bs4脚本。

https://www.google.com/search?q=No+parser+was+explicitly+specified&ie=utf-8&oe=utf-8
https://stackoverflow.com/questions/33511544/how-to-get-rid-of-beautifulsoup-user-warning

修改
#+BEGIN_SRC  
bsObj = BeautifulSoup(html.read())
#+END_SRC
为
#+BEGIN_SRC  
bsObj = BeautifulSoup(html.read(),"lxml")
#+END_SRC
书内容过时。

** 什么是pip？
？安装bs库使用。

https://docs.python.org/3/installing/index.html
** 什么是pip和python version的关系？
？使用pip安装bs4。

https://www.google.com/search?q=pip+version+python
** 如何检索pip使用的默认python version？

https://www.google.com/search?q=pip+tutorial
https://packaging.python.org/tutorials/installing-packages/
** 如何在virtualenv下使用pip install？
？解决安装bs4提示"Requirement already satisfied"

** 如何使用virtualenv？
？避免python版本环境冲突（fedora24的dnf依赖python2，学习使用的python版本是3）。

https://docs.python.org/3/installing/index.html
virtualenv

Python网络数据采集 p6
#+BEGIN_SRC  
# 创建虚拟环境
virtualenv $path

# 激活虚拟环境
source "$path/bin/activate" # shell脚本

# 取消激活虚拟环境
deactivate

#+END_SRC

https://www.google.com/search?q=virtualenv
http://pythonguidecn.readthedocs.io/zh/latest/dev/virtualenvs.html
#+BEGIN_SRC  
virtualenv -p "$python_interpreter_path" "$venv_dir" # /usr/bin/python2.7
#+END_SRC

** DONE 如何检索virtualenv目录的python版本？
   CLOSED: [2017-06-26 Mon 13:22]
？学习爬虫。

https://www.google.com/search?q=how+to+know+virtualenv+python+version
https://stackoverflow.com/questions/1534210/use-different-python-version-with-virtualenv
#+BEGIN_SRC  
# which
which python

# type
type python

# ls -l
ls -l $env/bin
#+END_SRC

https://stackoverflow.com/questions/44753233/what-is-the-right-way-to-know-the-python-version-used-by-virtualenv-directory
#+BEGIN_SRC  
source test_proj/bin/activate
python --version
#+END_SRC

