blog.html
<div id="outline-container-sec-1-120" class="outline-3">
<h3 id="sec-1-120"><span class="section-number-3">1.120</span> <span class="done DONE">DONE</span> 如何定义emacs interactive交互函数？</h3>
<div class="outline-text-3" id="text-1-120">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html">https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html</a>
<a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/Interactive-multiply_002dby_002dseven.html#Interactive-multiply_002dby_002dseven">https://www.gnu.org/software/emacs/manual/html_node/eintr/Interactive-multiply_002dby_002dseven.html#Interactive-multiply_002dby_002dseven</a>
</p>

<pre class="example">
(defun multiply-by-seven (number)       ; Interactive version.
	"Multiply NUMBER by seven."
	(interactive "p")
	(message "The result is %d" (* 7 number)))

; 无法输入参数number
</pre>

<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html">https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html</a>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Command-Loop.html#Command-Loop">https://www.gnu.org/software/emacs/manual/html_node/elisp/Command-Loop.html#Command-Loop</a>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Interactive-Codes.html#Interactive-Codes">https://www.gnu.org/software/emacs/manual/html_node/elisp/Interactive-Codes.html#Interactive-Codes</a>
</p>
<pre class="example">
(defun multiply-by-seven (number)       ; Interactive version.
	"Multiply NUMBER by seven."
	(interactive "n")
	(message "The result is %d" (* 7 number)))

; 可以输入参数number，修改p为n。
</pre>
</div>
</div>
<div id="outline-container-sec-1-121" class="outline-3">
<h3 id="sec-1-121"><span class="section-number-3">1.121</span> <span class="done DONE">DONE</span> 如何emacs调用interactive交互函数？</h3>
<div class="outline-text-3" id="text-1-121">
<p>
？调用org交互函数
</p>

<p>
<a href="https://www.google.com/search?q=emacs+lisp+call+interactive+function">https://www.google.com/search?q=emacs+lisp+call+interactive+function</a>
<a href="https://emacs.stackexchange.com/questions/5973/how-to-use-interactive-arguments-when-calling-the-command-from-code">https://emacs.stackexchange.com/questions/5973/how-to-use-interactive-arguments-when-calling-the-command-from-code</a>
</p>

<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html</a>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Functions.html#Functions">https://www.gnu.org/software/emacs/manual/html_node/elisp/Functions.html#Functions</a>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Defining-Functions.html#Defining-Functions">https://www.gnu.org/software/emacs/manual/html_node/elisp/Defining-Functions.html#Defining-Functions</a>
</p>

<p>
case: call-interactively
</p>
<pre class="example">
(defun foo(str)
  (interactive "s")
  (message str))

(call-interactively 'foo)
</pre>

<p>
case: directly
</p>
<pre class="example">
(defun foo(str)
  (interactive "s")
  (message str)
  (message "inter"))

(foo "hi")
</pre>
</div>
</div>
<div id="outline-container-sec-1-122" class="outline-3">
<h3 id="sec-1-122"><span class="section-number-3">1.122</span> 如何emacs c-h k查看emacs org s-tab 2次的快捷键？</h3>
<div class="outline-text-3" id="text-1-122">
<p>
？hack org函数。
</p>
</div>
</div>

<div id="outline-container-sec-1-123" class="outline-3">
<h3 id="sec-1-123"><span class="section-number-3">1.123</span> <span class="done DONE">DONE</span> 如何emacs org检索指定时间段的日程？</h3>
<div class="outline-text-3" id="text-1-123">
<p>
？回顾日程
</p>

<p>
<a href="http://orgmode.org/guide/Document-Structure.html#Document-Structure">http://orgmode.org/guide/Document-Structure.html#Document-Structure</a>
<a href="http://orgmode.org/guide/Sparse-trees.html#Sparse-trees">http://orgmode.org/guide/Sparse-trees.html#Sparse-trees</a>
</p>
<pre class="example">
C-c / D
17-6-27
17-6-27 8:00 # 8:0 无效
</pre>
</div>
</div>


<div id="outline-container-sec-1-124" class="outline-3">
<h3 id="sec-1-124"><span class="section-number-3">1.124</span> 什么是fdisk type和mkfs type的区别？</h3>
<div class="outline-text-3" id="text-1-124">
<p>
？用于制作u盘安装盘。
</p>

<p>
<a href="https://www.google.com/search?q=fdisk+type+id+difference+mkfs">https://www.google.com/search?q=fdisk+type+id+difference+mkfs</a>
<a href="https://superuser.com/questions/317724/difference-between-file-system-created-by-fdisk-and-file-system-created-by-mkfs">https://superuser.com/questions/317724/difference-between-file-system-created-by-fdisk-and-file-system-created-by-mkfs</a>
So fdisk isn't really creating a filesystem, it's setting up the hard drive so that a filesystem can be created on it.
<a href="https://unix.stackexchange.com/questions/18510/why-do-we-need-to-specify-partition-type-in-fdisk-and-later-again-in-mkfs">https://unix.stackexchange.com/questions/18510/why-do-we-need-to-specify-partition-type-in-fdisk-and-later-again-in-mkfs</a>
The partition type code that fdisk puts in the msdos partition table is only a hint and is pretty much ignored by non Microsoft operating systems.
</p>
</div>
</div>
<div id="outline-container-sec-1-125" class="outline-3">
<h3 id="sec-1-125"><span class="section-number-3">1.125</span> <span class="done DONE">DONE</span> 如何解决python报错"You are trying to run the Python 2 version of Beautiful Soup under Python 3."</h3>
<div class="outline-text-3" id="text-1-125">
<p>
？运行bs脚本报错。
</p>

<p>
<a href="https://www.google.com/search?q=You+are+trying+to+run+the+Python+2+version+of+Beautiful+Soup+under+Python+3">https://www.google.com/search?q=You+are+trying+to+run+the+Python+2+version+of+Beautiful+Soup+under+Python+3</a>
<a href="https://stackoverflow.com/questions/35422243/beautiful-soup-python-installation-not-working">https://stackoverflow.com/questions/35422243/beautiful-soup-python-installation-not-working</a>
You can reinstall the BeautifulSoup package using pip
</p>
<pre class="example">
sudo python2 -m pip uninstall beautifulsoup4 
sudo python3 -m pip install beautifulsoup4
</pre>

<p>
<a href="https://www.google.com/search?q=You+are+trying+to+run+the+Python+2+version+of+Beautiful+Soup+under+Python+3&ie=utf-8&oe=utf-8">https://www.google.com/search?q=You+are+trying+to+run+the+Python+2+version+of+Beautiful+Soup+under+Python+3&ie=utf-8&oe=utf-8</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-126" class="outline-3">
<h3 id="sec-1-126"><span class="section-number-3">1.126</span> <span class="done DONE">DONE</span> 如何解决运行bs4脚本警告"No parser was explicitly specified"？</h3>
<div class="outline-text-3" id="text-1-126">
<p>
？运行bs4脚本。
</p>

<p>
<a href="https://www.google.com/search?q=No+parser+was+explicitly+specified&ie=utf-8&oe=utf-8">https://www.google.com/search?q=No+parser+was+explicitly+specified&ie=utf-8&oe=utf-8</a>
<a href="https://stackoverflow.com/questions/33511544/how-to-get-rid-of-beautifulsoup-user-warning">https://stackoverflow.com/questions/33511544/how-to-get-rid-of-beautifulsoup-user-warning</a>
</p>

<p>
修改
</p>
<pre class="example">
bsObj = BeautifulSoup(html.read())
</pre>
<p>
为
</p>
<pre class="example">
bsObj = BeautifulSoup(html.read(),"lxml")
</pre>
<p>
书内容过时。
</p>
</div>
</div>

<div id="outline-container-sec-1-127" class="outline-3">
<h3 id="sec-1-127"><span class="section-number-3">1.127</span> 什么是pip？</h3>
<div class="outline-text-3" id="text-1-127">
<p>
？安装bs库使用。
</p>

<p>
<a href="https://docs.python.org/3/installing/index.html">https://docs.python.org/3/installing/index.html</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-128" class="outline-3">
<h3 id="sec-1-128"><span class="section-number-3">1.128</span> 什么是pip和python version的关系？</h3>
<div class="outline-text-3" id="text-1-128">
<p>
？使用pip安装bs4。
</p>

<p>
<a href="https://www.google.com/search?q=pip+version+python">https://www.google.com/search?q=pip+version+python</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-129" class="outline-3">
<h3 id="sec-1-129"><span class="section-number-3">1.129</span> 如何检索pip使用的默认python version？</h3>
<div class="outline-text-3" id="text-1-129">
<p>
<a href="https://www.google.com/search?q=pip+tutorial">https://www.google.com/search?q=pip+tutorial</a>
<a href="https://packaging.python.org/tutorials/installing-packages/">https://packaging.python.org/tutorials/installing-packages/</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-130" class="outline-3">
<h3 id="sec-1-130"><span class="section-number-3">1.130</span> 如何在virtualenv下使用pip install？</h3>
<div class="outline-text-3" id="text-1-130">
<p>
？解决安装bs4提示"Requirement already satisfied"
</p>
</div>
</div>

<div id="outline-container-sec-1-131" class="outline-3">
<h3 id="sec-1-131"><span class="section-number-3">1.131</span> 如何使用virtualenv？</h3>
<div class="outline-text-3" id="text-1-131">
<p>
？避免python版本环境冲突（fedora24的dnf依赖python2，学习使用的python版本是3）。
</p>

<p>
<a href="https://docs.python.org/3/installing/index.html">https://docs.python.org/3/installing/index.html</a>
virtualenv
</p>

<p>
Python网络数据采集 p6
</p>
<pre class="example">
# 创建虚拟环境
virtualenv $path

# 激活虚拟环境
source "$path/bin/activate" # shell脚本

# 取消激活虚拟环境
deactivate
</pre>

<p>
<a href="https://www.google.com/search?q=virtualenv">https://www.google.com/search?q=virtualenv</a>
<a href="http://pythonguidecn.readthedocs.io/zh/latest/dev/virtualenvs.html">http://pythonguidecn.readthedocs.io/zh/latest/dev/virtualenvs.html</a>
</p>
<pre class="example">
virtualenv -p "$python_interpreter_path" "$venv_dir" # /usr/bin/python2.7
</pre>
</div>
</div>

<div id="outline-container-sec-1-132" class="outline-3">
<h3 id="sec-1-132"><span class="section-number-3">1.132</span> <span class="done DONE">DONE</span> 如何检索virtualenv目录的python版本？</h3>
<div class="outline-text-3" id="text-1-132">
<p>
？学习爬虫。
</p>

<p>
<a href="https://www.google.com/search?q=how+to+know+virtualenv+python+version">https://www.google.com/search?q=how+to+know+virtualenv+python+version</a>
<a href="https://stackoverflow.com/questions/1534210/use-different-python-version-with-virtualenv">https://stackoverflow.com/questions/1534210/use-different-python-version-with-virtualenv</a>
</p>
<pre class="example">
# which
which python

# type
type python

# ls -l
ls -l $env/bin
</pre>

<p>
<a href="https://stackoverflow.com/questions/44753233/what-is-the-right-way-to-know-the-python-version-used-by-virtualenv-directory">https://stackoverflow.com/questions/44753233/what-is-the-right-way-to-know-the-python-version-used-by-virtualenv-directory</a>
</p>
<pre class="example">
source test_proj/bin/activate
python --version
</pre>
</div>
</div>
