blog.org
** DONE 如何安装python beautifulsoup？
   CLOSED: [2017-06-26 Mon 10:19]
？学习爬虫。

Python网络数据采集 p5
#+BEGIN_SRC  
sudo pip install beautifulsoup4
#+END_SRC

检验
#+BEGIN_SRC  
# 进入python交互程序检验。
from bs4 import BeautifulSoup
#+END_SRC

** DONE 如何使用linux dd制作fedora安装优盘？
   CLOSED: [2017-06-21 Wed 19:53]
？解决ultraiso、poweriso写入优盘无法启动的问题。

http://hongxchen.github.io/2014/07/19/making-fedora-usb-media-with-dd/
很多人在windows下直接用一些工具直接将iso写入U盘或者硬盘，这个是U盘安装windows的方法，在fedora上是不行的，因为fedora的iso其实是分轨镜像，在一个iso镜像里有若干个分区，正确的方法是在Linux或者mac下使用dd来做，windows请下载MinGW。

#+BEGIN_SRC  
iso="/home/yjr/Downloads/Fedora-Workstation-Live-x86_64-24-1.2.iso"
disk="/dev/sdc"

dd if="$iso" of="$disk"
#+END_SRC

adata威刚成功，netac朗科失败

** 如何检索fdisk中l选项的详细信息？
https://www.google.com/search?q=partition+type+partition+table
https://en.wikipedia.org/wiki/Partition_type

** 如何检索笔记本电脑主板是uefi或efi或bios类型？
   
https://www.google.com/search?q=how+to+know+motherboard+uefi+bios
http://www.thewindowsclub.com/check-if-uefi-or-bios
#+BEGIN_SRC  
If your PC supports UEFI, then if you go through your BIOS settings, you will see the Secure Boot option.
#+END_SRC
** 什么是grub2优盘dos gpt分区表区别？ 
** 如何解决linux umount报错"target is busy"？
？解决拔出优盘问题。
** DONE 如何设置软件工程目录（测试）的各目录？
   CLOSED: [2017-06-23 Fri 00:17]
？开发grub2脚本需要使用。

https://www.google.com/search?q=junit+目录+结构&ie=utf-8&oe=utf-8
http://blog.csdn.net/jadyer/article/details/9280581
test是src子目录。

https://www.google.com/search?q=maven+unit+test+hierarchy
https://stackoverflow.com/questions/1540324/java-unit-tests-directory-layout
http://maven.apache.org/guides/introduction/introduction-to-the-standard-directory-layout.html
#+BEGIN_SRC  
module/
  src/
    main/
      java/
    test/
      java/
#+END_SRC

选择apache的目录结构。

** 如何设置emacs shell当前目录为emacs dired当前目录？
？高效率设置emacs shell默认目录。
** 如何解决emacs shell调用bash脚本输入密码为明文？
？保护隐私。
** DONE 什么是yasnippet目录？
   CLOSED: [2017-06-22 Thu 19:35]
？上传到github。

http://joaotavora.github.io/yasnippet/
http://joaotavora.github.io/yasnippet/snippet-organization.html
~/.emacs.d/snippets
** DONE 如何编写软件文档？
   CLOSED: [2017-06-22 Thu 19:21]
？用于相关人员检索参考。

https://en.wikipedia.org/wiki/Software_documentation
https://zh.wikipedia.org/wiki/软件文档
软件工程 9ed
需求工程

#+BEGIN_SRC  
目录结构
引言 Introduce
User
教程 Tutorial
手册 Manual
问题 FAQ
Developer
需求 Requirement
设计 Design
实现&测试 Implement&Test
运维 Maintance

#+END_SRC
** DONE 如何解决linux date +%X不是24小时制？
   CLOSED: [2017-06-22 Thu 18:22]
？用于git commit，默认信息为时间。

https://www.google.com/search?biw=1920&bih=853&q=date++%X+why+pm+am
http://man.linuxde.net/date
#+BEGIN_SRC  
date +"%F %H:%M:%S"
#+END_SRC
** DONE 哪个好，环境变量PATH放在bashrc或bash_profile？
   CLOSED: [2017-06-22 Thu 14:56]
？解决环境变量放置问题，避免部署时，行动产生歧义。

https://www.google.com/search?q=path+bashrc+bash_profile&ie=utf-8&oe=utf-8
https://unix.stackexchange.com/questions/26047/how-to-correctly-add-a-path-to-path
Note that ~/.bash_rc is not read by any program, and ~/.bashrc is the configuration file of interactive instances of bash.

总结：bash_profile更稳定，bashrc更方便（新增export，无需重新登录，新建terminal即可）

** 如何git commit不输入信息message？
？高效率commit。

** 如何解决xargs并行执行时输出顺序混乱？
？解决并行ping时，输出乱序。

https://www.google.com/search?biw=1920&bih=853&q=ping+xargs+顺序
https://stackoverflow.com/questions/14439755/how-to-ping-each-ip-in-a-file
#+BEGIN_SRC  
cat ips | xargs echo ping -c 2
#+END_SRC

https://www.google.com/search?biw=1920&bih=853&q=ping+xargs+并行
https://www.zhihu.com/question/20082099
整个命令用（）套上重定向就行。

** DONE 什么是xargs -i -I的区别？
   CLOSED: [2017-06-22 Thu 12:44]
？解决xargs指定参数位置时，选项-i、-I的理解。

https://www.google.com/search?q=xargs+并行&ie=utf-8&oe=utf-8
https://www.zhihu.com/question/20082099
https://stackoverflow.com/questions/845863/how-to-use-in-an-xargs-command
-I指定参数的位置符号，-i默认使用{}作为参数的位置符号。
#+BEGIN_SRC  
ls -1 | xargs -I{} "grep ABC '{}' > '{}'.out"
#+END_SRC

** DONE 如何xargs指定参数位置？
   CLOSED: [2017-06-22 Thu 12:37]
？用于ping命令指定ip参数位置。

https://www.google.com/search?q=+xargs+specific&ie=utf-8&oe=utf-8
http://www.linuxask.com/questions/how-to-adjust-the-argument-position-in-xargs
#+BEGIN_SRC  
echo "foo" | xargs -i echo {} "bar"
#+END_SRC

