blog.html

<div id="outline-container-sec-1-133" class="outline-3">
<h3 id="sec-1-133"><span class="section-number-3">1.133</span> <span class="done DONE">DONE</span> 如何安装python beautifulsoup？</h3>
<div class="outline-text-3" id="text-1-133">
<p>
？学习爬虫。
</p>

<p>
Python网络数据采集 p5
</p>
<pre class="example">
sudo pip install beautifulsoup4
</pre>

<p>
检验
</p>
<pre class="example">
# 进入python交互程序检验。
from bs4 import BeautifulSoup
</pre>
</div>
</div>

<div id="outline-container-sec-1-134" class="outline-3">
<h3 id="sec-1-134"><span class="section-number-3">1.134</span> <span class="done DONE">DONE</span> 如何使用linux dd制作fedora安装优盘？</h3>
<div class="outline-text-3" id="text-1-134">
<p>
？解决ultraiso、poweriso写入优盘无法启动的问题。
</p>

<p>
<a href="http://hongxchen.github.io/2014/07/19/making-fedora-usb-media-with-dd/">http://hongxchen.github.io/2014/07/19/making-fedora-usb-media-with-dd/</a>
很多人在windows下直接用一些工具直接将iso写入U盘或者硬盘，这个是U盘安装windows的方法，在fedora上是不行的，因为fedora的iso其实是分轨镜像，在一个iso镜像里有若干个分区，正确的方法是在Linux或者mac下使用dd来做，windows请下载MinGW。
</p>

<pre class="example">
iso="/home/yjr/Downloads/Fedora-Workstation-Live-x86_64-24-1.2.iso"
disk="/dev/sdc"

dd if="$iso" of="$disk"
</pre>

<p>
adata威刚成功，netac朗科失败
</p>
</div>
</div>

<div id="outline-container-sec-1-135" class="outline-3">
<h3 id="sec-1-135"><span class="section-number-3">1.135</span> 如何检索fdisk中l选项的详细信息？</h3>
<div class="outline-text-3" id="text-1-135">
<p>
<a href="https://www.google.com/search?q=partition+type+partition+table">https://www.google.com/search?q=partition+type+partition+table</a>
<a href="https://en.wikipedia.org/wiki/Partition_type">https://en.wikipedia.org/wiki/Partition_type</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-136" class="outline-3">
<h3 id="sec-1-136"><span class="section-number-3">1.136</span> 如何检索笔记本电脑主板是uefi或efi或bios类型？</h3>
<div class="outline-text-3" id="text-1-136">
<p>
<a href="https://www.google.com/search?q=how+to+know+motherboard+uefi+bios">https://www.google.com/search?q=how+to+know+motherboard+uefi+bios</a>
<a href="http://www.thewindowsclub.com/check-if-uefi-or-bios">http://www.thewindowsclub.com/check-if-uefi-or-bios</a>
</p>
<pre class="example">
If your PC supports UEFI, then if you go through your BIOS settings, you will see the Secure Boot option.
</pre>
</div>
</div>
<div id="outline-container-sec-1-137" class="outline-3">
<h3 id="sec-1-137"><span class="section-number-3">1.137</span> 什么是grub2优盘dos gpt分区表区别？</h3>
</div>
<div id="outline-container-sec-1-138" class="outline-3">
<h3 id="sec-1-138"><span class="section-number-3">1.138</span> 如何解决linux umount报错"target is busy"？</h3>
<div class="outline-text-3" id="text-1-138">
<p>
？解决拔出优盘问题。
</p>
</div>
</div>
<div id="outline-container-sec-1-139" class="outline-3">
<h3 id="sec-1-139"><span class="section-number-3">1.139</span> <span class="done DONE">DONE</span> 如何设置软件工程目录（测试）的各目录？</h3>
<div class="outline-text-3" id="text-1-139">
<p>
？开发grub2脚本需要使用。
</p>

<p>
<a href="https://www.google.com/search?q=junit+%E7%9B%AE%E5%BD%95+%E7%BB%93%E6%9E%84&ie=utf-8&oe=utf-8">https://www.google.com/search?q=junit+%E7%9B%AE%E5%BD%95+%E7%BB%93%E6%9E%84&ie=utf-8&oe=utf-8</a>
<a href="http://blog.csdn.net/jadyer/article/details/9280581">http://blog.csdn.net/jadyer/article/details/9280581</a>
test是src子目录。
</p>

<p>
<a href="https://www.google.com/search?q=maven+unit+test+hierarchy">https://www.google.com/search?q=maven+unit+test+hierarchy</a>
<a href="https://stackoverflow.com/questions/1540324/java-unit-tests-directory-layout">https://stackoverflow.com/questions/1540324/java-unit-tests-directory-layout</a>
<a href="http://maven.apache.org/guides/introduction/introduction-to-the-standard-directory-layout.html">http://maven.apache.org/guides/introduction/introduction-to-the-standard-directory-layout.html</a>
</p>
<pre class="example">
module/
  src/
    main/
      java/
    test/
      java/
</pre>

<p>
选择apache的目录结构。
</p>
</div>
</div>

<div id="outline-container-sec-1-140" class="outline-3">
<h3 id="sec-1-140"><span class="section-number-3">1.140</span> 如何设置emacs shell当前目录为emacs dired当前目录？</h3>
<div class="outline-text-3" id="text-1-140">
<p>
？高效率设置emacs shell默认目录。
</p>
</div>
</div>
<div id="outline-container-sec-1-141" class="outline-3">
<h3 id="sec-1-141"><span class="section-number-3">1.141</span> 如何解决emacs shell调用bash脚本输入密码为明文？</h3>
<div class="outline-text-3" id="text-1-141">
<p>
？保护隐私。
</p>
</div>
</div>
<div id="outline-container-sec-1-142" class="outline-3">
<h3 id="sec-1-142"><span class="section-number-3">1.142</span> <span class="done DONE">DONE</span> 什么是yasnippet目录？</h3>
<div class="outline-text-3" id="text-1-142">
<p>
？上传到github。
</p>

<p>
<a href="http://joaotavora.github.io/yasnippet/">http://joaotavora.github.io/yasnippet/</a>
<a href="http://joaotavora.github.io/yasnippet/snippet-organization.html">http://joaotavora.github.io/yasnippet/snippet-organization.html</a>
~/.emacs.d/snippets
</p>
</div>
</div>
<div id="outline-container-sec-1-143" class="outline-3">
<h3 id="sec-1-143"><span class="section-number-3">1.143</span> <span class="done DONE">DONE</span> 如何编写软件文档？</h3>
<div class="outline-text-3" id="text-1-143">
<p>
？用于相关人员检索参考。
</p>

<p>
<a href="https://en.wikipedia.org/wiki/Software_documentation">https://en.wikipedia.org/wiki/Software_documentation</a>
<a href="https://zh.wikipedia.org/wiki/%E8%BD%AF%E4%BB%B6%E6%96%87%E6%A1%A3">https://zh.wikipedia.org/wiki/%E8%BD%AF%E4%BB%B6%E6%96%87%E6%A1%A3</a>
软件工程 9ed
需求工程
</p>

<pre class="example">
目录结构
引言 Introduce
User
教程 Tutorial
手册 Manual
问题 FAQ
Developer
需求 Requirement
设计 Design
实现&amp;测试 Implement&amp;Test
运维 Maintance
</pre>
</div>
</div>
<div id="outline-container-sec-1-144" class="outline-3">
<h3 id="sec-1-144"><span class="section-number-3">1.144</span> <span class="done DONE">DONE</span> 如何解决linux date +%X不是24小时制？</h3>
<div class="outline-text-3" id="text-1-144">
<p>
？用于git commit，默认信息为时间。
</p>

<p>
<a href="https://www.google.com/search?biw=1920&bih=853&q=date++%25X+why+pm+am">https://www.google.com/search?biw=1920&bih=853&q=date++%25X+why+pm+am</a>
<a href="http://man.linuxde.net/date">http://man.linuxde.net/date</a>
</p>
<pre class="example">
date +"%F %H:%M:%S"
</pre>
</div>
</div>
<div id="outline-container-sec-1-145" class="outline-3">
<h3 id="sec-1-145"><span class="section-number-3">1.145</span> <span class="done DONE">DONE</span> 哪个好，环境变量PATH放在bashrc或bash<sub>profile？</sub></h3>
<div class="outline-text-3" id="text-1-145">
<p>
？解决环境变量放置问题，避免部署时，行动产生歧义。
</p>

<p>
<a href="https://www.google.com/search?q=path+bashrc+bash_profile&ie=utf-8&oe=utf-8">https://www.google.com/search?q=path+bashrc+bash_profile&ie=utf-8&oe=utf-8</a>
<a href="https://unix.stackexchange.com/questions/26047/how-to-correctly-add-a-path-to-path">https://unix.stackexchange.com/questions/26047/how-to-correctly-add-a-path-to-path</a>
Note that ~/.bash<sub>rc</sub> is not read by any program, and ~/.bashrc is the configuration file of interactive instances of bash.
</p>

<p>
总结：bash<sub>profile更稳定，bashrc更方便（新增export，无需重新登录，新建terminal即可）</sub>
</p>
</div>
</div>

<div id="outline-container-sec-1-146" class="outline-3">
<h3 id="sec-1-146"><span class="section-number-3">1.146</span> 如何git commit不输入信息message？</h3>
<div class="outline-text-3" id="text-1-146">
<p>
？高效率commit。
</p>
</div>
</div>

<div id="outline-container-sec-1-147" class="outline-3">
<h3 id="sec-1-147"><span class="section-number-3">1.147</span> 如何解决xargs并行执行时输出顺序混乱？</h3>
<div class="outline-text-3" id="text-1-147">
<p>
？解决并行ping时，输出乱序。
</p>

<p>
<a href="https://www.google.com/search?biw=1920&bih=853&q=ping+xargs+%E9%A1%BA%E5%BA%8F">https://www.google.com/search?biw=1920&bih=853&q=ping+xargs+%E9%A1%BA%E5%BA%8F</a>
<a href="https://stackoverflow.com/questions/14439755/how-to-ping-each-ip-in-a-file">https://stackoverflow.com/questions/14439755/how-to-ping-each-ip-in-a-file</a>
</p>
<pre class="example">
cat ips | xargs echo ping -c 2
</pre>

<p>
<a href="https://www.google.com/search?biw=1920&bih=853&q=ping+xargs+%E5%B9%B6%E8%A1%8C">https://www.google.com/search?biw=1920&bih=853&q=ping+xargs+%E5%B9%B6%E8%A1%8C</a>
<a href="https://www.zhihu.com/question/20082099">https://www.zhihu.com/question/20082099</a>
整个命令用（）套上重定向就行。
</p>
</div>
</div>

<div id="outline-container-sec-1-148" class="outline-3">
<h3 id="sec-1-148"><span class="section-number-3">1.148</span> <span class="done DONE">DONE</span> 什么是xargs -i -I的区别？</h3>
<div class="outline-text-3" id="text-1-148">
<p>
？解决xargs指定参数位置时，选项-i、-I的理解。
</p>

<p>
<a href="https://www.google.com/search?q=xargs+%E5%B9%B6%E8%A1%8C&ie=utf-8&oe=utf-8">https://www.google.com/search?q=xargs+%E5%B9%B6%E8%A1%8C&ie=utf-8&oe=utf-8</a>
<a href="https://www.zhihu.com/question/20082099">https://www.zhihu.com/question/20082099</a>
<a href="https://stackoverflow.com/questions/845863/how-to-use-in-an-xargs-command">https://stackoverflow.com/questions/845863/how-to-use-in-an-xargs-command</a>
-I指定参数的位置符号，-i默认使用{}作为参数的位置符号。
</p>
<pre class="example">
ls -1 | xargs -I{} "grep ABC '{}' &gt; '{}'.out"
</pre>
</div>
</div>

<div id="outline-container-sec-1-149" class="outline-3">
<h3 id="sec-1-149"><span class="section-number-3">1.149</span> <span class="done DONE">DONE</span> 如何xargs指定参数位置？</h3>
<div class="outline-text-3" id="text-1-149">
<p>
？用于ping命令指定ip参数位置。
</p>

<p>
<a href="https://www.google.com/search?q=+xargs+specific&ie=utf-8&oe=utf-8">https://www.google.com/search?q=+xargs+specific&ie=utf-8&oe=utf-8</a>
<a href="http://www.linuxask.com/questions/how-to-adjust-the-argument-position-in-xargs">http://www.linuxask.com/questions/how-to-adjust-the-argument-position-in-xargs</a>
</p>
<pre class="example">
echo "foo" | xargs -i echo {} "bar"
</pre>
</div>
</div>
