blog.org
** DONE 如何bash读取cat here doc内联输入重定向<<的内容？（如何bash从标准输入stdin读取多行内容？）
   CLOSED: [2017-06-22 Thu 12:16]
？用于批量生成ss脚本。

Linux命令行与Shell脚本编程大全 2ed p209

https://stackoverflow.com/questions/41563044/how-to-use-shell-keyword-select-to-get-parameters-by-pipeline
#+BEGIN_SRC  
mapfile -t input </dev/stdin
readarray -t input </dev/stdin
#+END_SRC

- https://www.gnu.org/software/bash/manual/html_node/Bash-Builtins.html
readarray
A synonym for mapfile. 

https://www.google.com/search?q=how+to+read+from+standard+input+bash&ie=utf-8&oe=utf-8
https://stackoverflow.com/questions/6980090/how-to-read-from-file-or-stdin-in-bash
#+BEGIN_SRC  
while read line
do
  echo "$line"
done < "${1:-/dev/stdin}"
#+END_SRC
https://stackoverflow.com/questions/212965/how-to-read-mutliline-input-from-stdin-into-variable-and-how-to-print-one-out-in
#+BEGIN_SRC  
myVar=$(</dev/stdin)
#+END_SRC

** 如何使用grub2引导winpe？
？测试出结果再归纳。
https://www.google.com/search?q=grub2+winpe
http://www.xzcblog.com/post-243.html
首先我们要获得syslinux的memdisk模块，如果是Linux系统那么基本上都自带了此模块。
/usr/lib/syslinux/memdisk

#+BEGIN_SRC  
find / -name *memdis*
#+END_SRC

menuentry 'Boot Windows PE ISO'{
		#set root='(hd0,msdos1)'
		echo 'Loading Memdisk...'
		#insmod memdisk
		linux16 /boot/memdisk iso raw
		echo 'Loading ISO...'
		initrd16 (hd1,msdos8)/iso/PE2013.iso
}
** 如何解决grub2 shell加载模块报错"file not found memdisk"
？解决grub2引导winpe。 

https://www.google.com/search?biw=960&bih=853&q=grub+shell+file+not+found+memdisk
https://unix.stackexchange.com/questions/48823/new-menu-entry-in-grub2-file-not-found-and-you-need-to-load-the-kernel-first
Because you have a dedicated /boot partition ( you probably don't need one ), that partition has no directory named /boot, hence why the files are not found. Remove the /boot from the path.
** 如何grub2 shell切换分区？
？需要加载不在/boot分区里的iso镜像文件（因为/boot空间不足）

https://www.google.com/search?q=how+to+change+boot+partition+grub2+shell
https://askubuntu.com/questions/84501/how-can-i-change-convert-a-ubuntu-mbr-drive-to-a-gpt-and-make-ubuntu-boot-from
#+BEGIN_SRC  

#+END_SRC
https://www.linux.com/learn/how-rescue-non-booting-grub-2-linux
#+BEGIN_SRC  
What's all this msdos stuff? That means this system has the old-style MS-DOS partition table, rather than the shiny new Globally Unique Identifiers partition table (GPT).
#+END_SRC
** 如何linux增加分区空间？
？解决fedora虚拟机/boot分区空间不足放入winpe的iso镜像，grub2无法加载镜像的问题。
** DONE 如何查看linux分区的文件系统类型？
   CLOSED: [2017-06-21 Wed 23:55]
？用于grub2切换分区时，加载文件系统的模块，解决"error unknown filesystem"问题。

https://www.google.com/search?q=linux+how+to+know+partition+filesystem+type
https://askubuntu.com/questions/309047/how-do-i-find-out-what-filesystem-my-partitions-are-using
#+BEGIN_SRC  
df -T
#+END_SRC
** 如何解决grub2 shell切换分区报错"error unknown filesystem"？

** 如何进入grub2 shell？
？用于测试加载memdisk模块，引导winpe镜像。

#+BEGIN_SRC  
c #grub2提示
#+END_SRC

** DONE 如何解决virtualbox fedora linux安装addition增强包报错"failed to set up service vboxadd"
   CLOSED: [2017-06-22 Thu 21:12]
？用于从宿主拷贝winpe镜像到虚拟机，测试grub2。

新安装的fedora24。
   
https://www.google.com/search?q=failed+to+set+up+service+vboxadd+fedora
https://ask.fedoraproject.org/en/question/89829/error-adding-guest-additions-in-f24/
#+BEGIN_SRC  
# 测试后，主要是kernel-devel没装。
sudo dnf update # 更新repo，之后就可以使用tab补全kernel-devel了。

sudo dnf install kernel-devel # tab补全

# 安装增强包
cd /run/media/$your_name/$VBox # 补全用户名和VB目录，2次
sudo ./VBoxL # tab补全

# 安装完毕，reboot
#+END_SRC

** TODO 如何解决virtualbox fedora linux挂载共享文件报错"unknown filesystem type vboxsf"？
？用于拷贝宿主的winpe镜像，测试grub2。

https://www.google.com/search?q=unknown+filesystem+type+vboxsf&ie=utf-8&oe=utf-8
https://askubuntu.com/questions/456400/why-cant-i-access-a-shared-folder-from-within-my-virtualbox-machine
安装addition增强包。


** DONE 如何宿主共享文件夹给virtualbox fedora linux？
   CLOSED: [2017-06-21 Wed 21:14]
？用于下载grub2引导winpe用的镜像。

https://www.google.com/search?q=virtualbox+linux+shared+folder
https://serverfault.com/questions/674974/how-to-mount-a-virtualbox-shared-folder/674978
#+BEGIN_SRC  
dir="Downloads"

mkdir ~/share
sudo mount -t vboxsf "$dir" ~/share/
#+END_SRC


** TODO 如何解决插入优盘被virtualbox windows虚拟机优先识别？
？解决制作安装优盘时，fdisk -l查看不到优盘。

virtualbox manager - 右键 - usb
删除filter内容即可。

没有文档支持。
** DONE 如何修改grub2启动界面内容？
   CLOSED: [2017-06-21 Wed 19:28]
？用于测试grub2。

https://www.google.com/search?q=grub2+启动
http://blog.csdn.net/lu_embedded/article/details/44353499
/boot/grub/grub.cfg
#+BEGIN_SRC  
sudo vim /boot/grub/grub2.cfg # fedora 24 重命名grub为grub2

# /menuentry 检索到菜单位置。
#+END_SRC
** 如何使用grub2安装fedora？
为什么使用grub2？fedora 24使用grub2,而不是grub

https://www.google.com/search?q=gpt+mbr+分区表&ie=utf-8&oe=utf-8
http://news.mydrivers.com/1/503/503560.htm
UEFI和GPT是相辅相成的，二者缺一不可，要想使用GPT分区表则必须是UEFI BIOS环境。

[%m:%~] $ grub2-install --force --no-floppy --boot-directory=/mnt/gr /dev/sdb
Installing for x86_64-efi platform.
grub2-install: error: cannot find EFI directory.

https://www.baidu.com/s?wd=grub2%20优盘
http://blog.csdn.net/u010875635/article/details/70170129
fdisk将优盘分区表变为gpt
#+BEGIN_SRC  
grub2-install --no-floppy --root-directory=/mnt/gr /dev/sdc1

# 安装成功
#+END_SRC

