blog.html

<div id="outline-container-sec-1-150" class="outline-3">
<h3 id="sec-1-150"><span class="section-number-3">1.150</span> <span class="done DONE">DONE</span> 如何bash读取cat here doc内联输入重定向&lt;&lt;的内容？（如何bash从标准输入stdin读取多行内容？）</h3>
<div class="outline-text-3" id="text-1-150">
<p>
？用于批量生成ss脚本。
</p>

<p>
Linux命令行与Shell脚本编程大全 2ed p209
</p>

<p>
<a href="https://stackoverflow.com/questions/41563044/how-to-use-shell-keyword-select-to-get-parameters-by-pipeline">https://stackoverflow.com/questions/41563044/how-to-use-shell-keyword-select-to-get-parameters-by-pipeline</a>
</p>
<pre class="example">
mapfile -t input &lt;/dev/stdin
readarray -t input &lt;/dev/stdin
</pre>

<ul class="org-ul">
<li><a href="https://www.gnu.org/software/bash/manual/html_node/Bash-Builtins.html">https://www.gnu.org/software/bash/manual/html_node/Bash-Builtins.html</a>
</li>
</ul>
<p>
readarray
A synonym for mapfile. 
</p>

<p>
<a href="https://www.google.com/search?q=how+to+read+from+standard+input+bash&ie=utf-8&oe=utf-8">https://www.google.com/search?q=how+to+read+from+standard+input+bash&ie=utf-8&oe=utf-8</a>
<a href="https://stackoverflow.com/questions/6980090/how-to-read-from-file-or-stdin-in-bash">https://stackoverflow.com/questions/6980090/how-to-read-from-file-or-stdin-in-bash</a>
</p>
<pre class="example">
while read line
do
  echo "$line"
done &lt; "${1:-/dev/stdin}"
</pre>
<p>
<a href="https://stackoverflow.com/questions/212965/how-to-read-mutliline-input-from-stdin-into-variable-and-how-to-print-one-out-in">https://stackoverflow.com/questions/212965/how-to-read-mutliline-input-from-stdin-into-variable-and-how-to-print-one-out-in</a>
</p>
<pre class="example">
myVar=$(&lt;/dev/stdin)
</pre>
</div>
</div>

<div id="outline-container-sec-1-151" class="outline-3">
<h3 id="sec-1-151"><span class="section-number-3">1.151</span> 如何使用grub2引导winpe？</h3>
<div class="outline-text-3" id="text-1-151">
<p>
？测试出结果再归纳。
<a href="https://www.google.com/search?q=grub2+winpe">https://www.google.com/search?q=grub2+winpe</a>
<a href="http://www.xzcblog.com/post-243.html">http://www.xzcblog.com/post-243.html</a>
首先我们要获得syslinux的memdisk模块，如果是Linux系统那么基本上都自带了此模块。
/usr/lib/syslinux/memdisk
</p>

<pre class="example">
find / -name *memdis*
</pre>

<p>
menuentry 'Boot Windows PE ISO'{
        #set root='(hd0,msdos1)'
        echo 'Loading Memdisk&#x2026;'
        #insmod memdisk
        linux16 /boot/memdisk iso raw
        echo 'Loading ISO&#x2026;'
        initrd16 (hd1,msdos8)/iso/PE2013.iso
}
</p>
</div>
</div>
<div id="outline-container-sec-1-152" class="outline-3">
<h3 id="sec-1-152"><span class="section-number-3">1.152</span> 如何解决grub2 shell加载模块报错"file not found memdisk"</h3>
<div class="outline-text-3" id="text-1-152">
<p>
？解决grub2引导winpe。 
</p>

<p>
<a href="https://www.google.com/search?biw=960&bih=853&q=grub+shell+file+not+found+memdisk">https://www.google.com/search?biw=960&bih=853&q=grub+shell+file+not+found+memdisk</a>
<a href="https://unix.stackexchange.com/questions/48823/new-menu-entry-in-grub2-file-not-found-and-you-need-to-load-the-kernel-first">https://unix.stackexchange.com/questions/48823/new-menu-entry-in-grub2-file-not-found-and-you-need-to-load-the-kernel-first</a>
Because you have a dedicated /boot partition ( you probably don't need one ), that partition has no directory named /boot, hence why the files are not found. Remove the /boot from the path.
</p>
</div>
</div>
<div id="outline-container-sec-1-153" class="outline-3">
<h3 id="sec-1-153"><span class="section-number-3">1.153</span> 如何grub2 shell切换分区？</h3>
<div class="outline-text-3" id="text-1-153">
<p>
？需要加载不在/boot分区里的iso镜像文件（因为/boot空间不足）
</p>

<p>
<a href="https://www.google.com/search?q=how+to+change+boot+partition+grub2+shell">https://www.google.com/search?q=how+to+change+boot+partition+grub2+shell</a>
<a href="https://askubuntu.com/questions/84501/how-can-i-change-convert-a-ubuntu-mbr-drive-to-a-gpt-and-make-ubuntu-boot-from">https://askubuntu.com/questions/84501/how-can-i-change-convert-a-ubuntu-mbr-drive-to-a-gpt-and-make-ubuntu-boot-from</a>
</p>
<pre class="example">
</pre>
<p>
<a href="https://www.linux.com/learn/how-rescue-non-booting-grub-2-linux">https://www.linux.com/learn/how-rescue-non-booting-grub-2-linux</a>
</p>
<pre class="example">
What's all this msdos stuff? That means this system has the old-style MS-DOS partition table, rather than the shiny new Globally Unique Identifiers partition table (GPT).
</pre>
</div>
</div>
<div id="outline-container-sec-1-154" class="outline-3">
<h3 id="sec-1-154"><span class="section-number-3">1.154</span> 如何linux增加分区空间？</h3>
<div class="outline-text-3" id="text-1-154">
<p>
？解决fedora虚拟机/boot分区空间不足放入winpe的iso镜像，grub2无法加载镜像的问题。
</p>
</div>
</div>
<div id="outline-container-sec-1-155" class="outline-3">
<h3 id="sec-1-155"><span class="section-number-3">1.155</span> <span class="done DONE">DONE</span> 如何查看linux分区的文件系统类型？</h3>
<div class="outline-text-3" id="text-1-155">
<p>
？用于grub2切换分区时，加载文件系统的模块，解决"error unknown filesystem"问题。
</p>

<p>
<a href="https://www.google.com/search?q=linux+how+to+know+partition+filesystem+type">https://www.google.com/search?q=linux+how+to+know+partition+filesystem+type</a>
<a href="https://askubuntu.com/questions/309047/how-do-i-find-out-what-filesystem-my-partitions-are-using">https://askubuntu.com/questions/309047/how-do-i-find-out-what-filesystem-my-partitions-are-using</a>
</p>
<pre class="example">
df -T
</pre>
</div>
</div>
<div id="outline-container-sec-1-156" class="outline-3">
<h3 id="sec-1-156"><span class="section-number-3">1.156</span> 如何解决grub2 shell切换分区报错"error unknown filesystem"？</h3>
</div>

<div id="outline-container-sec-1-157" class="outline-3">
<h3 id="sec-1-157"><span class="section-number-3">1.157</span> 如何进入grub2 shell？</h3>
<div class="outline-text-3" id="text-1-157">
<p>
？用于测试加载memdisk模块，引导winpe镜像。
</p>

<pre class="example">
c #grub2提示
</pre>
</div>
</div>

<div id="outline-container-sec-1-158" class="outline-3">
<h3 id="sec-1-158"><span class="section-number-3">1.158</span> <span class="done DONE">DONE</span> 如何解决virtualbox fedora linux安装addition增强包报错"failed to set up service vboxadd"</h3>
<div class="outline-text-3" id="text-1-158">
<p>
？用于从宿主拷贝winpe镜像到虚拟机，测试grub2。
</p>

<p>
新安装的fedora24。
</p>

<p>
<a href="https://www.google.com/search?q=failed+to+set+up+service+vboxadd+fedora">https://www.google.com/search?q=failed+to+set+up+service+vboxadd+fedora</a>
<a href="https://ask.fedoraproject.org/en/question/89829/error-adding-guest-additions-in-f24/">https://ask.fedoraproject.org/en/question/89829/error-adding-guest-additions-in-f24/</a>
</p>
<pre class="example">
# 测试后，主要是kernel-devel没装。
sudo dnf update # 更新repo，之后就可以使用tab补全kernel-devel了。

sudo dnf install kernel-devel # tab补全

# 安装增强包
cd /run/media/$your_name/$VBox # 补全用户名和VB目录，2次
sudo ./VBoxL # tab补全

# 安装完毕，reboot
</pre>
</div>
</div>

<div id="outline-container-sec-1-159" class="outline-3">
<h3 id="sec-1-159"><span class="section-number-3">1.159</span> <span class="todo TODO">TODO</span> 如何解决virtualbox fedora linux挂载共享文件报错"unknown filesystem type vboxsf"？</h3>
<div class="outline-text-3" id="text-1-159">
<p>
？用于拷贝宿主的winpe镜像，测试grub2。
</p>

<p>
<a href="https://www.google.com/search?q=unknown+filesystem+type+vboxsf&ie=utf-8&oe=utf-8">https://www.google.com/search?q=unknown+filesystem+type+vboxsf&ie=utf-8&oe=utf-8</a>
<a href="https://askubuntu.com/questions/456400/why-cant-i-access-a-shared-folder-from-within-my-virtualbox-machine">https://askubuntu.com/questions/456400/why-cant-i-access-a-shared-folder-from-within-my-virtualbox-machine</a>
安装addition增强包。
</p>
</div>
</div>


<div id="outline-container-sec-1-160" class="outline-3">
<h3 id="sec-1-160"><span class="section-number-3">1.160</span> <span class="done DONE">DONE</span> 如何宿主共享文件夹给virtualbox fedora linux？</h3>
<div class="outline-text-3" id="text-1-160">
<p>
？用于下载grub2引导winpe用的镜像。
</p>

<p>
<a href="https://www.google.com/search?q=virtualbox+linux+shared+folder">https://www.google.com/search?q=virtualbox+linux+shared+folder</a>
<a href="https://serverfault.com/questions/674974/how-to-mount-a-virtualbox-shared-folder/674978">https://serverfault.com/questions/674974/how-to-mount-a-virtualbox-shared-folder/674978</a>
</p>
<pre class="example">
dir="Downloads"

mkdir ~/share
sudo mount -t vboxsf "$dir" ~/share/
</pre>
</div>
</div>


<div id="outline-container-sec-1-161" class="outline-3">
<h3 id="sec-1-161"><span class="section-number-3">1.161</span> <span class="todo TODO">TODO</span> 如何解决插入优盘被virtualbox windows虚拟机优先识别？</h3>
<div class="outline-text-3" id="text-1-161">
<p>
？解决制作安装优盘时，fdisk -l查看不到优盘。
</p>

<p>
virtualbox manager - 右键 - usb
删除filter内容即可。
</p>

<p>
没有文档支持。
</p>
</div>
</div>
<div id="outline-container-sec-1-162" class="outline-3">
<h3 id="sec-1-162"><span class="section-number-3">1.162</span> <span class="done DONE">DONE</span> 如何修改grub2启动界面内容？</h3>
<div class="outline-text-3" id="text-1-162">
<p>
？用于测试grub2。
</p>

<p>
<a href="https://www.google.com/search?q=grub2+%E5%90%AF%E5%8A%A8">https://www.google.com/search?q=grub2+%E5%90%AF%E5%8A%A8</a>
<a href="http://blog.csdn.net/lu_embedded/article/details/44353499">http://blog.csdn.net/lu_embedded/article/details/44353499</a>
/boot/grub/grub.cfg
</p>
<pre class="example">
sudo vim /boot/grub/grub2.cfg # fedora 24 重命名grub为grub2

# /menuentry 检索到菜单位置。
</pre>
</div>
</div>
<div id="outline-container-sec-1-163" class="outline-3">
<h3 id="sec-1-163"><span class="section-number-3">1.163</span> 如何使用grub2安装fedora？</h3>
<div class="outline-text-3" id="text-1-163">
<p>
为什么使用grub2？fedora 24使用grub2,而不是grub
</p>

<p>
<a href="https://www.google.com/search?q=gpt+mbr+%E5%88%86%E5%8C%BA%E8%A1%A8&ie=utf-8&oe=utf-8">https://www.google.com/search?q=gpt+mbr+%E5%88%86%E5%8C%BA%E8%A1%A8&ie=utf-8&oe=utf-8</a>
<a href="http://news.mydrivers.com/1/503/503560.htm">http://news.mydrivers.com/1/503/503560.htm</a>
UEFI和GPT是相辅相成的，二者缺一不可，要想使用GPT分区表则必须是UEFI BIOS环境。
</p>

<p>
[%m:%~] $ grub2-install &#x2013;force &#x2013;no-floppy &#x2013;boot-directory=/mnt/gr /dev/sdb
Installing for x86<sub>64</sub>-efi platform.
grub2-install: error: cannot find EFI directory.
</p>

<p>
<a href="https://www.baidu.com/s?wd=grub2%20%E4%BC%98%E7%9B%98">https://www.baidu.com/s?wd=grub2%20%E4%BC%98%E7%9B%98</a>
<a href="http://blog.csdn.net/u010875635/article/details/70170129">http://blog.csdn.net/u010875635/article/details/70170129</a>
fdisk将优盘分区表变为gpt
</p>
<pre class="example">
grub2-install --no-floppy --root-directory=/mnt/gr /dev/sdc1
