blog.org
** TODO 如何制作grub2 bios mbr安装优盘？
？解决暂时没有uefi gpt文档，学习bios mbr，再学习uefi gpt。

https://www.google.com/search?q=优盘+安装+grub2+urfi
http://bbs.archlinuxcn.org/viewtopic.php?id=2954

#+BEGIN_SRC  
mount /dev/sdb1 /mnt

grub2-install --target=i386-pc --recheck --boot-directory=/mnt /dev/sdb
# 安装失败
#+END_SRC

https://www.google.com/search?biw=1920&bih=861&q=grub2+U盘+安装
https://www.zouyesheng.com/install-grub-on-udisk.html
#+BEGIN_SRC  
# 切换为root
su

fdisk -l # 查看，避免误删除

device="/dev/sdc"
mnt_point="/mnt"

cfg="/boot/grub2/grub.cfg" # 需要文档

partition="${device}1" # 默认分区1。
target_cfg_dir="${mnt_point}/boot/grub2"

cat<<end
$device
$mnt_point
$cfg
$partition
$target_cfg_dir
end

umount "$partition"
mkfs.vfat -F 32 -n MULTIBOOT "$partition"

# 安装grub2
mount "$partition" "$mnt_point"
grub2-install --force --no-floppy --root-directory="$mnt_point" "$device"

# 复制备份文件，不规范，应该是自动生成。缺乏文档，需要补上
cp "$cfg" "$target_cfg_dir"

# u3000成功，k650不成功。

cp /boot/extlinux/memdisk /mnt/boot/

#+END_SRC

** 如何避免误删除或误格式化？
？解决安装grub2误操作问题。
** DONE 什么是bios和uefi的区别？
   CLOSED: [2017-06-23 Fri 12:39]
？解决fdisk操作优盘时，选择分区表类型。

https://www.google.com/search?q=bios&ie=utf-8&oe=utf-8
https://en.wikipedia.org/wiki/BIOS
BIOS is non-volatile firmware.

https://en.wikipedia.org/wiki/Unified_Extensible_Firmware_Interface
UEFI is firmware.

https://en.wikipedia.org/wiki/BIOS
https://en.wikipedia.org/wiki/Firmware
firmware is a type of software that provides control, monitoring and data manipulation of engineered products and systems.


** DONE 什么是优盘分区表和grub2的关系？
   CLOSED: [2017-06-23 Fri 14:13]
？使用优盘启动，需要知道其关系。

https://www.google.com/search?q=grub2+mbr+gpt
https://wiki.gentoo.org/wiki/GRUB2/zh-cn
bios主板可以使用mbr、gpt引导，uefi主板使用gpt引导。
https://wiki.archlinux.org/index.php/GRUB_(简体中文)

https://www.google.com/search?q=uefi+only+gpt&ei=cp1MWYXCA4qF8gW2k5PwAg&start=10&sa=N&biw=1920&bih=861
https://community.acer.com/t5/Legacy-Laptops-and-Netbooks/UEFI-BIOS-MBR-GPT-disks-and-multi-boot/m-p/271940
UEFI ONLY supports GPT disks

https://www.google.com/search?q=bios+支持+gpt
https://wzyboy.im/post/1049.html
2009 年之后的主板基本是 BIOS + UEFI 双配置
http://www.cfan.com.cn/2016/0905/127259.shtml
BIOS只支持MBR引导系统，而GPT仅支持UEFI引导系统。所以，现在电脑的主板大多采用BIOS集成UEFI，或UEFI集成BIOS的方式达到同时兼容MBR和GPT引导系统的目的。

https://www.google.com/search?biw=1920&bih=861&q=bios+只支持+mbr
http://iknow.lenovo.com/detail/dc_123214.html
BIOS只支持MBR引导系统，而GPT仅可用UEFI引导系统。

** DONE 什么是grub2-install和grub-install区别？
   CLOSED: [2017-06-23 Fri 11:56]
？fedora 24只有grub2-install。

man grub2-install

https://www.google.com/search?q=grub2-install命令
https://www.ibm.com/developerworks/cn/linux/l-grub2/
有些发行版将命令重命名为 grub2-install。

** 如何解决umount: /mnt/gr: target is busy？
？解决无法卸载grub2优盘。
** 如何解决grub2没有/boot/grub/menu.lst文件？
？配置菜单项。

https://www.google.com/search?q=grub2+menu.lst&ie=utf-8&oe=utf-8
https://www.howtogeek.com/196655/how-to-configure-the-grub2-boot-loaders-settings/
GRUB2 doesn’t use a menu.lst file. Instead, its main configuration file is the /boot/grub/grub.cfg file.
Your own GRUB settings are stored in the /etc/default/grub file. Edit this file to change GRUB2’s settings. 

fedora2 24： /boot/grub2/grub.cfg
** DONE 什么是磁盘分区表的区别？
   CLOSED: [2017-06-21 Wed 18:53]
？用于制作grub启动盘。

https://www.google.com/search?q=分区表+dos+gpt
http://dengqi.blog.51cto.com/5685776/1348951
MBR磁盘分区是一种使用最为广泛的分区结构，它也被称为DOS分区结构，但它并不仅仅应用于Windows系统平台，也应用于Linux，基于X86的UNIX等系统平台。它位于磁盘的0号扇区（一扇区等于512字节），是一个重要的扇区（简称MBR扇区）。

https://www.google.com/search?q=mbr+dos+difference
https://serverfault.com/questions/42608/what-is-the-difference-between-a-dos-and-solaris-mbr
I believe the difference is that DOS uses the IBM Standard Master Boot Record format defined by IBM back in the early 80's
** 如何使用windows制作fedora usb优盘安装盘？
https://www.google.com/search?q=制作+usb+fedora++安装盘


使用ultraiso启动会报错"Warning: dracut-initqueue timeout - starting timeout scripts"
使用poweriso启动会报错"Warning: dracut-initqueue timeout - starting timeout scripts"
https://www.google.com/search?q=warning+dracut-initqueue+timeout&ie=utf-8&oe=utf-8

** DONE 如何linux cli shell格式化优盘为ntfs？
   CLOSED: [2017-06-21 Wed 15:52]
？使用优盘传输fedora iso。

ref 鸟哥的Linux私房菜 基础学习篇 3ed p217
fdisk mkfs

https://www.google.com/search?biw=1920&bih=861&q=fdisk+ntfs
https://unix.stackexchange.com/questions/252625/how-can-i-use-fdisk-to-create-a-ntfs-partition-on-dev-sdx

#+BEGIN_SRC  
sudo fdisk $dev

sudo mkfs.ntfs $partition --fast
#+END_SRC
** 如何解决linux格式化优盘时报错"Re-reading the partition table failed.: Device or resource busy"？
？解决格式化完毕后报错。

** DONE 如何linux快速格式化优盘？
   CLOSED: [2017-06-21 Wed 15:43]
？mkfs.ntfs格式化太慢，因为使用0填充优盘。

https://www.google.com/search?q=mkfs+ntfs+fast
-f或--fast参数 

** DONE 如何选择usb优盘的文件系统格式？
   CLOSED: [2017-06-21 Wed 13:40]
？用于通用windows、linux、mac

https://www.google.com/search?q=linux+mac+通用+格式
https://www.v2ex.com/t/96483
ntfs

https://www.google.com/search?q=windows+linux++通用+格式
https://www.zhihu.com/question/20448164
hfs+
ext4

https://www.google.com/search?q=mac+支持+ext
http://bbs.feng.com/read-htm-tid-7503752.html
mac不支持ext4

