blog.html

# 安装成功
</pre>
</div>
</div>

<div id="outline-container-sec-1-164" class="outline-3">
<h3 id="sec-1-164"><span class="section-number-3">1.164</span> <span class="todo TODO">TODO</span> 如何制作grub2 bios mbr安装优盘？</h3>
<div class="outline-text-3" id="text-1-164">
<p>
？解决暂时没有uefi gpt文档，学习bios mbr，再学习uefi gpt。
</p>

<p>
<a href="https://www.google.com/search?q=%E4%BC%98%E7%9B%98+%E5%AE%89%E8%A3%85+grub2+urfi">https://www.google.com/search?q=%E4%BC%98%E7%9B%98+%E5%AE%89%E8%A3%85+grub2+urfi</a>
<a href="http://bbs.archlinuxcn.org/viewtopic.php?id=2954">http://bbs.archlinuxcn.org/viewtopic.php?id=2954</a>
</p>

<pre class="example">
mount /dev/sdb1 /mnt

grub2-install --target=i386-pc --recheck --boot-directory=/mnt /dev/sdb
# 安装失败
</pre>

<p>
<a href="https://www.google.com/search?biw=1920&bih=861&q=grub2+U%E7%9B%98+%E5%AE%89%E8%A3%85">https://www.google.com/search?biw=1920&bih=861&q=grub2+U%E7%9B%98+%E5%AE%89%E8%A3%85</a>
<a href="https://www.zouyesheng.com/install-grub-on-udisk.html">https://www.zouyesheng.com/install-grub-on-udisk.html</a>
</p>
<pre class="example">
# 切换为root
su

fdisk -l # 查看，避免误删除

device="/dev/sdc"
mnt_point="/mnt"

cfg="/boot/grub2/grub.cfg" # 需要文档

partition="${device}1" # 默认分区1。
target_cfg_dir="${mnt_point}/boot/grub2"

cat&lt;&lt;end
$device
$mnt_point
$cfg
$partition
$target_cfg_dir
end

umount "$partition"
mkfs.vfat -F 32 -n MULTIBOOT "$partition"

# 安装grub2
mount "$partition" "$mnt_point"
grub2-install --force --no-floppy --root-directory="$mnt_point" "$device"

# 复制备份文件，不规范，应该是自动生成。缺乏文档，需要补上
cp "$cfg" "$target_cfg_dir"

# u3000成功，k650不成功。

cp /boot/extlinux/memdisk /mnt/boot/
</pre>
</div>
</div>

<div id="outline-container-sec-1-165" class="outline-3">
<h3 id="sec-1-165"><span class="section-number-3">1.165</span> 如何避免误删除或误格式化？</h3>
<div class="outline-text-3" id="text-1-165">
<p>
？解决安装grub2误操作问题。
</p>
</div>
</div>
<div id="outline-container-sec-1-166" class="outline-3">
<h3 id="sec-1-166"><span class="section-number-3">1.166</span> <span class="done DONE">DONE</span> 什么是bios和uefi的区别？</h3>
<div class="outline-text-3" id="text-1-166">
<p>
？解决fdisk操作优盘时，选择分区表类型。
</p>

<p>
<a href="https://www.google.com/search?q=bios&ie=utf-8&oe=utf-8">https://www.google.com/search?q=bios&ie=utf-8&oe=utf-8</a>
<a href="https://en.wikipedia.org/wiki/BIOS">https://en.wikipedia.org/wiki/BIOS</a>
BIOS is non-volatile firmware.
</p>

<p>
<a href="https://en.wikipedia.org/wiki/Unified_Extensible_Firmware_Interface">https://en.wikipedia.org/wiki/Unified_Extensible_Firmware_Interface</a>
UEFI is firmware.
</p>

<p>
<a href="https://en.wikipedia.org/wiki/BIOS">https://en.wikipedia.org/wiki/BIOS</a>
<a href="https://en.wikipedia.org/wiki/Firmware">https://en.wikipedia.org/wiki/Firmware</a>
firmware is a type of software that provides control, monitoring and data manipulation of engineered products and systems.
</p>
</div>
</div>


<div id="outline-container-sec-1-167" class="outline-3">
<h3 id="sec-1-167"><span class="section-number-3">1.167</span> <span class="done DONE">DONE</span> 什么是优盘分区表和grub2的关系？</h3>
<div class="outline-text-3" id="text-1-167">
<p>
？使用优盘启动，需要知道其关系。
</p>

<p>
<a href="https://www.google.com/search?q=grub2+mbr+gpt">https://www.google.com/search?q=grub2+mbr+gpt</a>
<a href="https://wiki.gentoo.org/wiki/GRUB2/zh-cn">https://wiki.gentoo.org/wiki/GRUB2/zh-cn</a>
bios主板可以使用mbr、gpt引导，uefi主板使用gpt引导。
<a href="https://wiki.archlinux.org/index.php/GRUB_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)">https://wiki.archlinux.org/index.php/GRUB_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)</a>
</p>

<p>
<a href="https://www.google.com/search?q=uefi+only+gpt&ei=cp1MWYXCA4qF8gW2k5PwAg&start=10&sa=N&biw=1920&bih=861">https://www.google.com/search?q=uefi+only+gpt&ei=cp1MWYXCA4qF8gW2k5PwAg&start=10&sa=N&biw=1920&bih=861</a>
<a href="https://community.acer.com/t5/Legacy-Laptops-and-Netbooks/UEFI-BIOS-MBR-GPT-disks-and-multi-boot/m-p/271940">https://community.acer.com/t5/Legacy-Laptops-and-Netbooks/UEFI-BIOS-MBR-GPT-disks-and-multi-boot/m-p/271940</a>
UEFI ONLY supports GPT disks
</p>

<p>
<a href="https://www.google.com/search?q=bios+%E6%94%AF%E6%8C%81+gpt">https://www.google.com/search?q=bios+%E6%94%AF%E6%8C%81+gpt</a>
<a href="https://wzyboy.im/post/1049.html">https://wzyboy.im/post/1049.html</a>
2009 年之后的主板基本是 BIOS + UEFI 双配置
<a href="http://www.cfan.com.cn/2016/0905/127259.shtml">http://www.cfan.com.cn/2016/0905/127259.shtml</a>
BIOS只支持MBR引导系统，而GPT仅支持UEFI引导系统。所以，现在电脑的主板大多采用BIOS集成UEFI，或UEFI集成BIOS的方式达到同时兼容MBR和GPT引导系统的目的。
</p>

<p>
<a href="https://www.google.com/search?biw=1920&bih=861&q=bios+%E5%8F%AA%E6%94%AF%E6%8C%81+mbr">https://www.google.com/search?biw=1920&bih=861&q=bios+%E5%8F%AA%E6%94%AF%E6%8C%81+mbr</a>
<a href="http://iknow.lenovo.com/detail/dc_123214.html">http://iknow.lenovo.com/detail/dc_123214.html</a>
BIOS只支持MBR引导系统，而GPT仅可用UEFI引导系统。
</p>
</div>
</div>

<div id="outline-container-sec-1-168" class="outline-3">
<h3 id="sec-1-168"><span class="section-number-3">1.168</span> <span class="done DONE">DONE</span> 什么是grub2-install和grub-install区别？</h3>
<div class="outline-text-3" id="text-1-168">
<p>
？fedora 24只有grub2-install。
</p>

<p>
man grub2-install
</p>

<p>
<a href="https://www.google.com/search?q=grub2-install%E5%91%BD%E4%BB%A4">https://www.google.com/search?q=grub2-install%E5%91%BD%E4%BB%A4</a>
<a href="https://www.ibm.com/developerworks/cn/linux/l-grub2/">https://www.ibm.com/developerworks/cn/linux/l-grub2/</a>
有些发行版将命令重命名为 grub2-install。
</p>
</div>
</div>

<div id="outline-container-sec-1-169" class="outline-3">
<h3 id="sec-1-169"><span class="section-number-3">1.169</span> 如何解决umount: /mnt/gr: target is busy？</h3>
<div class="outline-text-3" id="text-1-169">
<p>
？解决无法卸载grub2优盘。
</p>
</div>
</div>
<div id="outline-container-sec-1-170" class="outline-3">
<h3 id="sec-1-170"><span class="section-number-3">1.170</span> 如何解决grub2没有/boot/grub/menu.lst文件？</h3>
<div class="outline-text-3" id="text-1-170">
<p>
？配置菜单项。
</p>

<p>
<a href="https://www.google.com/search?q=grub2+menu.lst&ie=utf-8&oe=utf-8">https://www.google.com/search?q=grub2+menu.lst&ie=utf-8&oe=utf-8</a>
<a href="https://www.howtogeek.com/196655/how-to-configure-the-grub2-boot-loaders-settings/">https://www.howtogeek.com/196655/how-to-configure-the-grub2-boot-loaders-settings/</a>
GRUB2 doesn’t use a menu.lst file. Instead, its main configuration file is the /boot/grub/grub.cfg file.
Your own GRUB settings are stored in the /etc/default/grub file. Edit this file to change GRUB2’s settings. 
</p>

<p>
fedora2 24： /boot/grub2/grub.cfg
</p>
</div>
</div>
<div id="outline-container-sec-1-171" class="outline-3">
<h3 id="sec-1-171"><span class="section-number-3">1.171</span> <span class="done DONE">DONE</span> 什么是磁盘分区表的区别？</h3>
<div class="outline-text-3" id="text-1-171">
<p>
？用于制作grub启动盘。
</p>

<p>
<a href="https://www.google.com/search?q=%E5%88%86%E5%8C%BA%E8%A1%A8+dos+gpt">https://www.google.com/search?q=%E5%88%86%E5%8C%BA%E8%A1%A8+dos+gpt</a>
<a href="http://dengqi.blog.51cto.com/5685776/1348951">http://dengqi.blog.51cto.com/5685776/1348951</a>
MBR磁盘分区是一种使用最为广泛的分区结构，它也被称为DOS分区结构，但它并不仅仅应用于Windows系统平台，也应用于Linux，基于X86的UNIX等系统平台。它位于磁盘的0号扇区（一扇区等于512字节），是一个重要的扇区（简称MBR扇区）。
</p>

<p>
<a href="https://www.google.com/search?q=mbr+dos+difference">https://www.google.com/search?q=mbr+dos+difference</a>
<a href="https://serverfault.com/questions/42608/what-is-the-difference-between-a-dos-and-solaris-mbr">https://serverfault.com/questions/42608/what-is-the-difference-between-a-dos-and-solaris-mbr</a>
I believe the difference is that DOS uses the IBM Standard Master Boot Record format defined by IBM back in the early 80's
</p>
</div>
</div>
<div id="outline-container-sec-1-172" class="outline-3">
<h3 id="sec-1-172"><span class="section-number-3">1.172</span> 如何使用windows制作fedora usb优盘安装盘？</h3>
<div class="outline-text-3" id="text-1-172">
<p>
<a href="https://www.google.com/search?q=%E5%88%B6%E4%BD%9C+usb+fedora++%E5%AE%89%E8%A3%85%E7%9B%98">https://www.google.com/search?q=%E5%88%B6%E4%BD%9C+usb+fedora++%E5%AE%89%E8%A3%85%E7%9B%98</a>
</p>


<p>
使用ultraiso启动会报错"Warning: dracut-initqueue timeout - starting timeout scripts"
使用poweriso启动会报错"Warning: dracut-initqueue timeout - starting timeout scripts"
<a href="https://www.google.com/search?q=warning+dracut-initqueue+timeout&ie=utf-8&oe=utf-8">https://www.google.com/search?q=warning+dracut-initqueue+timeout&ie=utf-8&oe=utf-8</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-173" class="outline-3">
<h3 id="sec-1-173"><span class="section-number-3">1.173</span> <span class="done DONE">DONE</span> 如何linux cli shell格式化优盘为ntfs？</h3>
<div class="outline-text-3" id="text-1-173">
<p>
？使用优盘传输fedora iso。
</p>

<p>
ref 鸟哥的Linux私房菜 基础学习篇 3ed p217
fdisk mkfs
</p>

<p>
<a href="https://www.google.com/search?biw=1920&bih=861&q=fdisk+ntfs">https://www.google.com/search?biw=1920&bih=861&q=fdisk+ntfs</a>
<a href="https://unix.stackexchange.com/questions/252625/how-can-i-use-fdisk-to-create-a-ntfs-partition-on-dev-sdx">https://unix.stackexchange.com/questions/252625/how-can-i-use-fdisk-to-create-a-ntfs-partition-on-dev-sdx</a>
</p>

<pre class="example">
sudo fdisk $dev

sudo mkfs.ntfs $partition --fast
</pre>
</div>
</div>
<div id="outline-container-sec-1-174" class="outline-3">
<h3 id="sec-1-174"><span class="section-number-3">1.174</span> 如何解决linux格式化优盘时报错"Re-reading the partition table failed.: Device or resource busy"？</h3>
<div class="outline-text-3" id="text-1-174">
<p>
？解决格式化完毕后报错。
</p>
</div>
</div>

<div id="outline-container-sec-1-175" class="outline-3">
<h3 id="sec-1-175"><span class="section-number-3">1.175</span> <span class="done DONE">DONE</span> 如何linux快速格式化优盘？</h3>
<div class="outline-text-3" id="text-1-175">
<p>
？mkfs.ntfs格式化太慢，因为使用0填充优盘。
</p>

<p>
<a href="https://www.google.com/search?q=mkfs+ntfs+fast">https://www.google.com/search?q=mkfs+ntfs+fast</a>
-f或&#x2013;fast参数 
</p>
</div>
</div>

<div id="outline-container-sec-1-176" class="outline-3">
<h3 id="sec-1-176"><span class="section-number-3">1.176</span> <span class="done DONE">DONE</span> 如何选择usb优盘的文件系统格式？</h3>
<div class="outline-text-3" id="text-1-176">
<p>
？用于通用windows、linux、mac
</p>

<p>
<a href="https://www.google.com/search?q=linux+mac+%E9%80%9A%E7%94%A8+%E6%A0%BC%E5%BC%8F">https://www.google.com/search?q=linux+mac+%E9%80%9A%E7%94%A8+%E6%A0%BC%E5%BC%8F</a>
<a href="https://www.v2ex.com/t/96483">https://www.v2ex.com/t/96483</a>
ntfs
</p>

<p>
<a href="https://www.google.com/search?q=windows+linux++%E9%80%9A%E7%94%A8+%E6%A0%BC%E5%BC%8F">https://www.google.com/search?q=windows+linux++%E9%80%9A%E7%94%A8+%E6%A0%BC%E5%BC%8F</a>
<a href="https://www.zhihu.com/question/20448164">https://www.zhihu.com/question/20448164</a>
hfs+
ext4
</p>

<p>
<a href="https://www.google.com/search?q=mac+%E6%94%AF%E6%8C%81+ext">https://www.google.com/search?q=mac+%E6%94%AF%E6%8C%81+ext</a>
<a href="http://bbs.feng.com/read-htm-tid-7503752.html">http://bbs.feng.com/read-htm-tid-7503752.html</a>
mac不支持ext4
</p>
</div>
</div>
